/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package AkAudio.

/// Class /Script/AkAudio.AkPortalComponent
/// Size: 0x00C0 (0x000320 - 0x0003E0)
class UAkPortalComponent : public USceneComponent
{ 
public:
	bool                                               bDynamic;                                                   // 0x0318   (0x0001)  
	AkAcousticPortalState                              InitialState;                                               // 0x0319   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x031A   (0x0002)  MISSED
	float                                              ObstructionRefreshInterval;                                 // 0x031C   (0x0004)  
	TEnumAsByte<ECollisionChannel>                     ObstructionCollisionChannel;                                // 0x0320   (0x0001)  
	unsigned char                                      UnknownData01_6[0xBF];                                      // 0x0321   (0x00BF)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkPortalComponent.PortalPlacementValid
	bool PortalPlacementValid();                                                                                             // [0x168ea90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.OpenPortal
	void OpenPortal();                                                                                                       // [0x168ea70] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkPortalComponent.GetPrimitiveParent
	UPrimitiveComponent* GetPrimitiveParent();                                                                               // [0x168e930] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.GetCurrentState
	AkAcousticPortalState GetCurrentState();                                                                                 // [0x168e840] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkPortalComponent.ClosePortal
	void ClosePortal();                                                                                                      // [0x168e700] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAcousticPortal
/// Size: 0x0010 (0x000260 - 0x000270)
class AAkAcousticPortal : public AVolume
{ 
public:
	UAkPortalComponent*                                Portal;                                                     // 0x0260   (0x0008)  
	AkAcousticPortalState                              InitialState;                                               // 0x0268   (0x0001)  
	bool                                               bRequiresStateMigration;                                    // 0x0269   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x026A   (0x0006)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAcousticPortal.OpenPortal
	void OpenPortal();                                                                                                       // [0x168ea50] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkAcousticPortal.GetCurrentState
	AkAcousticPortalState GetCurrentState();                                                                                 // [0x168e810] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAcousticPortal.ClosePortal
	void ClosePortal();                                                                                                      // [0x168e6e0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAudioType
/// Size: 0x0018 (0x000028 - 0x000040)
class UAkAudioType : public UObject
{ 
public:
	uint32_t                                           ShortID;                                                    // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x002C   (0x0004)  MISSED
	TArray<UObject*>                                   UserData;                                                   // 0x0030   (0x0010)  
};

/// Class /Script/AkAudio.AkAcousticTexture
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkAcousticTexture : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkAcousticTextureSetComponent
/// Size: 0x0010 (0x000320 - 0x000330)
class UAkAcousticTextureSetComponent : public USceneComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0320   (0x0010)  MISSED
};

/// Class /Script/AkAudio.AkAmbientSound
/// Size: 0x0040 (0x000228 - 0x000268)
class AAkAmbientSound : public AActor
{ 
public:
	UAkAudioEvent*                                     AkAudioEvent;                                               // 0x0228   (0x0008)  
	UAkComponent*                                      AkComponent;                                                // 0x0230   (0x0008)  
	bool                                               StopWhenOwnerIsDestroyed;                                   // 0x0238   (0x0001)  
	bool                                               AutoPost;                                                   // 0x0239   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2E];                                      // 0x023A   (0x002E)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAmbientSound.StopAmbientSound
	void StopAmbientSound();                                                                                                 // [0x168fc20] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkAmbientSound.StartAmbientSound
	void StartAmbientSound();                                                                                                // [0x168fc00] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkAndroidInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkAndroidInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAndroidAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkAndroidInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkPlatformInfo
/// Size: 0x0048 (0x000028 - 0x000070)
class UAkPlatformInfo : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0028   (0x0048)  MISSED
};

/// Class /Script/AkAudio.AkAndroidPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkAndroidPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkAssetData
/// Size: 0x0038 (0x000028 - 0x000060)
class UAkAssetData : public UObject
{ 
public:
	uint32_t                                           CachedHash;                                                 // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x34];                                      // 0x002C   (0x0034)  MISSED
};

/// Class /Script/AkAudio.AkAssetDataWithMedia
/// Size: 0x0010 (0x000060 - 0x000070)
class UAkAssetDataWithMedia : public UAkAssetData
{ 
public:
	TArray<UAkMediaAsset*>                             MediaList;                                                  // 0x0060   (0x0010)  
};

/// Class /Script/AkAudio.AkAssetPlatformData
/// Size: 0x0008 (0x000028 - 0x000030)
class UAkAssetPlatformData : public UObject
{ 
public:
	UAkAssetData*                                      CurrentAssetData;                                           // 0x0028   (0x0008)  
};

/// Class /Script/AkAudio.AkAssetBase
/// Size: 0x0010 (0x000040 - 0x000050)
class UAkAssetBase : public UAkAudioType
{ 
public:
	UAkAssetPlatformData*                              PlatformAssetData;                                          // 0x0040   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0048   (0x0008)  MISSED
};

/// Class /Script/AkAudio.AkAudioBank
/// Size: 0x00D8 (0x000050 - 0x000128)
class UAkAudioBank : public UAkAssetBase
{ 
public:
	bool                                               AutoLoad;                                                   // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0051   (0x0007)  MISSED
	TMap<FString, TWeakObjectPtr>                      LocalizedPlatformAssetDataMap;                              // 0x0058   (0x0050)  
	TSet<TWeakObjectPtr>                               LinkedAkEvents;                                             // 0x00A8   (0x0050)  
	UAkAssetPlatformData*                              CurrentLocalizedPlatformAssetData;                          // 0x00F8   (0x0008)  
	unsigned char                                      UnknownData01_6[0x28];                                      // 0x0100   (0x0028)  MISSED
};

/// Class /Script/AkAudio.AkAssetDataSwitchContainerData
/// Size: 0x0050 (0x000028 - 0x000078)
class UAkAssetDataSwitchContainerData : public UObject
{ 
public:
	TWeakObjectPtr<UAkGroupValue*>                     GroupValue;                                                 // 0x0028   (0x0028)  
	UAkGroupValue*                                     DefaultGroupValue;                                          // 0x0050   (0x0008)  
	TArray<UAkMediaAsset*>                             MediaList;                                                  // 0x0058   (0x0010)  
	TArray<UAkAssetDataSwitchContainerData*>           Children;                                                   // 0x0068   (0x0010)  
};

/// Class /Script/AkAudio.AkAssetDataSwitchContainer
/// Size: 0x0018 (0x000070 - 0x000088)
class UAkAssetDataSwitchContainer : public UAkAssetDataWithMedia
{ 
public:
	TArray<UAkAssetDataSwitchContainerData*>           SwitchContainers;                                           // 0x0070   (0x0010)  
	UAkGroupValue*                                     DefaultGroupValue;                                          // 0x0080   (0x0008)  
};

/// Class /Script/AkAudio.AkAudioEventData
/// Size: 0x01C8 (0x000088 - 0x000250)
class UAkAudioEventData : public UAkAssetDataSwitchContainer
{ 
public:
	float                                              MaxAttenuationRadius;                                       // 0x0088   (0x0004)  
	bool                                               IsInfinite;                                                 // 0x008C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x008D   (0x0003)  MISSED
	float                                              MinimumDuration;                                            // 0x0090   (0x0004)  
	float                                              MaximumDuration;                                            // 0x0094   (0x0004)  
	TMap<FString, UAkAssetDataSwitchContainer*>        LocalizedMedia;                                             // 0x0098   (0x0050)  
	TSet<UAkAudioEvent*>                               PostedEvents;                                               // 0x00E8   (0x0050)  
	TSet<UAkAuxBus*>                                   UserDefinedSends;                                           // 0x0138   (0x0050)  
	TSet<UAkTrigger*>                                  PostedTriggers;                                             // 0x0188   (0x0050)  
	TSet<UAkGroupValue*>                               GroupValues;                                                // 0x01D8   (0x0050)  
	unsigned char                                      UnknownData01_6[0x28];                                      // 0x0228   (0x0028)  MISSED
};

/// Class /Script/AkAudio.AkAudioEvent
/// Size: 0x0090 (0x000050 - 0x0000E0)
class UAkAudioEvent : public UAkAssetBase
{ 
public:
	TMap<FString, TWeakObjectPtr>                      LocalizedPlatformAssetDataMap;                              // 0x0050   (0x0050)  
	UAkAudioBank*                                      RequiredBank;                                               // 0x00A0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x00A8   (0x0008)  MISSED
	UAkAssetPlatformData*                              CurrentLocalizedPlatformData;                               // 0x00B0   (0x0008)  
	float                                              MaxAttenuationRadius;                                       // 0x00B8   (0x0004)  
	bool                                               IsInfinite;                                                 // 0x00BC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00BD   (0x0003)  MISSED
	float                                              MinimumDuration;                                            // 0x00C0   (0x0004)  
	float                                              MaximumDuration;                                            // 0x00C4   (0x0004)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x00C8   (0x0018)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkAudioEvent.GetMinimumDuration
	float GetMinimumDuration();                                                                                              // [0x168e900] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetMaximumDuration
	float GetMaximumDuration();                                                                                              // [0x168e8d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetMaxAttenuationRadius
	float GetMaxAttenuationRadius();                                                                                         // [0x168e8a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkAudioEvent.GetIsInfinite
	bool GetIsInfinite();                                                                                                    // [0x168e870] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkGameObject
/// Size: 0x0020 (0x000320 - 0x000340)
class UAkGameObject : public USceneComponent
{ 
public:
	UAkAudioEvent*                                     AkAudioEvent;                                               // 0x0318   (0x0008)  
	FString                                            EventName;                                                  // 0x0320   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0330   (0x0010)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkGameObject.Stop
	void Stop();                                                                                                             // [0x16975e0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.SetRTPCValue
	void SetRTPCValue(UAkRtpc* RTPCValue, float Value, int32_t InterpolationTimeMs, FString RTPC);                           // [0x1695d90] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|Const 
	// Function /Script/AkAudio.AkGameObject.PostAssociatedAkEventAsync
	void PostAssociatedAkEventAsync(UObject* WorldContextObject, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo, int32_t& PlayingID); // [0x1694280] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAssociatedAkEvent
	int32_t PostAssociatedAkEvent(int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources); // [0x16940e0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAkEventAsync
	void PostAkEventAsync(UObject* WorldContextObject, UAkAudioEvent* AkEvent, int32_t& PlayingID, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x1693920] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.PostAkEvent
	int32_t PostAkEvent(UAkAudioEvent* AkEvent, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, FString in_EventName); // [0x16936f0] BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkGameObject.GetRTPCValue
	void GetRTPCValue(UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float& Value, ERTPCValueType& OutputValueType, FString RTPC, int32_t PlayingID); // [0x16921c0] Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkComponent
/// Size: 0x01C0 (0x000340 - 0x000500)
class UAkComponent : public UAkGameObject
{ 
public:
	bool                                               bUseSpatialAudio;                                           // 0x0338   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0339   (0x0007)  MISSED
	bool                                               bIsInDoor;                                                  // 0x0340   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     OcclusionCollisionChannel;                                  // 0x0341   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0342   (0x0002)  MISSED
	bool                                               EnableSpotReflectors;                                       // 0x0344:0 (0x0001)  
	unsigned char                                      UnknownData02_4[0x3];                                       // 0x0345   (0x0003)  MISSED
	float                                              OuterRadius;                                                // 0x0348   (0x0004)  
	float                                              InnerRadius;                                                // 0x034C   (0x0004)  
	UAkAuxBus*                                         EarlyReflectionAuxBus;                                      // 0x0350   (0x0008)  
	FString                                            EarlyReflectionAuxBusName;                                  // 0x0358   (0x0010)  
	int32_t                                            EarlyReflectionOrder;                                       // 0x0368   (0x0004)  
	float                                              EarlyReflectionBusSendGain;                                 // 0x036C   (0x0004)  
	float                                              EarlyReflectionMaxPathLength;                               // 0x0370   (0x0004)  
	float                                              roomReverbAuxBusGain;                                       // 0x0374   (0x0004)  
	int32_t                                            diffractionMaxEdges;                                        // 0x0378   (0x0004)  
	int32_t                                            diffractionMaxPaths;                                        // 0x037C   (0x0004)  
	float                                              diffractionMaxPathLength;                                   // 0x0380   (0x0004)  
	bool                                               DrawFirstOrderReflections;                                  // 0x0384:0 (0x0001)  
	bool                                               DrawSecondOrderReflections;                                 // 0x0384:1 (0x0001)  
	bool                                               DrawHigherOrderReflections;                                 // 0x0384:2 (0x0001)  
	bool                                               DrawDiffraction;                                            // 0x0384:3 (0x0001)  
	unsigned char                                      UnknownData03_4[0x3];                                       // 0x0385   (0x0003)  MISSED
	bool                                               StopWhenOwnerDestroyed;                                     // 0x0388   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0389   (0x0003)  MISSED
	float                                              AttenuationScalingFactor;                                   // 0x038C   (0x0004)  
	float                                              OcclusionRefreshInterval;                                   // 0x0390   (0x0004)  
	bool                                               bUseReverbVolumes;                                          // 0x0394   (0x0001)  
	unsigned char                                      UnknownData05_6[0x16B];                                     // 0x0395   (0x016B)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkComponent.UseReverbVolumes
	void UseReverbVolumes(bool inUseReverbVolumes);                                                                          // [0x168fe30] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.UseEarlyReflections
	void UseEarlyReflections(UAkAuxBus* AuxBus, int32_t Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, FString AuxBusName); // [0x168fc40] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetSwitch
	void SetSwitch(UAkSwitchValue* SwitchValue, FString SwitchGroup, FString SwitchState);                                   // [0x168fa50] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetStopWhenOwnerDestroyed
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed);                                                            // [0x168f9c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetOutputBusVolume
	void SetOutputBusVolume(float BusVolume);                                                                                // [0x168f940] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetListeners
	void SetListeners(TArray<UAkComponent*>& Listeners);                                                                     // [0x168f890] Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetGameObjectRadius
	void SetGameObjectRadius(float in_outerRadius, float in_innerRadius);                                                    // [0x168f730] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetEarlyReflectionsVolume
	void SetEarlyReflectionsVolume(float SendVolume);                                                                        // [0x168f6b0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetEarlyReflectionsAuxBus
	void SetEarlyReflectionsAuxBus(FString AuxBusName);                                                                      // [0x168f610] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.SetAttenuationScalingFactor
	void SetAttenuationScalingFactor(float Value);                                                                           // [0x168f510] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostTrigger
	void PostTrigger(UAkTrigger* TriggerValue, FString Trigger);                                                             // [0x168f2a0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEndAsync
	void PostAssociatedAkEventAndWaitForEndAsync(int32_t& PlayingID, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x168f0d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEnd
	int32_t PostAssociatedAkEventAndWaitForEnd(TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x168ef60] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventByName
	int32_t PostAkEventByName(FString in_EventName);                                                                         // [0x168eeb0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventAndWaitForEndAsync
	void PostAkEventAndWaitForEndAsync(UAkAudioEvent* AkEvent, int32_t& PlayingID, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x168ece0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.PostAkEventAndWaitForEnd
	int32_t PostAkEventAndWaitForEnd(UAkAudioEvent* AkEvent, FString in_EventName, TArray<FAkExternalSourceInfo>& ExternalSources, FLatentActionInfo LatentInfo); // [0x168eaf0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.AkComponent.GetAttenuationRadius
	float GetAttenuationRadius();                                                                                            // [0x168e7b0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkAudioInputComponent
/// Size: 0x0030 (0x000500 - 0x000530)
class UAkAudioInputComponent : public UAkComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x30];                                      // 0x0500   (0x0030)  MISSED
};

/// Class /Script/AkAudio.AkAuxBus
/// Size: 0x0008 (0x000050 - 0x000058)
class UAkAuxBus : public UAkAssetBase
{ 
public:
	UAkAudioBank*                                      RequiredBank;                                               // 0x0050   (0x0008)  
};

/// Class /Script/AkAudio.AkCheckBox
/// Size: 0x0A48 (0x000150 - 0x000B98)
class UAkCheckBox : public UContentWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x348];                                     // 0x0150   (0x0348)  MISSED
	ECheckBoxState                                     CheckedState;                                               // 0x0498   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0499   (0x0003)  MISSED
	FDelegateProperty                                  CheckedStateDelegate;                                       // 0x049C   (0x0010)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x04AC   (0x0004)  MISSED
	FCheckBoxStyle                                     WidgetStyle;                                                // 0x04B0   (0x0610)  
	TEnumAsByte<EHorizontalAlignment>                  HorizontalAlignment;                                        // 0x0AC0   (0x0001)  
	bool                                               IsFocusable;                                                // 0x0AC1   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x0AC2   (0x0006)  MISSED
	FAkBoolPropertyToControl                           ThePropertyToControl;                                       // 0x0AC8   (0x0010)  
	FAkWwiseItemToControl                              ItemToControl;                                              // 0x0AD8   (0x0040)  
	FMulticastInlineDelegate                           AkOnCheckStateChanged;                                      // 0x0B18   (0x0010)  
	FMulticastInlineDelegate                           OnItemDropped;                                              // 0x0B28   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDropped;                                          // 0x0B38   (0x0010)  
	unsigned char                                      UnknownData04_6[0x50];                                      // 0x0B48   (0x0050)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkCheckBox.SetIsChecked
	void SetIsChecked(bool InIsChecked);                                                                                     // [0x168f800] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetCheckedState
	void SetCheckedState(ECheckBoxState InCheckedState);                                                                     // [0x168f590] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetAkItemId
	void SetAkItemId(FGuid& ItemID);                                                                                         // [0x168f470] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.SetAkBoolProperty
	void SetAkBoolProperty(FString ItemProperty);                                                                            // [0x168f3d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkCheckBox.IsPressed
	bool IsPressed();                                                                                                        // [0x168e990] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.IsChecked
	bool IsChecked();                                                                                                        // [0x168e960] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetCheckedState
	ECheckBoxState GetCheckedState();                                                                                        // [0x168e7e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetAkProperty
	FString GetAkProperty();                                                                                                 // [0x168e760] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkCheckBox.GetAkItemId
	FGuid GetAkItemId();                                                                                                     // [0x168e720] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.DrawPortalComponent
/// Size: 0x0000 (0x000540 - 0x000540)
class UDrawPortalComponent : public UPrimitiveComponent
{ 
public:
};

/// Class /Script/AkAudio.DrawRoomComponent
/// Size: 0x0000 (0x000540 - 0x000540)
class UDrawRoomComponent : public UPrimitiveComponent
{ 
public:
};

/// Class /Script/AkAudio.AkFolder
/// Size: 0x0078 (0x000040 - 0x0000B8)
class UAkFolder : public UAkAudioType
{ 
public:
	FString                                            UnrealFolderPath;                                           // 0x0040   (0x0010)  
	FString                                            WwiseFolderPath;                                            // 0x0050   (0x0010)  
	unsigned char                                      UnknownData00_6[0x58];                                      // 0x0060   (0x0058)  MISSED
};

/// Class /Script/AkAudio.AkGameplayStatics
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkGameplayStatics : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkCallbackInfo
/// Size: 0x0008 (0x000028 - 0x000030)
class UAkCallbackInfo : public UObject
{ 
public:
	UAkComponent*                                      AkComponent;                                                // 0x0028   (0x0008)  
};

/// Class /Script/AkAudio.AkEventCallbackInfo
/// Size: 0x0008 (0x000030 - 0x000038)
class UAkEventCallbackInfo : public UAkCallbackInfo
{ 
public:
	int32_t                                            PlayingID;                                                  // 0x0030   (0x0004)  
	int32_t                                            EventId;                                                    // 0x0034   (0x0004)  
};

/// Class /Script/AkAudio.AkMIDIEventCallbackInfo
/// Size: 0x0010 (0x000038 - 0x000048)
class UAkMIDIEventCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0038   (0x0010)  MISSED
};

/// Class /Script/AkAudio.AkMarkerCallbackInfo
/// Size: 0x0018 (0x000038 - 0x000050)
class UAkMarkerCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	int32_t                                            Identifier;                                                 // 0x0038   (0x0004)  
	int32_t                                            Position;                                                   // 0x003C   (0x0004)  
	FString                                            Label;                                                      // 0x0040   (0x0010)  
};

/// Class /Script/AkAudio.AkDurationCallbackInfo
/// Size: 0x0018 (0x000038 - 0x000050)
class UAkDurationCallbackInfo : public UAkEventCallbackInfo
{ 
public:
	float                                              Duration;                                                   // 0x0038   (0x0004)  
	float                                              EstimatedDuration;                                          // 0x003C   (0x0004)  
	int32_t                                            AudioNodeID;                                                // 0x0040   (0x0004)  
	int32_t                                            MediaID;                                                    // 0x0044   (0x0004)  
	bool                                               bStreaming;                                                 // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0049   (0x0007)  MISSED
};

/// Class /Script/AkAudio.AkMusicSyncCallbackInfo
/// Size: 0x0040 (0x000030 - 0x000070)
class UAkMusicSyncCallbackInfo : public UAkCallbackInfo
{ 
public:
	int32_t                                            PlayingID;                                                  // 0x0030   (0x0004)  
	FAkSegmentInfo                                     SegmentInfo;                                                // 0x0034   (0x0024)  
	EAkCallbackType                                    MusicSyncType;                                              // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0059   (0x0007)  MISSED
	FString                                            UserCueName;                                                // 0x0060   (0x0010)  
};

/// Class /Script/AkAudio.AkGeometryComponent
/// Size: 0x0190 (0x000330 - 0x0004C0)
class UAkGeometryComponent : public UAkAcousticTextureSetComponent
{ 
public:
	AkMeshType                                         MeshType;                                                   // 0x0330   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0331   (0x0003)  MISSED
	int32_t                                            LOD;                                                        // 0x0334   (0x0004)  
	float                                              WeldingThreshold;                                           // 0x0338   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x033C   (0x0004)  MISSED
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride;                               // 0x0340   (0x0050)  
	FAkGeometrySurfaceOverride                         CollisionMeshSurfaceOverride;                               // 0x0390   (0x0018)  
	bool                                               bEnableDiffraction;                                         // 0x03A8:0 (0x0001)  
	bool                                               bEnableDiffractionOnBoundaryEdges;                          // 0x03A8:1 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x03A9   (0x0007)  MISSED
	AActor*                                            AssociatedRoom;                                             // 0x03B0   (0x0008)  
	unsigned char                                      UnknownData03_5[0x10];                                      // 0x03B8   (0x0010)  MISSED
	FAkGeometryData                                    GeometryData;                                               // 0x03C8   (0x0050)  
	TMap<int32_t, float>                               SurfaceAreas;                                               // 0x0418   (0x0050)  
	unsigned char                                      UnknownData04_6[0x58];                                      // 0x0468   (0x0058)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkGeometryComponent.UpdateGeometry
	void UpdateGeometry();                                                                                                   // [0x169cb10] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.SendGeometry
	void SendGeometry();                                                                                                     // [0x169caf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.RemoveGeometry
	void RemoveGeometry();                                                                                                   // [0x169cad0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkGeometryComponent.ConvertMesh
	void ConvertMesh();                                                                                                      // [0x169c4d0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkGroupValue
/// Size: 0x0028 (0x000040 - 0x000068)
class UAkGroupValue : public UAkAudioType
{ 
public:
	TArray<TWeakObjectPtr>                             MediaDependencies;                                          // 0x0040   (0x0010)  
	uint32_t                                           GroupShortID;                                               // 0x0050   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x0054   (0x0014)  MISSED
};

/// Class /Script/AkAudio.AkHololensInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkHololensInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkHololensAdvancedInitializationSettings          AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkHololensInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkHololensPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkHololensPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkInitBankAssetData
/// Size: 0x0010 (0x000070 - 0x000080)
class UAkInitBankAssetData : public UAkAssetDataWithMedia
{ 
public:
	TArray<FAkPluginInfo>                              PluginInfos;                                                // 0x0070   (0x0010)  
};

/// Class /Script/AkAudio.AkInitBank
/// Size: 0x0020 (0x000050 - 0x000070)
class UAkInitBank : public UAkAssetBase
{ 
public:
	TArray<FString>                                    AvailableAudioCultures;                                     // 0x0050   (0x0010)  
	FString                                            DefaultLanguage;                                            // 0x0060   (0x0010)  
};

/// Class /Script/AkAudio.AkIOSInitializationSettings
/// Size: 0x00D8 (0x000028 - 0x000100)
class UAkIOSInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkAudioSession                                    AudioSession;                                               // 0x0098   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x00A8   (0x0028)  
	FAkAdvancedInitializationSettings                  AdvancedSettings;                                           // 0x00D0   (0x002C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00FC   (0x0004)  MISSED
};

/// Class /Script/AkAudio.AkIOSPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkIOSPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkItemBoolPropertiesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkItemBoolPropertiesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkItemBoolProperties
/// Size: 0x0040 (0x000138 - 0x000178)
class UAkItemBoolProperties : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0138   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDragged;                                          // 0x0148   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0158   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkItemBoolProperties.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x16a0b60] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkItemBoolProperties.GetSelectedProperty
	FString GetSelectedProperty();                                                                                           // [0x16a0740] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkItemBoolProperties.GetSearchText
	FString GetSearchText();                                                                                                 // [0x16a06c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkItemPropertiesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkItemPropertiesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkItemProperties
/// Size: 0x0040 (0x000138 - 0x000178)
class UAkItemProperties : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0138   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDragged;                                          // 0x0148   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0158   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkItemProperties.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x16a0b60] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkItemProperties.GetSelectedProperty
	FString GetSelectedProperty();                                                                                           // [0x16a07c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkItemProperties.GetSearchText
	FString GetSearchText();                                                                                                 // [0x16a06c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkLateReverbComponent
/// Size: 0x0080 (0x000320 - 0x0003A0)
class UAkLateReverbComponent : public USceneComponent
{ 
public:
	bool                                               bEnable;                                                    // 0x0318:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0319   (0x0003)  MISSED
	float                                              SendLevel;                                                  // 0x031C   (0x0004)  
	float                                              FadeRate;                                                   // 0x0320   (0x0004)  
	float                                              Priority;                                                   // 0x0324   (0x0004)  
	bool                                               AutoAssignAuxBus;                                           // 0x0328   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0329   (0x0007)  MISSED
	UAkAuxBus*                                         AuxBus;                                                     // 0x0330   (0x0008)  
	FString                                            AuxBusName;                                                 // 0x0338   (0x0010)  
	unsigned char                                      UnknownData02_5[0x8];                                       // 0x0348   (0x0008)  MISSED
	UAkAuxBus*                                         AuxBusManual;                                               // 0x0350   (0x0008)  
	unsigned char                                      UnknownData03_6[0x48];                                      // 0x0358   (0x0048)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkLateReverbComponent.AssociateAkTextureSetComponent
	void AssociateAkTextureSetComponent(UAkAcousticTextureSetComponent* textureSetComponent);                                // [0x16a0380] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkLinuxInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkLinuxInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkLinuxInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkLinuxPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkLinuxPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkMacInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkMacInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkMacInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkMacPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkMacPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkMediaAssetData
/// Size: 0x0038 (0x000028 - 0x000060)
class UAkMediaAssetData : public UObject
{ 
public:
	bool                                               IsStreamed;                                                 // 0x0028   (0x0001)  
	bool                                               UseDeviceMemory;                                            // 0x0029   (0x0001)  
	unsigned char                                      UnknownData00_6[0x36];                                      // 0x002A   (0x0036)  MISSED
};

/// Class /Script/AkAudio.AkMediaAsset
/// Size: 0x0030 (0x000028 - 0x000058)
class UAkMediaAsset : public UObject
{ 
public:
	uint32_t                                           ID;                                                         // 0x0028   (0x0004)  
	bool                                               AutoLoad;                                                   // 0x002C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x002D   (0x0003)  MISSED
	TArray<UObject*>                                   UserData;                                                   // 0x0030   (0x0010)  
	UAkMediaAssetData*                                 CurrentMediaAssetData;                                      // 0x0040   (0x0008)  
	unsigned char                                      UnknownData01_6[0x10];                                      // 0x0048   (0x0010)  MISSED
};

/// Class /Script/AkAudio.AkLocalizedMediaAsset
/// Size: 0x0000 (0x000058 - 0x000058)
class UAkLocalizedMediaAsset : public UAkMediaAsset
{ 
public:
};

/// Class /Script/AkAudio.AkExternalMediaAsset
/// Size: 0x0060 (0x000058 - 0x0000B8)
class UAkExternalMediaAsset : public UAkMediaAsset
{ 
public:
	unsigned char                                      UnknownData00_1[0x60];                                      // 0x0058   (0x0060)  MISSED
};

/// Class /Script/AkAudio.AkPlatformInitialisationSettingsBase
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkPlatformInitialisationSettingsBase : public UInterface
{ 
public:
};

/// Class /Script/AkAudio.AkPS4InitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkPS4InitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0090   (0x0028)  
	FAkPS4AdvancedInitializationSettings               AdvancedSettings;                                           // 0x00B8   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkPS4InitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x16a0870] Final|Native|Public  
};

/// Class /Script/AkAudio.AkPS4PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkPS4PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkReverbVolume
/// Size: 0x0038 (0x000260 - 0x000298)
class AAkReverbVolume : public AVolume
{ 
public:
	bool                                               bEnabled;                                                   // 0x0260:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0261   (0x0007)  MISSED
	UAkAuxBus*                                         AuxBus;                                                     // 0x0268   (0x0008)  
	FString                                            AuxBusName;                                                 // 0x0270   (0x0010)  
	float                                              SendLevel;                                                  // 0x0280   (0x0004)  
	float                                              FadeRate;                                                   // 0x0284   (0x0004)  
	float                                              Priority;                                                   // 0x0288   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	UAkLateReverbComponent*                            LateReverbComponent;                                        // 0x0290   (0x0008)  
};

/// Class /Script/AkAudio.AkRoomComponent
/// Size: 0x0030 (0x000340 - 0x000370)
class UAkRoomComponent : public UAkGameObject
{ 
public:
	bool                                               bEnable;                                                    // 0x0338:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0339   (0x0003)  MISSED
	bool                                               bDynamic;                                                   // 0x033C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x033D   (0x0003)  MISSED
	float                                              Priority;                                                   // 0x0340   (0x0004)  
	float                                              WallOcclusion;                                              // 0x0344   (0x0004)  
	float                                              AuxSendLevel;                                               // 0x0348   (0x0004)  
	bool                                               AutoPost;                                                   // 0x034C   (0x0001)  
	unsigned char                                      UnknownData02_5[0xB];                                       // 0x034D   (0x000B)  MISSED
	UAkAcousticTextureSetComponent*                    GeometryComponent;                                          // 0x0358   (0x0008)  
	unsigned char                                      UnknownData03_6[0x10];                                      // 0x0360   (0x0010)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkRoomComponent.GetPrimitiveParent
	UPrimitiveComponent* GetPrimitiveParent();                                                                               // [0x16a0690] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkRtpc
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkRtpc : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkSettings
/// Size: 0x0290 (0x000028 - 0x0002B8)
class UAkSettings : public UObject
{ 
public:
	char                                               MaxSimultaneousReverbVolumes;                               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0029   (0x0007)  MISSED
	FFilePath                                          WwiseProjectPath;                                           // 0x0030   (0x0010)  
	FDirectoryPath                                     WwiseSoundDataFolder;                                       // 0x0040   (0x0010)  
	bool                                               bAutoConnectToWAAPI;                                        // 0x0050   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     DefaultOcclusionCollisionChannel;                           // 0x0051   (0x0001)  
	TEnumAsByte<ECollisionChannel>                     DefaultFitToGeometryCollisionChannel;                       // 0x0052   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x0053   (0x0005)  MISSED
	TMap<TWeakObjectPtr, FAkGeometrySurfacePropertiesToMap> AkGeometryMap;                                         // 0x0058   (0x0050)  
	float                                              GlobalDecayAbsorption;                                      // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x00AC   (0x0004)  MISSED
	TWeakObjectPtr<UAkAuxBus*>                         DefaultReverbAuxBus;                                        // 0x00B0   (0x0028)  
	TMap<float, TWeakObjectPtr>                        EnvironmentDecayAuxBusMap;                                  // 0x00D8   (0x0050)  
	FString                                            HFDampingName;                                              // 0x0128   (0x0010)  
	FString                                            DecayEstimateName;                                          // 0x0138   (0x0010)  
	FString                                            TimeToFirstReflectionName;                                  // 0x0148   (0x0010)  
	TWeakObjectPtr<UAkRtpc*>                           HFDampingRTPC;                                              // 0x0158   (0x0028)  
	TWeakObjectPtr<UAkRtpc*>                           DecayEstimateRTPC;                                          // 0x0180   (0x0028)  
	TWeakObjectPtr<UAkRtpc*>                           TimeToFirstReflectionRTPC;                                  // 0x01A8   (0x0028)  
	TMap<FGuid, FAkAcousticTextureParams>              AcousticTextureParamsMap;                                   // 0x01D0   (0x0050)  
	bool                                               SplitSwitchContainerMedia;                                  // 0x0220   (0x0001)  
	bool                                               SplitMediaPerFolder;                                        // 0x0221   (0x0001)  
	bool                                               UseEventBasedPackaging;                                     // 0x0222   (0x0001)  
	bool                                               EnableAutomaticAssetSynchronization;                        // 0x0223   (0x0001)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x0224   (0x0004)  MISSED
	FString                                            CommandletCommitMessage;                                    // 0x0228   (0x0010)  
	TMap<FString, FString>                             UnrealCultureToWwiseCulture;                                // 0x0238   (0x0050)  
	bool                                               AskedToUseNewAssetManagement;                               // 0x0288   (0x0001)  
	bool                                               bEnableMultiCoreRendering;                                  // 0x0289   (0x0001)  
	bool                                               MigratedEnableMultiCoreRendering;                           // 0x028A   (0x0001)  
	bool                                               FixupRedirectorsDuringMigration;                            // 0x028B   (0x0001)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	FDirectoryPath                                     WwiseWindowsInstallationPath;                               // 0x0290   (0x0010)  
	FFilePath                                          WwiseMacInstallationPath;                                   // 0x02A0   (0x0010)  
	unsigned char                                      UnknownData05_6[0x8];                                       // 0x02B0   (0x0008)  MISSED
};

/// Class /Script/AkAudio.AkSettingsPerUser
/// Size: 0x0058 (0x000028 - 0x000080)
class UAkSettingsPerUser : public UObject
{ 
public:
	FDirectoryPath                                     WwiseWindowsInstallationPath;                               // 0x0028   (0x0010)  
	FFilePath                                          WwiseMacInstallationPath;                                   // 0x0038   (0x0010)  
	bool                                               EnableAutomaticAssetSynchronization;                        // 0x0048   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0049   (0x0007)  MISSED
	FString                                            WaapiIPAddress;                                             // 0x0050   (0x0010)  
	uint32_t                                           WaapiPort;                                                  // 0x0060   (0x0004)  
	bool                                               bAutoConnectToWAAPI;                                        // 0x0064   (0x0001)  
	bool                                               AutoSyncSelection;                                          // 0x0065   (0x0001)  
	bool                                               SuppressWwiseProjectPathWarnings;                           // 0x0066   (0x0001)  
	bool                                               SoundDataGenerationSkipLanguage;                            // 0x0067   (0x0001)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0068   (0x0018)  MISSED
};

/// Class /Script/AkAudio.AkSlider
/// Size: 0x0488 (0x000138 - 0x0005C0)
class UAkSlider : public UWidget
{ 
public:
	float                                              Value;                                                      // 0x0138   (0x0004)  
	FDelegateProperty                                  ValueDelegate;                                              // 0x013C   (0x0010)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x014C   (0x0004)  MISSED
	FSliderStyle                                       WidgetStyle;                                                // 0x0150   (0x03A0)  
	TEnumAsByte<EOrientation>                          Orientation;                                                // 0x04F0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x04F1   (0x0003)  MISSED
	FLinearColor                                       SliderBarColor;                                             // 0x04F4   (0x0010)  
	FLinearColor                                       SliderHandleColor;                                          // 0x0504   (0x0010)  
	bool                                               IndentHandle;                                               // 0x0514   (0x0001)  
	bool                                               Locked;                                                     // 0x0515   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2];                                       // 0x0516   (0x0002)  MISSED
	float                                              StepSize;                                                   // 0x0518   (0x0004)  
	bool                                               IsFocusable;                                                // 0x051C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x051D   (0x0003)  MISSED
	FAkPropertyToControl                               ThePropertyToControl;                                       // 0x0520   (0x0010)  
	FAkWwiseItemToControl                              ItemToControl;                                              // 0x0530   (0x0040)  
	FMulticastInlineDelegate                           OnValueChanged;                                             // 0x0570   (0x0010)  
	FMulticastInlineDelegate                           OnItemDropped;                                              // 0x0580   (0x0010)  
	FMulticastInlineDelegate                           OnPropertyDropped;                                          // 0x0590   (0x0010)  
	unsigned char                                      UnknownData04_6[0x20];                                      // 0x05A0   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkSlider.SetValue
	void SetValue(float InValue);                                                                                            // [0x16a0da0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetStepSize
	void SetStepSize(float InValue);                                                                                         // [0x16a0d20] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetSliderHandleColor
	void SetSliderHandleColor(FLinearColor InValue);                                                                         // [0x16a0c90] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetSliderBarColor
	void SetSliderBarColor(FLinearColor InValue);                                                                            // [0x16a0c00] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetLocked
	void SetLocked(bool InValue);                                                                                            // [0x16a0ad0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetIndentHandle
	void SetIndentHandle(bool InValue);                                                                                      // [0x16a0a40] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetAkSliderItemProperty
	void SetAkSliderItemProperty(FString ItemProperty);                                                                      // [0x16a09a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.SetAkSliderItemId
	void SetAkSliderItemId(FGuid& ItemID);                                                                                   // [0x16a0900] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.AkSlider.GetValue
	float GetValue();                                                                                                        // [0x16a0840] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkSlider.GetAkSliderItemProperty
	FString GetAkSliderItemProperty();                                                                                       // [0x16a0640] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkSlider.GetAkSliderItemId
	FGuid GetAkSliderItemId();                                                                                               // [0x16a0600] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkSpatialAudioVolume
/// Size: 0x0018 (0x000260 - 0x000278)
class AAkSpatialAudioVolume : public AVolume
{ 
public:
	UAkSurfaceReflectorSetComponent*                   SurfaceReflectorSet;                                        // 0x0260   (0x0008)  
	UAkLateReverbComponent*                            LateReverb;                                                 // 0x0268   (0x0008)  
	UAkRoomComponent*                                  Room;                                                       // 0x0270   (0x0008)  
};

/// Class /Script/AkAudio.AkSpotReflector
/// Size: 0x0028 (0x000228 - 0x000250)
class AAkSpotReflector : public AActor
{ 
public:
	UAkAuxBus*                                         EarlyReflectionAuxBus;                                      // 0x0228   (0x0008)  
	FString                                            EarlyReflectionAuxBusName;                                  // 0x0230   (0x0010)  
	UAkAcousticTexture*                                AcousticTexture;                                            // 0x0240   (0x0008)  
	float                                              DistanceScalingFactor;                                      // 0x0248   (0x0004)  
	float                                              Level;                                                      // 0x024C   (0x0004)  
};

/// Class /Script/AkAudio.AkStateValue
/// Size: 0x0000 (0x000068 - 0x000068)
class UAkStateValue : public UAkGroupValue
{ 
public:
};

/// Class /Script/AkAudio.AkSurfaceReflectorSetComponent
/// Size: 0x0030 (0x000330 - 0x000360)
class UAkSurfaceReflectorSetComponent : public UAkAcousticTextureSetComponent
{ 
public:
	bool                                               bEnableSurfaceReflectors;                                   // 0x0330:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x0331   (0x0007)  MISSED
	TArray<FAkPoly>                                    AcousticPolys;                                              // 0x0338   (0x0010)  
	bool                                               bEnableDiffraction;                                         // 0x0348:0 (0x0001)  
	bool                                               bEnableDiffractionOnBoundaryEdges;                          // 0x0348:1 (0x0001)  
	unsigned char                                      UnknownData01_4[0x7];                                       // 0x0349   (0x0007)  MISSED
	AActor*                                            AssociatedRoom;                                             // 0x0350   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0358   (0x0008)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.UpdateSurfaceReflectorSet
	void UpdateSurfaceReflectorSet();                                                                                        // [0x16a6610] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.SendSurfaceReflectorSet
	void SendSurfaceReflectorSet();                                                                                          // [0x16a55d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkSurfaceReflectorSetComponent.RemoveSurfaceReflectorSet
	void RemoveSurfaceReflectorSet();                                                                                        // [0x16a55b0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/AkAudio.AkSwitchInitializationSettings
/// Size: 0x00C8 (0x000028 - 0x0000F0)
class UAkSwitchInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithCommSelection          CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings;                                      // 0x00C0   (0x0030)  


	/// Functions
	// Function /Script/AkAudio.AkSwitchInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkSwitchPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkSwitchPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkSwitchValue
/// Size: 0x0000 (0x000068 - 0x000068)
class UAkSwitchValue : public UAkGroupValue
{ 
public:
};

/// Class /Script/AkAudio.AkTrigger
/// Size: 0x0000 (0x000040 - 0x000040)
class UAkTrigger : public UAkAudioType
{ 
public:
};

/// Class /Script/AkAudio.AkTVOSInitializationSettings
/// Size: 0x00D8 (0x000028 - 0x000100)
class UAkTVOSInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkAudioSession                                    AudioSession;                                               // 0x0098   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00A4   (0x0004)  MISSED
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x00A8   (0x0028)  
	FAkAdvancedInitializationSettings                  AdvancedSettings;                                           // 0x00D0   (0x002C)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00FC   (0x0004)  MISSED
};

/// Class /Script/AkAudio.AkTVOSPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkTVOSPlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiCalls
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiCalls : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.SAkWaapiFieldNamesConv
/// Size: 0x0000 (0x000028 - 0x000028)
class USAkWaapiFieldNamesConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiJsonManager
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiJsonManager : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWaapiUriConv
/// Size: 0x0000 (0x000028 - 0x000028)
class UAkWaapiUriConv : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Script/AkAudio.AkWindowsInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkWindowsInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettingsWithSampleRate      CommonSettings;                                             // 0x0030   (0x0068)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkWindowsAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0038)  


	/// Functions
	// Function /Script/AkAudio.AkWindowsInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkWin32PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWin32PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWin64PlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWin64PlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWindowsPlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkWindowsPlatformInfo : public UAkWin64PlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.AkWwiseTree
/// Size: 0x0040 (0x000138 - 0x000178)
class UAkWwiseTree : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0138   (0x0010)  
	FMulticastInlineDelegate                           OnItemDragged;                                              // 0x0148   (0x0010)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0158   (0x0020)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkWwiseTree.SetSearchText
	void SetSearchText(FString newText);                                                                                     // [0x16a0b60] Final|BlueprintCosmetic|Native|Public|BlueprintCallable 
	// Function /Script/AkAudio.AkWwiseTree.GetSelectedItem
	FAkWwiseObjectDetails GetSelectedItem();                                                                                 // [0x16a5110] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/AkAudio.AkWwiseTree.GetSearchText
	FString GetSearchText();                                                                                                 // [0x16a06c0] Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/AkAudio.AkWwiseTreeSelector
/// Size: 0x0060 (0x000138 - 0x000198)
class UAkWwiseTreeSelector : public UWidget
{ 
public:
	FMulticastInlineDelegate                           OnSelectionChanged;                                         // 0x0138   (0x0010)  
	FMulticastInlineDelegate                           OnItemDragged;                                              // 0x0148   (0x0010)  
	unsigned char                                      UnknownData00_6[0x40];                                      // 0x0158   (0x0040)  MISSED
};

/// Class /Script/AkAudio.AkXboxOneInitializationSettings
/// Size: 0x00D0 (0x000028 - 0x0000F8)
class UAkXboxOneInitializationSettings : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FAkCommonInitializationSettings                    CommonSettings;                                             // 0x0030   (0x0060)  
	FAkXboxOneApuHeapInitializationSettings            ApuHeapSettings;                                            // 0x0090   (0x0008)  
	FAkCommunicationSettingsWithSystemInitialization   CommunicationSettings;                                      // 0x0098   (0x0028)  
	FAkXboxOneAdvancedInitializationSettings           AdvancedSettings;                                           // 0x00C0   (0x0034)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00F4   (0x0004)  MISSED


	/// Functions
	// Function /Script/AkAudio.AkXboxOneInitializationSettings.MigrateMultiCoreRendering
	void MigrateMultiCoreRendering(bool NewValue);                                                                           // [0x168e9c0] Final|Native|Public  
};

/// Class /Script/AkAudio.AkXboxOnePlatformInfo
/// Size: 0x0000 (0x000070 - 0x000070)
class UAkXboxOnePlatformInfo : public UAkPlatformInfo
{ 
public:
};

/// Class /Script/AkAudio.InterpTrackAkAudioEvent
/// Size: 0x0018 (0x000090 - 0x0000A8)
class UInterpTrackAkAudioEvent : public UInterpTrackVectorBase
{ 
public:
	TArray<FAkAudioEventTrackKey>                      Events;                                                     // 0x0090   (0x0010)  
	bool                                               bContinueEventOnMatineeEnd;                                 // 0x00A0:0 (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Class /Script/AkAudio.InterpTrackAkAudioRTPC
/// Size: 0x0018 (0x000090 - 0x0000A8)
class UInterpTrackAkAudioRTPC : public UInterpTrackFloatBase
{ 
public:
	FString                                            Param;                                                      // 0x0090   (0x0010)  
	bool                                               bPlayOnReverse;                                             // 0x00A0:0 (0x0001)  
	bool                                               bContinueRTPCOnMatineeEnd;                                  // 0x00A0:1 (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Class /Script/AkAudio.InterpTrackInstAkAudioEvent
/// Size: 0x0008 (0x000028 - 0x000030)
class UInterpTrackInstAkAudioEvent : public UInterpTrackInst
{ 
public:
	float                                              LastUpdatePosition;                                         // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Class /Script/AkAudio.InterpTrackInstAkAudioRTPC
/// Size: 0x0008 (0x000028 - 0x000030)
class UInterpTrackInstAkAudioRTPC : public UInterpTrackInst
{ 
public:
	float                                              LastUpdatePosition;                                         // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkAudioEventSection
/// Size: 0x00E8 (0x0000E0 - 0x0001C8)
class UMovieSceneAkAudioEventSection : public UMovieSceneSection
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x00E0   (0x0040)  MISSED
	UAkAudioEvent*                                     Event;                                                      // 0x0120   (0x0008)  
	bool                                               RetriggerEvent;                                             // 0x0128   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0129   (0x0003)  MISSED
	int32_t                                            ScrubTailLengthMs;                                          // 0x012C   (0x0004)  
	bool                                               StopAtSectionEnd;                                           // 0x0130   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0131   (0x0007)  MISSED
	FString                                            EventName;                                                  // 0x0138   (0x0010)  
	unsigned char                                      UnknownData03_5[0x20];                                      // 0x0148   (0x0020)  MISSED
	float                                              MaxSourceDuration;                                          // 0x0168   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x016C   (0x0004)  MISSED
	FString                                            MaxDurationSourceID;                                        // 0x0170   (0x0010)  
	unsigned char                                      UnknownData05_6[0x48];                                      // 0x0180   (0x0048)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkTrack
/// Size: 0x0018 (0x000058 - 0x000070)
class UMovieSceneAkTrack : public UMovieSceneTrack
{ 
public:
	TArray<UMovieSceneSection*>                        Sections;                                                   // 0x0058   (0x0010)  
	bool                                               bIsAMasterTrack;                                            // 0x0068:0 (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/AkAudio.MovieSceneAkAudioEventTrack
/// Size: 0x0000 (0x000070 - 0x000070)
class UMovieSceneAkAudioEventTrack : public UMovieSceneAkTrack
{ 
public:
};

/// Class /Script/AkAudio.MovieSceneAkAudioRTPCSection
/// Size: 0x0168 (0x0000E0 - 0x000248)
class UMovieSceneAkAudioRTPCSection : public UMovieSceneSection
{ 
public:
	UAkRtpc*                                           RTPC;                                                       // 0x00E0   (0x0008)  
	FString                                            Name;                                                       // 0x00E8   (0x0010)  
	FRichCurve                                         FloatCurve;                                                 // 0x00F8   (0x0080)  
	FMovieSceneFloatChannelSerializationHelper         FloatChannelSerializationHelper;                            // 0x0178   (0x0030)  
	FMovieSceneFloatChannel                            RTPCChannel;                                                // 0x01A8   (0x00A0)  
};

/// Class /Script/AkAudio.MovieSceneAkAudioRTPCTrack
/// Size: 0x0000 (0x000070 - 0x000070)
class UMovieSceneAkAudioRTPCTrack : public UMovieSceneAkTrack
{ 
public:
};

/// Class /Script/AkAudio.PostEventAsync
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UPostEventAsync : public UBlueprintAsyncActionBase
{ 
public:
	FMulticastInlineDelegate                           Completed;                                                  // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x60];                                      // 0x0040   (0x0060)  MISSED


	/// Functions
	// Function /Script/AkAudio.PostEventAsync.PostEventAsync
	UPostEventAsync* PostEventAsync(UObject* WorldContextObject, UAkAudioEvent* AkEvent, AActor* Actor, int32_t CallbackMask, FDelegateProperty& PostEventCallback, TArray<FAkExternalSourceInfo>& ExternalSources, bool bStopWhenAttachedToDestroyed); // [0x16a8a30] Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/AkAudio.PostEventAsync.PollPostEventFuture
	void PollPostEventFuture();                                                                                              // [0x16a89f0] Final|Native|Private 
};

/// Class /Script/AkAudio.PostEventAtLocationAsync
/// Size: 0x0050 (0x000030 - 0x000080)
class UPostEventAtLocationAsync : public UBlueprintAsyncActionBase
{ 
public:
	FMulticastInlineDelegate                           Completed;                                                  // 0x0030   (0x0010)  
	unsigned char                                      UnknownData00_6[0x40];                                      // 0x0040   (0x0040)  MISSED


	/// Functions
	// Function /Script/AkAudio.PostEventAtLocationAsync.PostEventAtLocationAsync
	UPostEventAtLocationAsync* PostEventAtLocationAsync(UObject* WorldContextObject, UAkAudioEvent* AkEvent, FVector Location, FRotator Orientation); // [0x16a8cc0] Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable 
	// Function /Script/AkAudio.PostEventAtLocationAsync.PollPostEventFuture
	void PollPostEventFuture();                                                                                              // [0x16a8a10] Final|Native|Private 
};

/// Class /Script/AkAudio.WwiseDataQuery
/// Size: 0x0000 (0x000028 - 0x000028)
class UWwiseDataQuery : public UObject
{ 
public:
};

/// Struct /Script/AkAudio.AKWaapiJsonObject
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAKWaapiJsonObject
{ 
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0000   (0x0010)  MISSED
};

/// Struct /Script/AkAudio.AkWaapiSubscriptionId
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkWaapiSubscriptionId
{ 
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0000   (0x0008)  MISSED
};

/// Struct /Script/AkAudio.AkAdvancedInitializationSettings
/// Size: 0x002C (0x000000 - 0x00002C)
struct FAkAdvancedInitializationSettings
{ 
	uint32_t                                           IO_MemorySize;                                              // 0x0000   (0x0004)  
	uint32_t                                           IO_Granularity;                                             // 0x0004   (0x0004)  
	float                                              TargetAutoStreamBufferLength;                               // 0x0008   (0x0004)  
	bool                                               UseStreamCache;                                             // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	uint32_t                                           MaximumPinnedBytesInCache;                                  // 0x0010   (0x0004)  
	bool                                               EnableGameSyncPreparation;                                  // 0x0014   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0015   (0x0003)  MISSED
	uint32_t                                           ContinuousPlaybackLookAhead;                                // 0x0018   (0x0004)  
	uint32_t                                           MonitorQueuePoolSize;                                       // 0x001C   (0x0004)  
	uint32_t                                           MaximumHardwareTimeoutMs;                                   // 0x0020   (0x0004)  
	bool                                               DebugOutOfRangeCheckEnabled;                                // 0x0024   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0025   (0x0003)  MISSED
	float                                              DebugOutOfRangeLimit;                                       // 0x0028   (0x0004)  
};

/// Struct /Script/AkAudio.AkAdvancedInitializationSettingsWithMultiCoreRendering
/// Size: 0x0004 (0x00002C - 0x000030)
struct FAkAdvancedInitializationSettingsWithMultiCoreRendering : FAkAdvancedInitializationSettings
{ 
	bool                                               EnableMultiCoreRendering;                                   // 0x002C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkAndroidAdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkAndroidAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint32_t                                           AudioAPI;                                                   // 0x0030   (0x0004)  
	bool                                               RoundFrameSizeToHardwareSize;                               // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0035   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkAudioSession
/// Size: 0x000C (0x000000 - 0x00000C)
struct FAkAudioSession
{ 
	EAkAudioSessionCategory                            AudioSessionCategory;                                       // 0x0000   (0x0004)  
	uint32_t                                           AudioSessionCategoryOptions;                                // 0x0004   (0x0004)  
	EAkAudioSessionMode                                AudioSessionMode;                                           // 0x0008   (0x0004)  
};

/// Struct /Script/AkAudio.AkExternalSourceInfo
/// Size: 0x0038 (0x000000 - 0x000038)
struct FAkExternalSourceInfo
{ 
	FString                                            ExternalSrcName;                                            // 0x0000   (0x0010)  
	AkCodecId                                          CodecID;                                                    // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	FString                                            Filename;                                                   // 0x0018   (0x0010)  
	UAkExternalMediaAsset*                             ExternalSourceAsset;                                        // 0x0028   (0x0008)  
	bool                                               IsStreamed;                                                 // 0x0030   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Struct /Script/AkAudio.AkSegmentInfo
/// Size: 0x0024 (0x000000 - 0x000024)
struct FAkSegmentInfo
{ 
	int32_t                                            CurrentPosition;                                            // 0x0000   (0x0004)  
	int32_t                                            PreEntryDuration;                                           // 0x0004   (0x0004)  
	int32_t                                            ActiveDuration;                                             // 0x0008   (0x0004)  
	int32_t                                            PostExitDuration;                                           // 0x000C   (0x0004)  
	int32_t                                            RemainingLookAheadTime;                                     // 0x0010   (0x0004)  
	float                                              BeatDuration;                                               // 0x0014   (0x0004)  
	float                                              BarDuration;                                                // 0x0018   (0x0004)  
	float                                              GridDuration;                                               // 0x001C   (0x0004)  
	float                                              GridOffset;                                                 // 0x0020   (0x0004)  
};

/// Struct /Script/AkAudio.AkMidiEventBase
/// Size: 0x0002 (0x000000 - 0x000002)
struct FAkMidiEventBase
{ 
	EAkMidiEventType                                   Type;                                                       // 0x0000   (0x0001)  
	char                                               Chan;                                                       // 0x0001   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiProgramChange
/// Size: 0x0001 (0x000002 - 0x000003)
struct FAkMidiProgramChange : FAkMidiEventBase
{ 
	char                                               ProgramNum;                                                 // 0x0002   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiChannelAftertouch
/// Size: 0x0001 (0x000002 - 0x000003)
struct FAkMidiChannelAftertouch : FAkMidiEventBase
{ 
	char                                               Value;                                                      // 0x0002   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiNoteAftertouch
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiNoteAftertouch : FAkMidiEventBase
{ 
	char                                               Note;                                                       // 0x0002   (0x0001)  
	char                                               Value;                                                      // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiPitchBend
/// Size: 0x0006 (0x000002 - 0x000008)
struct FAkMidiPitchBend : FAkMidiEventBase
{ 
	char                                               ValueLsb;                                                   // 0x0002   (0x0001)  
	char                                               ValueMsb;                                                   // 0x0003   (0x0001)  
	int32_t                                            FullValue;                                                  // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkMidiCc
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiCc : FAkMidiEventBase
{ 
	EAkMidiCcValues                                    Cc;                                                         // 0x0002   (0x0001)  
	char                                               Value;                                                      // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiNoteOnOff
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiNoteOnOff : FAkMidiEventBase
{ 
	char                                               Note;                                                       // 0x0002   (0x0001)  
	char                                               Velocity;                                                   // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkMidiGeneric
/// Size: 0x0002 (0x000002 - 0x000004)
struct FAkMidiGeneric : FAkMidiEventBase
{ 
	char                                               Param1;                                                     // 0x0002   (0x0001)  
	char                                               Param2;                                                     // 0x0003   (0x0001)  
};

/// Struct /Script/AkAudio.AkOutputSettings
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkOutputSettings
{ 
	FString                                            AudioDeviceSharesetName;                                    // 0x0000   (0x0010)  
	int32_t                                            IdDevice;                                                   // 0x0010   (0x0004)  
	PanningRule                                        PanRule;                                                    // 0x0014   (0x0001)  
	AkChannelConfiguration                             ChannelConfig;                                              // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0016   (0x0002)  MISSED
};

/// Struct /Script/AkAudio.AkChannelMask
/// Size: 0x0004 (0x000000 - 0x000004)
struct FAkChannelMask
{ 
	int32_t                                            ChannelMask;                                                // 0x0000   (0x0004)  
};

/// Struct /Script/AkAudio.AkGeometrySurfaceOverride
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkGeometrySurfaceOverride
{ 
	UAkAcousticTexture*                                AcousticTexture;                                            // 0x0000   (0x0008)  
	bool                                               bEnableOcclusionOverride;                                   // 0x0008:0 (0x0001)  
	unsigned char                                      UnknownData00_4[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              OcclusionValue;                                             // 0x000C   (0x0004)  
	float                                              SurfaceArea;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkGeometryData
/// Size: 0x0050 (0x000000 - 0x000050)
struct FAkGeometryData
{ 
	TArray<FVector>                                    Vertices;                                                   // 0x0000   (0x0010)  
	TArray<FAkAcousticSurface>                         Surfaces;                                                   // 0x0010   (0x0010)  
	TArray<FAkTriangle>                                Triangles;                                                  // 0x0020   (0x0010)  
	TArray<UPhysicalMaterial*>                         ToOverrideAcousticTexture;                                  // 0x0030   (0x0010)  
	TArray<UPhysicalMaterial*>                         ToOverrideOcclusion;                                        // 0x0040   (0x0010)  
};

/// Struct /Script/AkAudio.AkTriangle
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkTriangle
{ 
	uint16_t                                           Point0;                                                     // 0x0000   (0x0002)  
	uint16_t                                           Point1;                                                     // 0x0002   (0x0002)  
	uint16_t                                           Point2;                                                     // 0x0004   (0x0002)  
	uint16_t                                           Surface;                                                    // 0x0006   (0x0002)  
};

/// Struct /Script/AkAudio.AkAcousticSurface
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkAcousticSurface
{ 
	uint32_t                                           Texture;                                                    // 0x0000   (0x0004)  
	float                                              Occlusion;                                                  // 0x0004   (0x0004)  
	FString                                            Name;                                                       // 0x0008   (0x0010)  
};

/// Struct /Script/AkAudio.AkHololensAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkHololensAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHeadMountedDisplayAudioDevice;                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0031   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkPluginInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkPluginInfo
{ 
	FString                                            Name;                                                       // 0x0000   (0x0010)  
	uint32_t                                           PluginID;                                                   // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0014   (0x0004)  MISSED
	FString                                            dll;                                                        // 0x0018   (0x0010)  
};

/// Struct /Script/AkAudio.AkCommonInitializationSettings
/// Size: 0x0060 (0x000000 - 0x000060)
struct FAkCommonInitializationSettings
{ 
	uint32_t                                           MaximumNumberOfMemoryPools;                                 // 0x0000   (0x0004)  
	uint32_t                                           MaximumNumberOfPositioningPaths;                            // 0x0004   (0x0004)  
	uint32_t                                           CommandQueueSize;                                           // 0x0008   (0x0004)  
	uint32_t                                           SamplesPerFrame;                                            // 0x000C   (0x0004)  
	FAkMainOutputSettings                              MainOutputSettings;                                         // 0x0010   (0x0028)  
	float                                              StreamingLookAheadRatio;                                    // 0x0038   (0x0004)  
	uint16_t                                           NumberOfRefillsInVoice;                                     // 0x003C   (0x0002)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x003E   (0x0002)  MISSED
	FAkSpatialAudioSettings                            SpatialAudioSettings;                                       // 0x0040   (0x0020)  
};

/// Struct /Script/AkAudio.AkSpatialAudioSettings
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkSpatialAudioSettings
{ 
	uint32_t                                           MaxSoundPropagationDepth;                                   // 0x0000   (0x0004)  
	float                                              MovementThreshold;                                          // 0x0004   (0x0004)  
	uint32_t                                           NumberOfPrimaryRays;                                        // 0x0008   (0x0004)  
	uint32_t                                           ReflectionOrder;                                            // 0x000C   (0x0004)  
	float                                              MaximumPathLength;                                          // 0x0010   (0x0004)  
	float                                              CPULimitPercentage;                                         // 0x0014   (0x0004)  
	bool                                               EnableDiffractionOnReflections;                             // 0x0018   (0x0001)  
	bool                                               EnableGeometricDiffractionAndTransmission;                  // 0x0019   (0x0001)  
	bool                                               CalcEmitterVirtualPosition;                                 // 0x001A   (0x0001)  
	bool                                               UseObstruction;                                             // 0x001B   (0x0001)  
	bool                                               UseOcclusion;                                               // 0x001C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x001D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkMainOutputSettings
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkMainOutputSettings
{ 
	FString                                            AudioDeviceShareset;                                        // 0x0000   (0x0010)  
	uint32_t                                           DeviceID;                                                   // 0x0010   (0x0004)  
	EAkPanningRule                                     PanningRule;                                                // 0x0014   (0x0004)  
	EAkChannelConfigType                               ChannelConfigType;                                          // 0x0018   (0x0004)  
	uint32_t                                           ChannelMask;                                                // 0x001C   (0x0004)  
	uint32_t                                           NumberOfChannels;                                           // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommonInitializationSettingsWithSampleRate
/// Size: 0x0008 (0x000060 - 0x000068)
struct FAkCommonInitializationSettingsWithSampleRate : FAkCommonInitializationSettings
{ 
	uint32_t                                           SampleRate;                                                 // 0x0060   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0064   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommunicationSettings
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkCommunicationSettings
{ 
	uint32_t                                           PoolSize;                                                   // 0x0000   (0x0004)  
	uint16_t                                           DiscoveryBroadcastPort;                                     // 0x0004   (0x0002)  
	uint16_t                                           CommandPort;                                                // 0x0006   (0x0002)  
	uint16_t                                           NotificationPort;                                           // 0x0008   (0x0002)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x000A   (0x0006)  MISSED
	FString                                            NetworkName;                                                // 0x0010   (0x0010)  
};

/// Struct /Script/AkAudio.AkCommunicationSettingsWithCommSelection
/// Size: 0x0008 (0x000020 - 0x000028)
struct FAkCommunicationSettingsWithCommSelection : FAkCommunicationSettings
{ 
	EAkCommSystem                                      CommunicationSystem;                                        // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkCommunicationSettingsWithSystemInitialization
/// Size: 0x0008 (0x000020 - 0x000028)
struct FAkCommunicationSettingsWithSystemInitialization : FAkCommunicationSettings
{ 
	bool                                               InitializeSystemComms;                                      // 0x0020   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Struct /Script/AkAudio.AkBoolPropertyToControl
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkBoolPropertyToControl
{ 
	FString                                            ItemProperty;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkPropertyToControl
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkPropertyToControl
{ 
	FString                                            ItemProperty;                                               // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkPS4AdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkPS4AdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint32_t                                           ACPBatchBufferSize;                                         // 0x0030   (0x0004)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0034   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0035   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.AkReverbDescriptor
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkReverbDescriptor
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/AkAudio.AkAcousticTextureParams
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkAcousticTextureParams
{ 
	FVector4                                           AbsorptionValues;                                           // 0x0000   (0x0010)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0010   (0x0010)  MISSED
};

/// Struct /Script/AkAudio.AkGeometrySurfacePropertiesToMap
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAkGeometrySurfacePropertiesToMap
{ 
	TWeakObjectPtr<UAkAcousticTexture*>                AcousticTexture;                                            // 0x0000   (0x0028)  
	float                                              OcclusionValue;                                             // 0x0028   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x002C   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkWwiseItemToControl
/// Size: 0x0040 (0x000000 - 0x000040)
struct FAkWwiseItemToControl
{ 
	FAkWwiseObjectDetails                              ItemPicked;                                                 // 0x0000   (0x0030)  
	FString                                            ItemPath;                                                   // 0x0030   (0x0010)  
};

/// Struct /Script/AkAudio.AkWwiseObjectDetails
/// Size: 0x0030 (0x000000 - 0x000030)
struct FAkWwiseObjectDetails
{ 
	FString                                            ItemName;                                                   // 0x0000   (0x0010)  
	FString                                            ItemPath;                                                   // 0x0010   (0x0010)  
	FString                                            ItemID;                                                     // 0x0020   (0x0010)  
};

/// Struct /Script/AkAudio.AkSurfaceProperties
/// Size: 0x0040 (0x000000 - 0x000040)
struct FAkSurfaceProperties
{ 
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x0000   (0x0040)  MISSED
};

/// Struct /Script/AkAudio.AkEdgeInfo
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAkEdgeInfo
{ 
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0000   (0x0028)  MISSED
};

/// Struct /Script/AkAudio.AkPoly
/// Size: 0x0018 (0x000000 - 0x000018)
struct FAkPoly
{ 
	UAkAcousticTexture*                                Texture;                                                    // 0x0000   (0x0008)  
	float                                              Occlusion;                                                  // 0x0008   (0x0004)  
	bool                                               EnableSurface;                                              // 0x000C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x000D   (0x0003)  MISSED
	float                                              SurfaceArea;                                                // 0x0010   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x0014   (0x0004)  MISSED
};

/// Struct /Script/AkAudio.AkWaapiFieldNames
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkWaapiFieldNames
{ 
	FString                                            FieldName;                                                  // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkWaapiUri
/// Size: 0x0010 (0x000000 - 0x000010)
struct FAkWaapiUri
{ 
	FString                                            Uri;                                                        // 0x0000   (0x0010)  
};

/// Struct /Script/AkAudio.AkWindowsAdvancedInitializationSettings
/// Size: 0x0008 (0x000030 - 0x000038)
struct FAkWindowsAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	bool                                               UseHeadMountedDisplayAudioDevice;                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0031   (0x0003)  MISSED
	uint32_t                                           MaxSystemAudioObjects;                                      // 0x0034   (0x0004)  
};

/// Struct /Script/AkAudio.AkXboxOneApuHeapInitializationSettings
/// Size: 0x0008 (0x000000 - 0x000008)
struct FAkXboxOneApuHeapInitializationSettings
{ 
	uint32_t                                           CachedSize;                                                 // 0x0000   (0x0004)  
	uint32_t                                           NonCachedSize;                                              // 0x0004   (0x0004)  
};

/// Struct /Script/AkAudio.AkXboxOneAdvancedInitializationSettings
/// Size: 0x0004 (0x000030 - 0x000034)
struct FAkXboxOneAdvancedInitializationSettings : FAkAdvancedInitializationSettingsWithMultiCoreRendering
{ 
	uint16_t                                           MaximumNumberOfXMAVoices;                                   // 0x0030   (0x0002)  
	bool                                               UseHardwareCodecLowLatencyMode;                             // 0x0032   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0033   (0x0001)  MISSED
};

/// Struct /Script/AkAudio.AkAudioEventTrackKey
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAkAudioEventTrackKey
{ 
	float                                              Time;                                                       // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0004   (0x0004)  MISSED
	UAkAudioEvent*                                     AkAudioEvent;                                               // 0x0008   (0x0008)  
	FString                                            EventName;                                                  // 0x0010   (0x0010)  
};

/// Struct /Script/AkAudio.MovieSceneAkAudioEventTemplate
/// Size: 0x0008 (0x000020 - 0x000028)
struct FMovieSceneAkAudioEventTemplate : FMovieSceneEvalTemplate
{ 
	UMovieSceneAkAudioEventSection*                    Section;                                                    // 0x0020   (0x0008)  
};

/// Struct /Script/AkAudio.MovieSceneAkAudioRTPCTemplate
/// Size: 0x0008 (0x000020 - 0x000028)
struct FMovieSceneAkAudioRTPCTemplate : FMovieSceneEvalTemplate
{ 
	UMovieSceneAkAudioRTPCSection*                     Section;                                                    // 0x0020   (0x0008)  
};

/// Struct /Script/AkAudio.MovieSceneFloatChannelSerializationHelper
/// Size: 0x0030 (0x000000 - 0x000030)
struct FMovieSceneFloatChannelSerializationHelper
{ 
	TEnumAsByte<ERichCurveExtrapolation>               PreInfinityExtrap;                                          // 0x0000   (0x0001)  
	TEnumAsByte<ERichCurveExtrapolation>               PostInfinityExtrap;                                         // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<int32_t>                                    Times;                                                      // 0x0008   (0x0010)  
	TArray<FMovieSceneFloatValueSerializationHelper>   Values;                                                     // 0x0018   (0x0010)  
	float                                              DefaultValue;                                               // 0x0028   (0x0004)  
	bool                                               bHasDefaultValue;                                           // 0x002C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x002D   (0x0003)  MISSED
};

/// Struct /Script/AkAudio.MovieSceneFloatValueSerializationHelper
/// Size: 0x001C (0x000000 - 0x00001C)
struct FMovieSceneFloatValueSerializationHelper
{ 
	float                                              Value;                                                      // 0x0000   (0x0004)  
	TEnumAsByte<ERichCurveInterpMode>                  InterpMode;                                                 // 0x0004   (0x0001)  
	TEnumAsByte<ERichCurveTangentMode>                 TangentMode;                                                // 0x0005   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0006   (0x0002)  MISSED
	FMovieSceneTangentDataSerializationHelper          Tangent;                                                    // 0x0008   (0x0014)  
};

/// Struct /Script/AkAudio.MovieSceneTangentDataSerializationHelper
/// Size: 0x0014 (0x000000 - 0x000014)
struct FMovieSceneTangentDataSerializationHelper
{ 
	float                                              ArriveTangent;                                              // 0x0000   (0x0004)  
	float                                              LeaveTangent;                                               // 0x0004   (0x0004)  
	TEnumAsByte<ERichCurveTangentWeightMode>           TangentWeightMode;                                          // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              ArriveTangentWeight;                                        // 0x000C   (0x0004)  
	float                                              LeaveTangentWeight;                                         // 0x0010   (0x0004)  
};

/// Struct /Script/AkAudio.WwiseDataRow
/// Size: 0x0048 (0x000008 - 0x000050)
struct FWwiseDataRow : FTableRowBase
{ 
	FString                                            SoundbankName;                                              // 0x0008   (0x0010)  
	TWeakObjectPtr<UAkAudioEvent*>                     RealAkEvent;                                                // 0x0018   (0x0028)  
	FGuid                                              EventGuid;                                                  // 0x0040   (0x0010)  
};

/// Enum /Script/AkAudio.EAkCallbackType
/// Size: 0x14
enum EAkCallbackType : uint8_t
{
	EAkCallbackType__EndOfEvent                                                      = 0,
	EAkCallbackType__Marker                                                          = 2,
	EAkCallbackType__Duration                                                        = 3,
	EAkCallbackType__Starvation                                                      = 5,
	EAkCallbackType__MusicPlayStarted                                                = 7,
	EAkCallbackType__MusicSyncBeat                                                   = 8,
	EAkCallbackType__MusicSyncBar                                                    = 9,
	EAkCallbackType__MusicSyncEntry                                                  = 10,
