// WidgetBlueprintGeneratedClass Crosshair_Anti-vehicle_Weapon01.Crosshair_Anti-vehicle_Weapon01_C
// Size: 0x348 (Inherited: 0x300)
struct UCrosshair_Anti-vehicle_Weapon01_C : UCrossHairWidget {
	struct UImage* ForbidImg; // 0x300(0x08)
	struct UImage* Image_243; // 0x308(0x08)
	struct UImage* OverloadImg2; // 0x310(0x08)
	struct UWidgetTween_C* OverloadNormalPanel_Tween; // 0x318(0x08)
	struct UImage* OverloadProgressBar_BG_2; // 0x320(0x08)
	struct UImage* OverloadProgressBar_BG_3; // 0x328(0x08)
	struct UProgressBar* OverloadProgressBarNormal; // 0x330(0x08)
	struct UProgressBar* OverloadProgressBarWarn; // 0x338(0x08)
	struct UImage* SpreadImg_coredot; // 0x340(0x08)
};

