// Class Slate.ButtonWidgetStyle
// Size: 0x2e8 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x2b8)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x640 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x610)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x480 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x450)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x448 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x418)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x900 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0x8d0)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x288 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x258)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x200 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x1d0)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x590 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x560)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x298 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x268)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x368 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x338)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x2d8 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x2a8)
};

// Class Slate.ToolMenuBase
// Size: 0x28 (Inherited: 0x28)
struct UToolMenuBase : UObject {
};

