// Class Solarland.3DMeshWidget
// Size: 0x238 (Inherited: 0x228)
struct A3DMeshWidget : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x230(0x08)
};

// Class Solarland.3DMeshWidgetTrack
// Size: 0x2d8 (Inherited: 0x238)
struct A3DMeshWidgetTrack : A3DMeshWidget {
	char pad_238[0x8]; // 0x238(0x08)
	struct FVector BoxHalfExtent; // 0x240(0x0c)
	float PlayerNearbyAlpha; // 0x24c(0x04)
	bool bDebugCollision; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName MaterialAlphaParamName; // 0x254(0x08)
	struct FName MaterialCountDownName; // 0x25c(0x08)
	float MaxTraceDist; // 0x264(0x04)
	float DistFromGround; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UStaticMeshComponent* StaticMeshCountDown; // 0x270(0x08)
	struct UTextRenderComponent* DistTextComp; // 0x278(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialIcon; // 0x280(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialCountDown; // 0x288(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialDistText; // 0x290(0x08)
	char pad_298[0x40]; // 0x298(0x40)
};

// Class Solarland.AbilityTask_WaitAbilityEnd
// Size: 0x148 (Inherited: 0x80)
struct UAbilityTask_WaitAbilityEnd : UAbilityTask {
	struct FMulticastInlineDelegate OnEnd; // 0x80(0x10)
	char pad_90[0xb8]; // 0x90(0xb8)

	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements TagRequirements, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEndWithTagRequirements // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff2a70
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(struct UGameplayAbility* OwningAbility, struct FGameplayTagQuery Query, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd_Query // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff2c80
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(struct UGameplayAbility* OwningAbility, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff28d0
	void OnAbilityEnd(struct FAbilityEndedData& EndedData); // Function Solarland.AbilityTask_WaitAbilityEnd.OnAbilityEnd // (Final|Native|Protected|HasOutParms) // @ game+0x1ff2350
};

// Class Solarland.SolarAbilityTask
// Size: 0x80 (Inherited: 0x80)
struct USolarAbilityTask : UAbilityTask {
};

// Class Solarland.AbilityTask_WaitAttributeChangeWithOldValue
// Size: 0xf8 (Inherited: 0x80)
struct UAbilityTask_WaitAttributeChangeWithOldValue : USolarAbilityTask {
	struct FMulticastInlineDelegate OnChange; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	struct UAbilitySystemComponent* ExternalOwner; // 0xf0(0x08)

	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChangeWithComparison(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, enum class EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChangeWithComparison // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff3130
	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChange(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChange // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff2e50
};

// Class Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent
// Size: 0xc0 (Inherited: 0x80)
struct UAbilityTask_WaitDelayAndResetOnGameplayEvent : USolarAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	struct FDelegate OnRecalculateWaitDelayOnEventTriggered; // 0x90(0x10)
	char pad_A0[0x20]; // 0xa0(0x20)

	struct UAbilityTask_WaitDelayAndResetOnGameplayEvent* CreateTask(struct UGameplayAbility* OwningAbility, float DelayTime, struct FGameplayTag& EventTag); // Function Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ff1950
};

// Class Solarland.AbilityTask_WaitEvaluation
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitEvaluation : USolarAbilityTask {
	struct FMulticastInlineDelegate OnGotDesiredValue; // 0x80(0x10)
	struct FDelegate EvaluationFunction; // 0x90(0x10)
	char pad_A0[0x8]; // 0xa0(0x08)

	struct UAbilityTask_WaitEvaluation* CreateTask(struct UGameplayAbility* OwningAbility, bool bDesiredValue, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitEvaluation.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff1a60
};

// Class Solarland.AbilityTask_WaitInputAction
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitInputAction : USolarAbilityTask {
	struct FMulticastInlineDelegate OnInputAction; // 0x80(0x10)
	char pad_90[0x18]; // 0x90(0x18)

	struct UAbilityTask_WaitInputAction* CreateTask(struct UGameplayAbility* OwningAbility, struct FName ActionName, enum class EInputEvent InputEvent, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitInputAction.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1ff1b80
};

// Class Solarland.AbilityTask_WaitTagRequirementsMetStatusChange
// Size: 0xf0 (Inherited: 0x80)
struct UAbilityTask_WaitTagRequirementsMetStatusChange : USolarAbilityTask {
	struct FMulticastInlineDelegate OnMetStatusChange; // 0x80(0x10)
	struct FGameplayTagRequirements TagRequirements; // 0x90(0x50)
	char pad_E0[0x10]; // 0xe0(0x10)

	struct UAbilityTask_WaitTagRequirementsMetStatusChange* CreateTask(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements& TagRequirements, bool bMetInitially); // Function Solarland.AbilityTask_WaitTagRequirementsMetStatusChange.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ff1cd0
};

// Class Solarland.ActionNode
// Size: 0x70 (Inherited: 0x28)
struct UActionNode : UObject {
	struct FMulticastInlineDelegate OnBeganCallback; // 0x28(0x10)
	struct FMulticastInlineDelegate OnEndedCallback; // 0x38(0x10)
	struct FMulticastInlineDelegate OnResetCallback; // 0x48(0x10)
	struct FMulticastInlineDelegate OnDisposedCallback; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)

	void Reset(); // Function Solarland.ActionNode.Reset // (Final|Native|Public) // @ game+0x1ff26b0
	bool Finished(); // Function Solarland.ActionNode.Finished // (Final|Native|Public|Const) // @ game+0x1ff1fe0
	void Finish(); // Function Solarland.ActionNode.Finish // (Native|Public) // @ game+0x1ff1f20
	bool Execute(float DeltaTime); // Function Solarland.ActionNode.Execute // (Final|Native|Public) // @ game+0x1ff1e90
	bool Disposed(); // Function Solarland.ActionNode.Disposed // (Final|Native|Public|Const) // @ game+0x1ff1e70
	void Dispose(); // Function Solarland.ActionNode.Dispose // (Final|Native|Public) // @ game+0x1ff1e50
};

// Class Solarland.ActionWheelWidgetFunctionBase
// Size: 0x38 (Inherited: 0x28)
struct UActionWheelWidgetFunctionBase : UObject {
	struct TWeakObjectPtr<struct USolarUserWidget> BindedWidget; // 0x28(0x08)
	int32_t LastSelectedIndex; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	int32_t GetSuggestActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetSuggestActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	int32_t GetQuickActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetQuickActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	int32_t GetAutoSelectedActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetAutoSelectedActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	bool ExecUseCustomItemCommand(int32_t InItemID); // Function Solarland.ActionWheelWidgetFunctionBase.ExecUseCustomItemCommand // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	bool CheckCommandCanExec(struct ASCMPlayerState* InPlayerState, int32_t InIndex, struct FActionWheelCommand InCommand); // Function Solarland.ActionWheelWidgetFunctionBase.CheckCommandCanExec // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.SolarUserWidget
// Size: 0x348 (Inherited: 0x260)
struct USolarUserWidget : UUserWidget {
	enum class EWidgetLayerLevel WidgetLayerLevel; // 0x260(0x01)
	bool bIsPersistent; // 0x261(0x01)
	enum class EWidgetScope WidgetScope; // 0x262(0x01)
	enum class EInputCapture CaptureInput; // 0x263(0x01)
	bool bHideCursorDuringCapture; // 0x264(0x01)
	char pad_265[0x3]; // 0x265(0x03)
	int32_t MyRoot; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct FString widgetkey; // 0x270(0x10)
	bool bReceiveKeyMap; // 0x280(0x01)
	bool bReceiveShowMouse; // 0x281(0x01)
	enum class EScope ShowScope; // 0x282(0x01)
	bool bShowTransBlackAnim; // 0x283(0x01)
	char pad_284[0x4]; // 0x284(0x04)
	struct UWidgetInputManager* InputManagerClass; // 0x288(0x08)
	struct UWidgetInputManager* InputManager; // 0x290(0x08)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x298(0x50)
	struct TWeakObjectPtr<struct UWidgetAnimation> PlayingAnimation; // 0x2e8(0x08)
	char pad_2F0[0x18]; // 0x2f0(0x18)
	struct TArray<struct FPlayAnimationParams> PendingPlayAnimations; // 0x308(0x10)
	bool WidgetTickEnabled; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct USolarInputActionContext* InputActionContext; // 0x320(0x08)
	char pad_328[0x10]; // 0x328(0x10)
	struct TArray<struct USolarUserWidget*> AllSolarUserWidgetChilds; // 0x338(0x10)

	void StopListeningForInputHandle(int32_t Handle); // Function Solarland.SolarUserWidget.StopListeningForInputHandle // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c6f80
	void StopListeningForInputActionEx(struct FName ActionName, enum class EInputEvent EventType); // Function Solarland.SolarUserWidget.StopListeningForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c6eb0
	void ShowSelfPanelUI(); // Function Solarland.SolarUserWidget.ShowSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x22c6e90
	void ShowMouseCursor(); // Function Solarland.SolarUserWidget.ShowMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c6e70
	void SetZOrder(int32_t ZOrder); // Function Solarland.SolarUserWidget.SetZOrder // (Final|Native|Public) // @ game+0x22c6de0
	void SetWidgetVisible(struct UWidget* Widget, bool bVisible, bool bHitTest); // Function Solarland.SolarUserWidget.SetWidgetVisible // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x22c6cd0
	void SetWidgetTickEnabled(bool bEnabled); // Function Solarland.SolarUserWidget.SetWidgetTickEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x22c6c40
	void SetWidgetKey(struct FString InWidgetKey); // Function Solarland.SolarUserWidget.SetWidgetKey // (Final|Native|Public) // @ game+0x22c6ba0
	void SetInputActionIsEnabled(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled); // Function Solarland.SolarUserWidget.SetInputActionIsEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c6a80
	void SetBlockInputForOneTick(); // Function Solarland.SolarUserWidget.SetBlockInputForOneTick // (Final|Native|Public) // @ game+0x22c6a60
	void ReceiveTick(struct FGeometry& MyGeometry, float InDeltaTime); // Function Solarland.SolarUserWidget.ReceiveTick // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void ReceiveShow(); // Function Solarland.SolarUserWidget.ReceiveShow // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void ReceiveHide(); // Function Solarland.SolarUserWidget.ReceiveHide // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	bool PlayAnimationByName(struct FName& AnimationName, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed); // Function Solarland.SolarUserWidget.PlayAnimationByName // (Final|Native|Public|HasOutParms) // @ game+0x22c66a0
	void PlayAnimationByExclusively(struct UWidgetAnimation* InAnimation, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // Function Solarland.SolarUserWidget.PlayAnimationByExclusively // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x22c64d0
	void OnTouchManagerInitialized(); // Function Solarland.SolarUserWidget.OnTouchManagerInitialized // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnSynchronizeProperties(); // Function Solarland.SolarUserWidget.OnSynchronizeProperties // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnSolarUIOpened(); // Function Solarland.SolarUserWidget.OnSolarUIOpened // (Native|Event|Protected|BlueprintEvent) // @ game+0x825030
	void OnSolarUIClosed(); // Function Solarland.SolarUserWidget.OnSolarUIClosed // (Native|Event|Protected|BlueprintEvent) // @ game+0x1564bc0
	void OnShow(); // Function Solarland.SolarUserWidget.OnShow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1564860
	void OnHide(); // Function Solarland.SolarUserWidget.OnHide // (Native|Event|Protected|BlueprintEvent) // @ game+0x1564880
	void OnExclusivelyAnimationFinished(); // Function Solarland.SolarUserWidget.OnExclusivelyAnimationFinished // (Final|Native|Protected) // @ game+0x22c6450
	void OnDeinitialize(); // Function Solarland.SolarUserWidget.OnDeinitialize // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnBackKey(enum class EWidgetBackKeyType BackKeyType); // Function Solarland.SolarUserWidget.OnBackKey // (Native|Event|Protected|BlueprintEvent) // @ game+0x22c5fc0
	int32_t ListenForInputActionEx(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled, struct FDelegate Callback); // Function Solarland.SolarUserWidget.ListenForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c5e20
	bool IsWidgetTickEnabled(); // Function Solarland.SolarUserWidget.IsWidgetTickEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2207080
	bool IsSolarUserWidgetAndBindLua(struct UWidget* InWidget); // Function Solarland.SolarUserWidget.IsSolarUserWidgetAndBindLua // (Final|Native|Static|Public) // @ game+0x22c5d90
	bool IsPlatformDesktop(); // Function Solarland.SolarUserWidget.IsPlatformDesktop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22c5d60
	void HideMouseCursor(); // Function Solarland.SolarUserWidget.HideMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x22c5bb0
	struct FString GetWidgetKeyByPanelName(enum class EUIPanelName PanelName); // Function Solarland.SolarUserWidget.GetWidgetKeyByPanelName // (Final|Native|Static|Public) // @ game+0x22c5ae0
	struct FString GetWidgetKey(); // Function Solarland.SolarUserWidget.GetWidgetKey // (Final|Native|Public|Const) // @ game+0x22c5a60
	struct TArray<struct FVector2D> GetTouchedLocation(); // Function Solarland.SolarUserWidget.GetTouchedLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x22c59e0
	enum class EScope GetShowScope(); // Function Solarland.SolarUserWidget.GetShowScope // (Final|Native|Public|Const) // @ game+0x22c59b0
	struct TArray<struct FVector2D> GetPointerLocation(); // Function Solarland.SolarUserWidget.GetPointerLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x22c5900
	struct ASolarPlayerState* GetOwningSolarPlayerState(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22c58d0
	struct ASolarCharacter* GetOwningSolarPlayerCharacter(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x22c58a0
	struct UWidgetAnimation* GetAnimationByName(struct FName& AnimationName); // Function Solarland.SolarUserWidget.GetAnimationByName // (Final|Native|Public|HasOutParms|Const) // @ game+0x22c5730
	struct TArray<struct USolarUserWidget*> GetAllSolarUserWidgetChilds(); // Function Solarland.SolarUserWidget.GetAllSolarUserWidgetChilds // (Final|Native|Public) // @ game+0x22c56b0
	struct UWidget* FindWidgetFromName(struct FName& Name); // Function Solarland.SolarUserWidget.FindWidgetFromName // (Final|Native|Public|HasOutParms|Const) // @ game+0x22c5610
	void ExecuteSolarUIShow(); // Function Solarland.SolarUserWidget.ExecuteSolarUIShow // (Final|Native|Public) // @ game+0x22c55f0
	void ExecuteSolarUIOpened(); // Function Solarland.SolarUserWidget.ExecuteSolarUIOpened // (Final|Native|Public) // @ game+0x22c55d0
	void ExecuteSolarUIHide(); // Function Solarland.SolarUserWidget.ExecuteSolarUIHide // (Final|Native|Public) // @ game+0x22c55b0
	void ExecuteSolarUIClosed(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClosed // (Final|Native|Public) // @ game+0x22c5590
	void ExecuteSolarUIClean(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClean // (Final|Native|Public) // @ game+0x22c5570
	void ExecuteBindCustomControl(); // Function Solarland.SolarUserWidget.ExecuteBindCustomControl // (Final|Native|Public) // @ game+0x22c5550
	void CloseSelfPanelUI(); // Function Solarland.SolarUserWidget.CloseSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x22c5530
	struct TArray<struct USolarUserWidget*> CacheAllSolarUserWidgetChilds(); // Function Solarland.SolarUserWidget.CacheAllSolarUserWidgetChilds // (Final|Native|Public) // @ game+0x22c54b0
};

// Class Solarland.ActionWheelWidget
// Size: 0x528 (Inherited: 0x348)
struct UActionWheelWidget : USolarUserWidget {
	char pad_348[0x10]; // 0x348(0x10)
	struct UOverlay* Overlay_Point; // 0x358(0x08)
	char pad_360[0x58]; // 0x360(0x58)
	int32_t SelectedIndex; // 0x3b8(0x04)
	int32_t WheelActionItemCount; // 0x3bc(0x04)
	int32_t WheelActionItemCountMax; // 0x3c0(0x04)
	float OperationAreaRadius; // 0x3c4(0x04)
	float CancelAreaRadius; // 0x3c8(0x04)
	float PointMoveSensitivity; // 0x3cc(0x04)
	float ManualSwitchThreshold_PC; // 0x3d0(0x04)
	float ManualSwitchThreshold_GamePad; // 0x3d4(0x04)
	float ManualSwitchThreshold_Mobile; // 0x3d8(0x04)
	int32_t groupid; // 0x3dc(0x04)
	int32_t PageCount; // 0x3e0(0x04)
	int32_t CurrentPage; // 0x3e4(0x04)
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct FActionWheelConfig WheelConfigs; // 0x3f0(0xd8)
	struct TMap<int32_t, struct UActionWheelWidgetFunctionBase*> ActionWheelWidgetFunctionObjs; // 0x4c8(0x50)
	struct UDataTable* ActionWheelConfigDataTable; // 0x518(0x08)
	bool ActionWheelIsOpened; // 0x520(0x01)
	char pad_521[0x3]; // 0x521(0x03)
	float ValidEmojiUseDistance; // 0x524(0x04)

	void UpdateWheelArrowAngle(float Degree); // Function Solarland.ActionWheelWidget.UpdateWheelArrowAngle // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void SetInputActionGroupEnable(bool InEnable); // Function Solarland.ActionWheelWidget.SetInputActionGroupEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff26d0
	void SelecteActionWheelItem(int32_t page, int32_t Index); // Function Solarland.ActionWheelWidget.SelecteActionWheelItem // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveActionWheelTouchMoved(struct FVector2D& TouchLocalPos); // Function Solarland.ActionWheelWidget.ReceiveActionWheelTouchMoved // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1ff2620
	void OnConsumeItemUpdated(); // Function Solarland.ActionWheelWidget.OnConsumeItemUpdated // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnCommandExec(int32_t InGroupID, int32_t InSelectedIndex); // Function Solarland.ActionWheelWidget.OnCommandExec // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnBindedInputActionReleased(int32_t InGroupID); // Function Solarland.ActionWheelWidget.OnBindedInputActionReleased // (Native|Event|Public|BlueprintEvent) // @ game+0x1ff2590
	void OnBindedInputActionPressed(int32_t InGroupID); // Function Solarland.ActionWheelWidget.OnBindedInputActionPressed // (Native|Event|Public|BlueprintEvent) // @ game+0x1ff2500
	void OnBattleHUDVisibilityChanged(bool Visible); // Function Solarland.ActionWheelWidget.OnBattleHUDVisibilityChanged // (Final|Native|Public) // @ game+0x1ff2470
	void OnActionWheelPreviousPage(); // Function Solarland.ActionWheelWidget.OnActionWheelPreviousPage // (Final|Native|Public) // @ game+0x1ff2450
	void OnActionWheelOpened(); // Function Solarland.ActionWheelWidget.OnActionWheelOpened // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnActionWheelNextPage(); // Function Solarland.ActionWheelWidget.OnActionWheelNextPage // (Final|Native|Public) // @ game+0x1ff2430
	void OnActionWheelMouseRightClicked(); // Function Solarland.ActionWheelWidget.OnActionWheelMouseRightClicked // (Final|Native|Public) // @ game+0x1ff2410
	void OnActionWheelMouseLeftClicked(); // Function Solarland.ActionWheelWidget.OnActionWheelMouseLeftClicked // (Final|Native|Public) // @ game+0x1ff23f0
	void OnActionWheelConfigInit(); // Function Solarland.ActionWheelWidget.OnActionWheelConfigInit // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnActionWheelClosed(); // Function Solarland.ActionWheelWidget.OnActionWheelClosed // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void LoadCustomActionCommandInfo(struct FActionWheelConfig& ActionWheelConfig); // Function Solarland.ActionWheelWidget.LoadCustomActionCommandInfo // (Final|Native|Public|HasOutParms) // @ game+0x1ff2210
	void InitActionWheelConfigByGroupID(int32_t InGroupID, int32_t InPage); // Function Solarland.ActionWheelWidget.InitActionWheelConfigByGroupID // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff2140
	int32_t GetItemNumById(int32_t InItemID); // Function Solarland.ActionWheelWidget.GetItemNumById // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff20a0
	struct UActionWheelWidgetFunctionBase* GetActionWheelWidgetFunctionObj(int32_t InGroupID); // Function Solarland.ActionWheelWidget.GetActionWheelWidgetFunctionObj // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ff2000
	void CommandExec(int32_t InGroupID, int32_t InSelectedIndex); // Function Solarland.ActionWheelWidget.CommandExec // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff1880
	void ChangeWheelVisibility(bool Visible); // Function Solarland.ActionWheelWidget.ChangeWheelVisibility // (Final|Native|Public) // @ game+0x1ff17f0
	void ActionWheelYAxis(float Movement); // Function Solarland.ActionWheelWidget.ActionWheelYAxis // (Final|Native|Protected) // @ game+0x1ff1770
	void ActionWheelXAxis(float Movement); // Function Solarland.ActionWheelWidget.ActionWheelXAxis // (Final|Native|Protected) // @ game+0x1ff16f0
};

// Class Solarland.ActorEffect
// Size: 0x50 (Inherited: 0x28)
struct UActorEffect : UObject {
	struct UActorEffectController* ControllerClass; // 0x28(0x08)
	struct UActorEffectController* Controller; // 0x30(0x08)
	char pad_38[0x18]; // 0x38(0x18)
};

// Class Solarland.ActorEffectController
// Size: 0x28 (Inherited: 0x28)
struct UActorEffectController : UObject {
};

// Class Solarland.ActorEffectSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UActorEffectSubsystem : UWorldSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UActorEffect*> Effects; // 0x40(0x10)

	bool Stop(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Stop // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff2830
	struct UActorEffect* Start(struct UActorEffect* EffectClass, struct AActor* AffectedActor); // Function Solarland.ActorEffectSubsystem.Start // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff2760
	bool Finish(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Finish // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff1f40
};

// Class Solarland.ActorMarkBase
// Size: 0x3a0 (Inherited: 0x348)
struct UActorMarkBase : USolarUserWidget {
	char pad_348[0x18]; // 0x348(0x18)
	struct AActor* CurrentFollowActor; // 0x360(0x08)
	struct APlayerController* CurrentPlayerController; // 0x368(0x08)
	struct FVector2D MarkIconAlignment; // 0x370(0x08)
	struct FVector2D MarkPanelSize; // 0x378(0x08)
	char pad_380[0x18]; // 0x380(0x18)
	float MaxVisibleDis; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)

	void SetUpdateState(bool InShouldUpdateLocation); // Function Solarland.ActorMarkBase.SetUpdateState // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff9370
	void InitActorMarkBaseByFixedPos(struct FVector Pos, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBaseByFixedPos // (Final|Native|Public|HasDefaults) // @ game+0x1ff7340
	void InitActorMarkBase(struct AActor* InActor, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBase // (Final|Native|Public) // @ game+0x1ff7270
	struct FVector GetFollowActorLocation(); // Function Solarland.ActorMarkBase.GetFollowActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff7190
	float GetDistance(bool bIncludeZ); // Function Solarland.ActorMarkBase.GetDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ff70f0
	struct AActor* GetCurrentFollowActor(); // Function Solarland.ActorMarkBase.GetCurrentFollowActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff70c0
};

// Class Solarland.ActorMaterialSubsystemSettings
// Size: 0x90 (Inherited: 0x38)
struct UActorMaterialSubsystemSettings : UDeveloperSettings {
	struct FGameplayTag DefaultMaterialChangePriorityTag; // 0x38(0x08)
	struct TArray<struct FMaterialChangePriorityGroup> OrderedMaterialChangePriorityGroups; // 0x40(0x10)
	struct TArray<struct FSoftObjectPath> GlobalNoChangeMaterials; // 0x50(0x10)
	struct TArray<struct FForceChangeMaterialInfos> GlobalForceChangeMaterials; // 0x60(0x10)
	char pad_70[0x20]; // 0x70(0x20)

	int32_t GetMaterialChangePriority(struct FGameplayTag& Tag); // Function Solarland.ActorMaterialSubsystemSettings.GetMaterialChangePriority // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff71d0
};

// Class Solarland.ActorMaterialSubsystem
// Size: 0x90 (Inherited: 0x30)
struct UActorMaterialSubsystem : UWorldSubsystem {
	struct TMap<struct AActor*, struct FActorMaterialInfo> ActorMaterialsMap; // 0x30(0x50)
	char pad_80[0x10]; // 0x80(0x10)

	bool SetStaticMesh(struct AActor* Actor, struct UStaticMeshComponent* MeshComp, struct UStaticMesh* NewMesh); // Function Solarland.ActorMaterialSubsystem.SetStaticMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff9260
	bool SetSkeletalMesh(struct AActor* Actor, struct USkeletalMeshComponent* MeshComp, struct USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation); // Function Solarland.ActorMaterialSubsystem.SetSkeletalMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff90a0
	bool SetOriginalMultiplePassMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, struct UMaterialInterface* Material, bool bNeedMultiplePass); // Function Solarland.ActorMaterialSubsystem.SetOriginalMultiplePassMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff8f40
	bool SetOriginalMaterials(struct AActor* Actor, struct UMeshComponent* MeshComp, struct TArray<struct UMaterialInterface*>& Materials); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ff8e10
	bool SetOriginalMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, int32_t MaterialIndex, struct UMaterialInterface* Material); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff8cb0
	void RemoveNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.RemoveNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ff8be0
	bool RemoveMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.RemoveMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff8b10
	bool RemoveAllMaterialChanges(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RemoveAllMaterialChanges // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff8a70
	void RebuildMaterialChangesOnMeshAddedOrRemoved(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnMeshAddedOrRemoved // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff89e0
	void RebuildMaterialChangesOnAllOriginalMaterialsChanged(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnAllOriginalMaterialsChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff8950
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameterByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* SourcePrimitiveComponent, int32_t SourceElementIndex, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameterByIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ff8780
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameter(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ff85f0
	void OnActorEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.ActorMaterialSubsystem.OnActorEndPlay // (Final|Native|Private) // @ game+0x1ff8520
	bool K2_SetVectorMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, struct FVector ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetVectorMaterialParameter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ff8220
	bool K2_SetScalarMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, float ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetScalarMaterialParameter // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff7f30
	void K2_RebuildMaterialChangesOnOriginalMaterialChanged(struct AActor* Actor, struct TArray<struct UMeshComponent*> ChangedMeshes); // Function Solarland.ActorMaterialSubsystem.K2_RebuildMaterialChangesOnOriginalMaterialChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff7e00
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParametersByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* PrimitiveComponent, int32_t SourceElementIndex, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParametersByIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ff7c00
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParameters(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ff7a40
	struct UMaterialInstanceDynamic* K2_CreateDynamicMaterialInstanceOverrideAllParameters(struct UPrimitiveComponent* TargetPrimitiveComponent, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, int32_t TargetElementIndex, bool bOverridenOnly, struct FName OptionalMaterialName); // Function Solarland.ActorMaterialSubsystem.K2_CreateDynamicMaterialInstanceOverrideAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ff77e0
	struct FMaterialChangeHandle K2_AddMaterialChangeByPath(struct AActor* Actor, struct FSoftObjectPath& MaterialPath, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChangeByPath // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1ff75f0
	struct FMaterialChangeHandle K2_AddMaterialChange(struct AActor* Actor, struct UMaterialInterface* SourceMaterial, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff7420
	bool EmptyOriginalOverrideMaterials(struct AActor* Actor, struct UMeshComponent* MeshComp); // Function Solarland.ActorMaterialSubsystem.EmptyOriginalOverrideMaterials // (Final|Native|Public|BlueprintCallable) // @ game+0x1ff6ff0
	bool ContainsMaterialChangeByPriority(struct AActor* Actor, int32_t Priority); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChangeByPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff6f20
	bool ContainsMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff6e50
	bool ContainsAnyMaterialChange(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.ContainsAnyMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ff6db0
	void AddNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.AddNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1ff6ce0
};

// Class Solarland.ActorMaterialSubsystemAgentInterface
// Size: 0x28 (Inherited: 0x28)
struct UActorMaterialSubsystemAgentInterface : UInterface {
};

// Class Solarland.ActorMaterialSubsystemAgentComponentInterface
// Size: 0x28 (Inherited: 0x28)
struct UActorMaterialSubsystemAgentComponentInterface : UInterface {

	struct UMaterialInterface* AMS_GetAlternativeSourceMaterial(struct UMaterialInterface* OriginalSourceMaterial); // Function Solarland.ActorMaterialSubsystemAgentComponentInterface.AMS_GetAlternativeSourceMaterial // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1ff6c40
};

// Class Solarland.ActorParticleEffectSpawner
// Size: 0xb0 (Inherited: 0x28)
struct UActorParticleEffectSpawner : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct FActorParticleEffectSpawnInfo Info; // 0x38(0x70)
	char pad_A8[0x8]; // 0xa8(0x08)
};

// Class Solarland.ActorParticleEffectSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UActorParticleEffectSubsystem : UWorldSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UActorParticleEffectSpawner*> Spawners; // 0x40(0x10)

	struct FActorParticleEffectSpawnHandle K2_RequestParticleEffectSpawn(struct AActor* Actor, struct FActorParticleEffectSpawnInfo SpawnInfo); // Function Solarland.ActorParticleEffectSubsystem.K2_RequestParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffe6a0
	void CancelParticleEffectSpawn(struct FActorParticleEffectSpawnHandle Handle); // Function Solarland.ActorParticleEffectSubsystem.CancelParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffce50
};

// Class Solarland.AdvProgressBase
// Size: 0x310 (Inherited: 0x260)
struct UAdvProgressBase : UUserWidget {
	struct UImage* Progress; // 0x260(0x08)
	struct UMaterialInstance* ProgressShader; // 0x268(0x08)
	float Speed; // 0x270(0x04)
	float CurrentHP; // 0x274(0x04)
	float MaxHP; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct TMap<int32_t, float> ActionMap; // 0x280(0x50)
	float AnimCurrentHP; // 0x2d0(0x04)
	float ProgressAdd; // 0x2d4(0x04)
	float ProgressMinus; // 0x2d8(0x04)
	char pad_2DC[0x34]; // 0x2dc(0x34)

	void UpdateMaxHPLength(float NewHPMax, float NewCurrentHP); // Function Solarland.AdvProgressBase.UpdateMaxHPLength // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffef70
	void SetProgress(float _PreMinus, float _CurrentHP, float _PreAdd); // Function Solarland.AdvProgressBase.SetProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffee50
	int32_t PreAction(float Number); // Function Solarland.AdvProgressBase.PreAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffedc0
	void Init(float _DefaultHP, float _MaxHP); // Function Solarland.AdvProgressBase.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffd1f0
	float GetMaxHP(); // Function Solarland.AdvProgressBase.GetMaxHP // (Final|Native|Public|Const) // @ game+0x1ffd120
	float GetCurrentHPPercent(); // Function Solarland.AdvProgressBase.GetCurrentHPPercent // (Final|Native|Public|Const) // @ game+0x1ffd100
	void DoActionSmoothly(float Number); // Function Solarland.AdvProgressBase.DoActionSmoothly // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffd050
	void DoActionDirectly(float Number); // Function Solarland.AdvProgressBase.DoActionDirectly // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffcfd0
	void DoAction(int32_t ID); // Function Solarland.AdvProgressBase.DoAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffcf40
	struct FLinearColor Debug(); // Function Solarland.AdvProgressBase.Debug // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ffcf00
	void CleanPreActions(); // Function Solarland.AdvProgressBase.CleanPreActions // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffcee0
	void CancelAction(int32_t ID); // Function Solarland.AdvProgressBase.CancelAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffcd20
};

// Class Solarland.AerialReconnaissanceMarkWidget
// Size: 0x348 (Inherited: 0x348)
struct UAerialReconnaissanceMarkWidget : USolarUserWidget {

	void K2_MarkStateChanged(bool bInStart); // Function Solarland.AerialReconnaissanceMarkWidget.K2_MarkStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.AirDropAudioActor
// Size: 0x2c0 (Inherited: 0x228)
struct AAirDropAudioActor : AActor {
	struct FVector DropBeginLocation; // 0x228(0x0c)
	struct FVector DropEndLocation; // 0x234(0x0c)
	float CurrZ; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct AActor* SpawnedWarningEffect; // 0x248(0x08)
	struct AActor* WarningEffect; // 0x250(0x08)
	int32_t ThisID; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	bool bSummonedByCharacter; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
	struct FString SNameAirDropSpawnWarning; // 0x268(0x10)
	struct FString SNameAirDropStopSpawnWarning; // 0x278(0x10)
	struct FString SNameAirDropApprochWarning; // 0x288(0x10)
	struct FString SNameAirDropStopApprochWarning; // 0x298(0x10)
	struct UAkComponent* AkAudioComponent; // 0x2a8(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x2b0(0x08)
	char pad_2B8[0x1]; // 0x2b8(0x01)
	bool bHasLanded; // 0x2b9(0x01)
	char pad_2BA[0x6]; // 0x2ba(0x06)

	void OnAirDropTreasureBoxStateChanged(int32_t ItemID, enum class EAirDropMovementState MovementState, enum class EAirDropOpenState OpenState); // Function Solarland.AirDropAudioActor.OnAirDropTreasureBoxStateChanged // (Final|Native|Public) // @ game+0x1ffe9a0
	void OnAirDropApproch(int32_t InThisID); // Function Solarland.AirDropAudioActor.OnAirDropApproch // (Final|Native|Public) // @ game+0x1ffe910
	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.AirDropAudioActor.InitSolarAkGameObject // (Final|Native|Public) // @ game+0x1ffe0b0
};

// Class Solarland.SolarDormantActor
// Size: 0x228 (Inherited: 0x228)
struct ASolarDormantActor : AActor {
};

// Class Solarland.SolarItemActor
// Size: 0x3e0 (Inherited: 0x228)
struct ASolarItemActor : ASolarDormantActor {
	char pad_228[0x40]; // 0x228(0x40)
	struct FSolarItemData ItemData; // 0x268(0xb8)
	float SpawnOffset; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct TArray<struct FSoftObjectPath> DiscardMatPath; // 0x328(0x10)
	struct FSoftObjectPath OutlineMatPath; // 0x338(0x18)
	struct FSoftObjectPath FXPath; // 0x350(0x18)
	float NoneMeshFxOffset; // 0x368(0x04)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct FString FXBPPath; // 0x370(0x10)
	struct USphereComponent* SphereComponent; // 0x380(0x08)
	char pad_388[0x4]; // 0x388(0x04)
	struct TWeakObjectPtr<struct AActor> FXActor; // 0x38c(0x08)
	enum class EItemState ItemCurrentState; // 0x394(0x01)
	char pad_395[0xb]; // 0x395(0x0b)
	struct TArray<char> MarkedTeamIdList; // 0x3a0(0x10)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x3b8(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> NormalMats; // 0x3c0(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> OutlineMats; // 0x3d0(0x10)

	void UnMarkThisItem(char TeamID); // Function Solarland.SolarItemActor.UnMarkThisItem // (Native|Public) // @ game+0x216a800
	void SwitchDiscardMaterials(); // Function Solarland.SolarItemActor.SwitchDiscardMaterials // (Final|Native|Protected) // @ game+0x2186740
	void SetOutlineMeshVisible(bool Visible); // Function Solarland.SolarItemActor.SetOutlineMeshVisible // (Native|Public) // @ game+0x2186590
	void SetItemData(struct FSolarItemData& _ItemData); // Function Solarland.SolarItemActor.SetItemData // (Native|Public|HasOutParms) // @ game+0x216a2e0
	void OnServerPawned(); // Function Solarland.SolarItemActor.OnServerPawned // (Native|Public) // @ game+0x216a2b0
	void OnRep_ItemDataChange(); // Function Solarland.SolarItemActor.OnRep_ItemDataChange // (Native|Public) // @ game+0x816980
	void OnRep_ItemCurrentStateChanged(); // Function Solarland.SolarItemActor.OnRep_ItemCurrentStateChanged // (Native|Protected) // @ game+0x1571170
	void NotifyThisItemWasPickedUp(); // Function Solarland.SolarItemActor.NotifyThisItemWasPickedUp // (Final|Native|Public) // @ game+0x2185d70
	void MarkThisItem(char TeamID); // Function Solarland.SolarItemActor.MarkThisItem // (Native|Public) // @ game+0x2169b20
	struct UStaticMeshComponent* GetStaticMeshComp(); // Function Solarland.SolarItemActor.GetStaticMeshComp // (Final|Native|Public) // @ game+0x2185cc0
	int32_t GetQuality(); // Function Solarland.SolarItemActor.GetQuality // (Native|Public) // @ game+0x21696c0
};

// Class Solarland.SolarTreasureBoxActor
// Size: 0x5d0 (Inherited: 0x3e0)
struct ASolarTreasureBoxActor : ASolarItemActor {
	enum class ETreasureBoxState CurrentState; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)
	struct FSolarItemDataArray ItemDataList; // 0x3e8(0x118)
	struct TArray<struct FSolarItemData> SortedGameItemDatas; // 0x500(0x10)
	char pad_510[0x20]; // 0x510(0x20)
	int32_t DataLeng; // 0x530(0x04)
	enum class ECostType CostType; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	int32_t CostNum; // 0x538(0x04)
	char pad_53C[0x54]; // 0x53c(0x54)
	int32_t HighestItemQuality; // 0x590(0x04)
	float BurstRadius; // 0x594(0x04)
	float BurstRadiusRandScale; // 0x598(0x04)
	float BurstLocalHeight; // 0x59c(0x04)
	float BurstEulerAngle; // 0x5a0(0x04)
	bool bBurstSplitItem; // 0x5a4(0x01)
	enum class EBurstMethod BurstMethod; // 0x5a5(0x01)
	char pad_5A6[0x2]; // 0x5a6(0x02)
	float RadSafeSlopeToBurstOn; // 0x5a8(0x04)
	float GoldenSpiralMinRadiusSquared; // 0x5ac(0x04)
	struct TArray<struct ASolarBurstItemActor*> BurstItemActors; // 0x5b0(0x10)
	struct UAkComponent* AkAudioComponent; // 0x5c0(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x5c8(0x08)

	void UpdateTreasureBoxInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateTreasureBoxInternal // (Native|Public) // @ game+0x7e5fd0
	void UpdateOpenBoxUIByState(enum class ETreasureBoxState NewState); // Function Solarland.SolarTreasureBoxActor.UpdateOpenBoxUIByState // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void UpdateItemDataListInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateItemDataListInternal // (Final|Native|Public) // @ game+0x22b98e0
	void ServerSetState(enum class ETreasureBoxState NewState, struct ASolarCharacter* RequestCharacter); // Function Solarland.SolarTreasureBoxActor.ServerSetState // (Final|Native|Public) // @ game+0x22b8a70
	void ServerNotifyPlayerOpen(struct ASolarCharacter* RequestCharacter, enum class EItemType InItemType); // Function Solarland.SolarTreasureBoxActor.ServerNotifyPlayerOpen // (Final|Native|Public) // @ game+0x22b88d0
	void PlayOpenAnimation(); // Function Solarland.SolarTreasureBoxActor.PlayOpenAnimation // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnRep_ItemDataList(); // Function Solarland.SolarTreasureBoxActor.OnRep_ItemDataList // (Final|Native|Public) // @ game+0x22b8730
	void OnRep_CurrentState(); // Function Solarland.SolarTreasureBoxActor.OnRep_CurrentState // (Final|Native|Public) // @ game+0x22b8670
	void OnClientItemHighestQualityChanged(int32_t NewQuality, int32_t PrevQuality); // Function Solarland.SolarTreasureBoxActor.OnClientItemHighestQualityChanged // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x22b84d0
	bool IsEmpty(); // Function Solarland.SolarTreasureBoxActor.IsEmpty // (Final|Native|Public) // @ game+0x22b80c0
	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.SolarTreasureBoxActor.InitSolarAkGameObject // (Final|Native|Protected) // @ game+0x22b7ff0
	int32_t GetNumCost(); // Function Solarland.SolarTreasureBoxActor.GetNumCost // (Final|Native|Public|Const) // @ game+0x22b7ef0
	struct TArray<struct FSolarItemData> GetItemList(); // Function Solarland.SolarTreasureBoxActor.GetItemList // (Final|Native|Public) // @ game+0x22b7d90
	enum class ECostType GetCostType(); // Function Solarland.SolarTreasureBoxActor.GetCostType // (Final|Native|Public|Const) // @ game+0x22b7d10
	void ConstructTreasureBoxTest(struct TArray<int32_t>& itemIdList); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBoxTest // (Final|Native|Public|HasOutParms) // @ game+0xb443e0
	void ConstructTreasureBox(int32_t dropId); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBox // (Final|Native|Public) // @ game+0x15b05a0
	bool BOpened(); // Function Solarland.SolarTreasureBoxActor.BOpened // (Native|Public) // @ game+0x22b7b00
};

// Class Solarland.AirDropTreasureBox
// Size: 0xcb0 (Inherited: 0x5d0)
struct AAirDropTreasureBox : ASolarTreasureBoxActor {
	bool bPendingDestroy; // 0x5d0(0x01)
	bool bIsOpening; // 0x5d1(0x01)
	char pad_5D2[0x2]; // 0x5d2(0x02)
	float openProgress; // 0x5d4(0x04)
	struct ASolarCharacter* OpeningCharacter; // 0x5d8(0x08)
	float OpenTime; // 0x5e0(0x04)
	float ProtectionTime; // 0x5e4(0x04)
	char pad_5E8[0xd]; // 0x5e8(0x0d)
	bool bBoxLanded; // 0x5f5(0x01)
	char pad_5F6[0x5a]; // 0x5f6(0x5a)
	struct FString SummonPlayerID; // 0x650(0x10)
	float StartDropHeight; // 0x660(0x04)
	struct FRotator TargetRotation; // 0x664(0x0c)
	struct FVector TargetLocation; // 0x670(0x0c)
	char pad_67C[0x4]; // 0x67c(0x04)
	struct TSoftObjectPtr<UParticleSystem> OpenAirdropEffect; // 0x680(0x28)
	struct TSoftObjectPtr<UParticleSystem> LandHitEffect; // 0x6a8(0x28)
	struct TSoftObjectPtr<UParticleSystem> LandSmokeEffect; // 0x6d0(0x28)
	struct TSoftObjectPtr<UParticleSystem> PendingDestroyEffect; // 0x6f8(0x28)
	struct TSoftObjectPtr<UParticleSystem> DestroyEffect; // 0x720(0x28)
	struct TSoftObjectPtr<UParticleSystem> FallingEffect; // 0x748(0x28)
	struct TSoftObjectPtr<UParticleSystem> FallingImpulseEffect; // 0x770(0x28)
	struct TSoftObjectPtr<UParticleSystem> LightBeamEffect; // 0x798(0x28)
	struct FTransform FallingEffectOffset; // 0x7c0(0x30)
	struct FTransform FallingImpulseEffectOffset; // 0x7f0(0x30)
	struct FTransform LightBeamEffectOffset; // 0x820(0x30)
	struct FTransform PendingDestroyEffectOffset; // 0x850(0x30)
	struct UAnimationAsset* LandAnimation; // 0x880(0x08)
	struct UAnimationAsset* OpenAnimation; // 0x888(0x08)
	float dropGravity; // 0x890(0x04)
	float maxDropSpeed; // 0x894(0x04)
	float originHeight; // 0x898(0x04)
	float DecelerateHeight; // 0x89c(0x04)
	float ShowLandSmokeHeight; // 0x8a0(0x04)
	float DecelerateTime; // 0x8a4(0x04)
	struct UCurveFloat* DecelerateCurve; // 0x8a8(0x08)
	float AirDropSpawnDelay; // 0x8b0(0x04)
	float AudioActorHeightOffset; // 0x8b4(0x04)
	float AudioActorFallSpeed; // 0x8b8(0x04)
	char pad_8BC[0x4]; // 0x8bc(0x04)
	struct FSoftClassPath AirDropGuideMeshBPClassPath; // 0x8c0(0x18)
	float DropApprochDuration; // 0x8d8(0x04)
	float FallingEffectDelay; // 0x8dc(0x04)
	bool bSummonBySkill; // 0x8e0(0x01)
	char pad_8E1[0x3]; // 0x8e1(0x03)
	float YawOffset; // 0x8e4(0x04)
	enum class EAirDropMovementState MovementState; // 0x8e8(0x01)
	enum class EAirDropOpenState OpenState; // 0x8e9(0x01)
	char pad_8EA[0x6]; // 0x8ea(0x06)
	struct USkeletalMeshComponent* SkeletalMeshComp; // 0x8f0(0x08)
	char pad_8F8[0x50]; // 0x8f8(0x50)
	struct UParticleSystemComponent* FallingPSC; // 0x948(0x08)
	char pad_950[0x18]; // 0x950(0x18)
	struct FSolarDamageInfo DamageInfo; // 0x968(0x40)
	struct FString SNameAirDropOpen; // 0x9a8(0x10)
	struct FString SNameLandHit; // 0x9b8(0x10)
	struct FString SNameAirDropSpawn; // 0x9c8(0x10)
	struct FString SNameAirDropSpawnWarning; // 0x9d8(0x10)
	struct FString SNameAirDropStopSpawnWarning; // 0x9e8(0x10)
	struct FString SNameAirDropApprochWarning; // 0x9f8(0x10)
	struct FString SNameAirDropStopApprochWarning; // 0xa08(0x10)
	struct FString SNameStartDrop; // 0xa18(0x10)
	struct FString SNameStopDrop; // 0xa28(0x10)
	struct FString SNameDecelerateAudio; // 0xa38(0x10)
	struct FString SNamePlayLandedLoopAudio; // 0xa48(0x10)
	struct FString SNameStopLandedLoopAudio; // 0xa58(0x10)
	struct FString SNamePlayOnGroundBroadcastLoopAudio; // 0xa68(0x10)
	struct FString SNameStopOnGroundBroadcastLoopAudio; // 0xa78(0x10)
	struct FString SNamePlayStartHackAudio; // 0xa88(0x10)
	struct FString SNameStopStartHackAudio; // 0xa98(0x10)
	struct FString SNamePlayHackingLoopAudio; // 0xaa8(0x10)
	struct FString SNameStopHackingLoopAudio; // 0xab8(0x10)
	struct FString SNameStopHackingLoopAudioAux; // 0xac8(0x10)
	struct FString PendingDestroyLoopStart; // 0xad8(0x10)
	struct FString PendingDestroyLoopEnd; // 0xae8(0x10)
	struct FString SNameDestroySound; // 0xaf8(0x10)
	char pad_B08[0x68]; // 0xb08(0x68)
	struct FName ColorKeyTag1; // 0xb70(0x08)
	struct FName ColorKeyTag2; // 0xb78(0x08)
	struct FName ColorKeyGlow; // 0xb80(0x08)
	struct FName ColorKeyMesh; // 0xb88(0x08)
	struct FName AlphaKey; // 0xb90(0x08)
	struct FName LightBeamAlphaKey; // 0xb98(0x08)
	struct FName ColorKeyTagFlow1; // 0xba0(0x08)
	struct FName ColorKeyTagFlow2; // 0xba8(0x08)
	struct FName ColorKeyLightEffect; // 0xbb0(0x08)
	float FadeTweenDuration; // 0xbb8(0x04)
	float RedTweenDuration; // 0xbbc(0x04)
	struct FLinearColor BlueColorTag1; // 0xbc0(0x10)
	struct FLinearColor RedColorTag1; // 0xbd0(0x10)
	struct FLinearColor BlueColorTag2; // 0xbe0(0x10)
	struct FLinearColor RedColorTag2; // 0xbf0(0x10)
	struct FLinearColor BlueColorGlow; // 0xc00(0x10)
	struct FLinearColor RedColorGlow; // 0xc10(0x10)
	struct FLinearColor BlueColorMesh; // 0xc20(0x10)
	struct FLinearColor RedColorMesh; // 0xc30(0x10)
	struct FLinearColor RedColorTagFlow1; // 0xc40(0x10)
	struct FLinearColor RedColorTagFlow2; // 0xc50(0x10)
	struct FLinearColor BlueColorTagFlow1; // 0xc60(0x10)
	struct FLinearColor BlueColorTagFlow2; // 0xc70(0x10)
	struct FLinearColor RedColorLightEffect; // 0xc80(0x10)
	struct FLinearColor BlueColorLightEffect; // 0xc90(0x10)
	char pad_CA0[0x10]; // 0xca0(0x10)

	void PlayLandingAnimation(); // Function Solarland.AirDropTreasureBox.PlayLandingAnimation // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	bool OpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.OpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x1ffed20
	void OnStateChanged(); // Function Solarland.AirDropTreasureBox.OnStateChanged // (Native|Public) // @ game+0x1571a30
	void OnRep_TargetLocation(); // Function Solarland.AirDropTreasureBox.OnRep_TargetLocation // (Final|Native|Public) // @ game+0x8f2720
	void OnRep_SummonPlayerID(); // Function Solarland.AirDropTreasureBox.OnRep_SummonPlayerID // (Final|Native|Public) // @ game+0x1ffece0
	void OnRep_StartDropHeight(); // Function Solarland.AirDropTreasureBox.OnRep_StartDropHeight // (Final|Native|Public) // @ game+0x1ffecc0
	void OnRep_PendingDestroy(); // Function Solarland.AirDropTreasureBox.OnRep_PendingDestroy // (Final|Native|Public) // @ game+0x1ffeca0
	void OnRep_OpenState(enum class EAirDropOpenState OpenState); // Function Solarland.AirDropTreasureBox.OnRep_OpenState // (Final|Native|Public) // @ game+0x1ffec20
	void OnRep_OpenProgressChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenProgressChange // (Final|Native|Public) // @ game+0x1ffec00
	void OnRep_OpenCharacterChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenCharacterChange // (Final|Native|Public) // @ game+0x1ffebe0
	void OnRep_MovementState(enum class EAirDropMovementState MovementState); // Function Solarland.AirDropTreasureBox.OnRep_MovementState // (Final|Native|Public) // @ game+0x1ffeb60
	void OnRep_IsOpening(); // Function Solarland.AirDropTreasureBox.OnRep_IsOpening // (Final|Native|Public) // @ game+0x1ffeb40
	void OnRep_bBoxLanded(); // Function Solarland.AirDropTreasureBox.OnRep_bBoxLanded // (Final|Native|Public) // @ game+0x1ffed00
	void OnOpenStateChanged(enum class EAirDropOpenState InPrevOpenState, enum class EAirDropOpenState InCurrOpenState); // Function Solarland.AirDropTreasureBox.OnOpenStateChanged // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnMovementStateChanged(enum class EAirDropMovementState InPrevMovementState, enum class EAirDropMovementState InCurrMovementState); // Function Solarland.AirDropTreasureBox.OnMovementStateChanged // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnFadeOutFallingEffect(); // Function Solarland.AirDropTreasureBox.OnFadeOutFallingEffect // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	bool IsSummonedByCharacter(); // Function Solarland.AirDropTreasureBox.IsSummonedByCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1ffe670
	bool IsOpenningCharacterOffline(); // Function Solarland.AirDropTreasureBox.IsOpenningCharacterOffline // (Final|Native|Protected) // @ game+0x1ffe640
	bool IsCharacterInRange(struct ASolarCharacter* InCheckCharacter); // Function Solarland.AirDropTreasureBox.IsCharacterInRange // (Final|Native|Protected) // @ game+0x1ffe5a0
	bool CancelOpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.CancelOpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x1ffcdb0
};

// Class Solarland.AirlineCruiseCompInterface
// Size: 0x28 (Inherited: 0x28)
struct UAirlineCruiseCompInterface : UInterface {

	struct UAirlineCruiseComponent* GetAirlineCruiseComponent(); // Function Solarland.AirlineCruiseCompInterface.GetAirlineCruiseComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1ffd0d0
};

// Class Solarland.GameModeCompBase
// Size: 0xd0 (Inherited: 0xb0)
struct UGameModeCompBase : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	bool bPreStartPlay; // 0xb8(0x01)
	bool bTakeChargeStartPlay; // 0xb9(0x01)
	bool bPostStartPlay; // 0xba(0x01)
	char pad_BB[0x2]; // 0xbb(0x02)
	bool bPreHandleMatchHasStarted; // 0xbd(0x01)
	bool bTakeChargeHandleMatchHasStarted; // 0xbe(0x01)
	bool bPostHandleMatchHasStarted; // 0xbf(0x01)
	char pad_C0[0x2]; // 0xc0(0x02)
	bool bPreRestartPlayer; // 0xc2(0x01)
	bool bTakeChargeRestartPlayer; // 0xc3(0x01)
	bool bPostRestartPlayer; // 0xc4(0x01)
	char pad_C5[0x2]; // 0xc5(0x02)
	bool bPreEndPlay; // 0xc7(0x01)
	bool bTakeChargeEndPlay; // 0xc8(0x01)
	bool bPostEndPlay; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)

	void PreStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x204c440
	void PreRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x204c340
	void PreHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x204c290
	void PreGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204c1e0
	void PreGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204c0e0
	void PreGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204c030
	void PreGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204bf30
	void PreEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x204be30
	void PostStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x204bd80
	void PostRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x204bc80
	void PostHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x204bbd0
	void PostGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204bb20
	void PostGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204ba20
	void PostGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b970
	void PostGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b870
	void PostEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x204b770
	void OnGameModeStartPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b5a0
	void OnGameModeRestartPlayer(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.OnGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b450
	void OnGameModeHandleMatchHasStarted(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b340
	void OnGameModeEndPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.OnGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x204b1f0
	struct ASolarGameMode* GetGameModeOwner(); // Function Solarland.GameModeCompBase.GetGameModeOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x204ac60
};

// Class Solarland.AirlineCruiseComponent
// Size: 0x148 (Inherited: 0xd0)
struct UAirlineCruiseComponent : UGameModeCompBase {
	int32_t UsedAirlineID; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct ASolarCapsuleRoot* CapsuleRootClass; // 0xd8(0x08)
	struct ASolarCapsuleRoot* CapsuleRoot; // 0xe0(0x08)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0xe8(0x50)
	struct ASolarCharacter* CruiseTemplate; // 0x138(0x08)
	char pad_140[0x8]; // 0x140(0x08)

	void OnPlayerJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnPlayerJoin // (Final|Native|Protected) // @ game+0x1ffe880
	void OnCruiseCompleted(struct AActor* DestroyedRoot); // Function Solarland.AirlineCruiseComponent.OnCruiseCompleted // (Final|Native|Protected) // @ game+0x1ffeab0
	void OnAIJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnAIJoin // (Final|Native|Protected) // @ game+0x1ffe880
	int32_t GetUsedAirlineData(struct FAirlineData& outData); // Function Solarland.AirlineCruiseComponent.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ffd140
};

// Class Solarland.AmmoConfig
// Size: 0x6e0 (Inherited: 0x30)
struct UAmmoConfig : UDataAsset {
	enum class EHoldActionType HoldAction; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct FFireChargeData> FireChargeDatas; // 0x38(0x10)
	struct FString FireChargeStopSoundName; // 0x48(0x10)
	float ChargingToleranceEndTime; // 0x58(0x04)
	float ChargingWorkingEndTime; // 0x5c(0x04)
	float ChargingHoldingEndTime; // 0x60(0x04)
	float ChargingTrajectoryTime; // 0x64(0x04)
	bool bScaleHitEffectByChargingTime; // 0x68(0x01)
	bool bCostToChargeScale; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	int32_t FireCostFullShot; // 0x6c(0x04)
	bool bForceFullShot; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float MaxChargingDamageScale; // 0x74(0x04)
	float DeltaAngle; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FString Name; // 0x80(0x10)
	struct FString Des; // 0x90(0x10)
	int32_t PropID; // 0xa0(0x04)
	float LifeTime; // 0xa4(0x04)
	enum class EFireMethodType FireMethodType; // 0xa8(0x01)
	enum class ETrajectoryType TrajectoryType; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	float CustomValue; // 0xac(0x04)
	struct ASolarBullet* BulletClass; // 0xb0(0x08)
	enum class EBounceType BulletBounce; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32_t BounceTimes; // 0xbc(0x04)
	enum class ETriggerType TriggerType; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	float MaxRange; // 0xc4(0x04)
	float EffRange; // 0xc8(0x04)
	float Radius; // 0xcc(0x04)
	float InitSpeed; // 0xd0(0x04)
	enum class ECostFireType FireCostType; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
	int32_t FireCostPerAttack; // 0xd8(0x04)
	int32_t FireSpeedChangeTime; // 0xdc(0x04)
	float FireSpeedChangeCOP; // 0xe0(0x04)
	float FastestFireInterval; // 0xe4(0x04)
	float SlowestFireInterval; // 0xe8(0x04)
	float BaseFireInterval; // 0xec(0x04)
	float FireIntervalRevertPreTime; // 0xf0(0x04)
	float FireIntervalReavertSpeed; // 0xf4(0x04)
	float BoltActionTime; // 0xf8(0x04)
	float StartBoltDuration; // 0xfc(0x04)
	float AutoFireBreakTime; // 0x100(0x04)
	float FirePrepareTime; // 0x104(0x04)
	float FireStateBreakTime; // 0x108(0x04)
	float FireStreakBreakTime; // 0x10c(0x04)
	int32_t FireIdx; // 0x110(0x04)
	bool bTimedExplode; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	float BaseReloadTime; // 0x118(0x04)
	float ReloadBoltTime; // 0x11c(0x04)
	float PostFireOverload; // 0x120(0x04)
	bool bPlayHitSound; // 0x124(0x01)
	bool bPlayExplodeSound; // 0x125(0x01)
	char pad_126[0x2]; // 0x126(0x02)
	float FlySoundReceiveRadius; // 0x128(0x04)
	float FlySoundIgnoreDistance; // 0x12c(0x04)
	int32_t SingleSoundCount; // 0x130(0x04)
	char pad_134[0x4]; // 0x134(0x04)
	struct FString Play_Land_Common_Hit_1P; // 0x138(0x10)
	struct FString Play_Land_Common_Hit_3P; // 0x148(0x10)
	struct FString Play_Land_Common_Hit_3P_Enemy; // 0x158(0x10)
	struct FString Play_Land_Fly_Once_3P; // 0x168(0x10)
	struct FString Play_Land_Fly_Once_3P_Enemy; // 0x178(0x10)
	struct FString Play_Land_Fly_Loop_1P; // 0x188(0x10)
	struct FString Play_Land_Fly_Loop_3P; // 0x198(0x10)
	struct FString Play_Land_Fly_Loop_3P_Enemy; // 0x1a8(0x10)
	struct FString Stop_Land_Fly_Loop_1P; // 0x1b8(0x10)
	struct FString Stop_Land_Fly_Loop_3P; // 0x1c8(0x10)
	struct FString Stop_Land_Fly_Loop_3P_Enemy; // 0x1d8(0x10)
	struct FString Play_Fire_Empty_1p; // 0x1e8(0x10)
	struct FString Play_Fire_Empty_3p; // 0x1f8(0x10)
	struct FString Play_Fire_Empty_3p_Enemy; // 0x208(0x10)
	struct UCurveFloat* PostFireSpreadCurveStruct; // 0x218(0x08)
	float VhADSSpreadCOP; // 0x220(0x04)
	float ADSSpreadCOP; // 0x224(0x04)
	float SpreadFirePreTime; // 0x228(0x04)
	float SpreadPostFireSpeed; // 0x22c(0x04)
	float SpreadRestorePreTime; // 0x230(0x04)
	float SpreadRestoreSpeed; // 0x234(0x04)
	struct FWeaponFireTPPAnimConfig TPPRecoilConfig; // 0x238(0x28)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigNoScope; // 0x260(0x70)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigWithScope; // 0x2d0(0x70)
	struct FAmmonVerticalRecoilStruct PitchRecoilStruct; // 0x340(0x30)
	struct FAmmonHorizontalRecoilStruct YawRecoilStruct; // 0x370(0x30)
	struct FAmmonRecoilRollStruct RollRecoilStruct; // 0x3a0(0x40)
	struct FAmmonRecoilScope ScopeRecoil; // 0x3e0(0xb8)
	float ADSRecoilCOP; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct TMap<struct FString, float> RecoilCOPMap; // 0x4a0(0x50)
	struct TArray<enum class EPhysicalSurface> IgnoreEPhysicalSurface; // 0x4f0(0x10)
	bool bAutoBurstFire; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float BurstFireInterval; // 0x504(0x04)
	float BurstFireInternalInterval; // 0x508(0x04)
	float FireAnimationPlayRate; // 0x50c(0x04)
	int32_t AmmoSoundType; // 0x510(0x04)
	float ProjectileMaxGravity; // 0x514(0x04)
	float ParticleStartDistance; // 0x518(0x04)
	float TrajectoryStartDistance; // 0x51c(0x04)
	bool bPenetrable; // 0x520(0x01)
	bool bTakeDamageAfterDeathVerge; // 0x521(0x01)
	char pad_522[0x6]; // 0x522(0x06)
	struct UCurveFloat* PenetrationDamageMultiplierCurve; // 0x528(0x08)
	struct UCurveFloat* CylinderDamageMultiplierCurve; // 0x530(0x08)
	struct FSlateBrush TriggerIcon; // 0x538(0x98)
	enum class EVirtualBulletType VirtualBulletType; // 0x5d0(0x01)
	bool bStepOnServer; // 0x5d1(0x01)
	char pad_5D2[0x6]; // 0x5d2(0x06)
	struct UAmmoConfig* TraceOverrideAmmo; // 0x5d8(0x08)
	char TraceTargetFlag; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	struct FTracerBulletData TracerData; // 0x5e8(0x40)
	struct UCurveFloat* BulletOffsetCurve; // 0x628(0x08)
	struct TArray<struct FVector2D> BulletOffsetAngles; // 0x630(0x10)
	struct UCurveFloat* BulletDamageCurve; // 0x640(0x08)
	struct UCurveFloat* BulletScaleCurve; // 0x648(0x08)
	struct UCurveFloat* BulletMovementCurve; // 0x650(0x08)
	bool bThirdPesonViewXScaledByDistance; // 0x658(0x01)
	bool bForceApplyAbility; // 0x659(0x01)
	char pad_65A[0x6]; // 0x65a(0x06)
	struct TArray<struct ASolarAbility*> AmmoAbilityClasses; // 0x660(0x10)
	struct TArray<struct ASolarAbility*> AmmoAbilityClassesOnDestroyed; // 0x670(0x10)
	struct ASolarAbility* AmmoAbilityClassesOnSelf; // 0x680(0x08)
	int32_t SkillType; // 0x688(0x04)
	int32_t NameLocalTextIDNumber; // 0x68c(0x04)
	int32_t DescriptionLocalTextIDNumber; // 0x690(0x04)
	int32_t RangeLocalTextID; // 0x694(0x04)
	int32_t DifficultyLocalTextID; // 0x698(0x04)
	char pad_69C[0x4]; // 0x69c(0x04)
	struct FSolarDamageInfo DamageInfo; // 0x6a0(0x40)

	void InitVerticalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitVerticalRecoilStruct // (Final|Native|Public|Const) // @ game+0x1ffe380
	void InitSpreadData(float adscop, float vhadscop, float firepre, float changespeed, float restorepre, float restorespeed); // Function Solarland.AmmoConfig.InitSpreadData // (Final|Native|Public|Const) // @ game+0x1ffe180
	void InitScopeRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitScopeRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x1ffde50
	void InitScopeAndCrossHairVibration(float ScopeVMaxDistanceOffSet, float ScopeVVibrationDuration, float ScopeHMaxDistanceOffSet, float ScopeHVibrationDuration, float ScopeVContinuousFallingDuration, float ScopeVContinuousFallingPointIndex, float VMaxDistanceOffSetScale, float VVibrationDurationScale, float VSingleOffSetScale, float VContinuousOffSetScale, float HMaxDistanceOffSetScale, float HVibrationDurationScale, float HSingleOffSetScale, float HContinuousOffSetScale, float HOffSetProbabilityScale); // Function Solarland.AmmoConfig.InitScopeAndCrossHairVibration // (Final|Native|Public|Const) // @ game+0x1ffd9b0
	void InitRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x1ffd750
	void InitRecoilCOPMap(struct TArray<struct FString>& Keys, struct TArray<float>& Values); // Function Solarland.AmmoConfig.InitRecoilCOPMap // (Final|Native|Public|HasOutParms|Const) // @ game+0x1ffd610
	void InitPostFireSpreadCurveStruct(struct FString Path); // Function Solarland.AmmoConfig.InitPostFireSpreadCurveStruct // (Final|Native|Public|Const) // @ game+0x1ffd570
	void InitHorizontalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitHorizontalRecoilStruct // (Final|Native|Public|Const) // @ game+0x1ffd350
	void InitBaseData(int32_t Trigger); // Function Solarland.AmmoConfig.InitBaseData // (Final|Native|Public|Const) // @ game+0x1ffd2c0
};

// Class Solarland.AndroidInputManager
// Size: 0x38 (Inherited: 0x28)
struct UAndroidInputManager : UObject {
	struct FMulticastInlineDelegate OnAndroidBackPressed; // 0x28(0x10)
};

// Class Solarland.AnimNotify_CharacterFootEffect
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterFootEffect : UAnimNotify {
	struct TArray<struct FFootEffect> FootEffectList; // 0x38(0x10)

	void AddNewFootEffect(struct FFootEffect& NewEffect); // Function Solarland.AnimNotify_CharacterFootEffect.AddNewFootEffect // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2003bd0
};

// Class Solarland.AnimNotify_CharacterPlaySoundGroup
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_CharacterPlaySoundGroup : UAnimNotify {
	struct FName SoundGroupName; // 0x38(0x08)
};

// Class Solarland.SolarAnimNotify
// Size: 0x40 (Inherited: 0x38)
struct USolarAnimNotify : UAnimNotify {
	bool bDynamic; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotify_CharacterStartSound
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_CharacterStartSound : USolarAnimNotify {
	struct TArray<struct FCharacterSound> SoundList; // 0x40(0x10)
	bool bUseSwitch; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<struct FString> SwitchGroupNames; // 0x58(0x10)
	bool bUseRTPC; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct TArray<struct FString> RPTCNames; // 0x70(0x10)

	int32_t RemoveAllSwitches(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllSwitches // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x20048b0
	int32_t RemoveAllRPTCs(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllRPTCs // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2004880
	int32_t RemoveAllCharacterSounds(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllCharacterSounds // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2004850
	void AddNewSwitch(struct FString NewSwitch); // Function Solarland.AnimNotify_CharacterStartSound.AddNewSwitch // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2003d30
	void AddNewRPTC(struct FString NewRTPC); // Function Solarland.AnimNotify_CharacterStartSound.AddNewRPTC // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2003c90
	void AddNewCharacterSound(struct FCharacterSound& NewSound); // Function Solarland.AnimNotify_CharacterStartSound.AddNewCharacterSound // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2003a30
};

// Class Solarland.AnimNotify_CharacterStopSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterStopSound : UAnimNotify {
	struct TArray<struct FCharacterSound> StopList; // 0x38(0x10)

	int32_t RemoveAllCharacterSoundStops(); // Function Solarland.AnimNotify_CharacterStopSound.RemoveAllCharacterSoundStops // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2004820
	void AddNewCharacterSoundStop(struct FCharacterSound& NewStop); // Function Solarland.AnimNotify_CharacterStopSound.AddNewCharacterSoundStop // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2003b00
};

// Class Solarland.AnimNotify_ExecuteGameplayCueLocal
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_ExecuteGameplayCueLocal : UAnimNotify {
	struct FGameplayCueTag GameplayCueTag; // 0x38(0x08)
};

// Class Solarland.AnimNotify_FlyWaterEffect
// Size: 0x88 (Inherited: 0x38)
struct UAnimNotify_FlyWaterEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FName SocketName; // 0x68(0x08)
	struct FVector LocationOffset; // 0x70(0x0c)
	struct FRotator RotationOffset; // 0x7c(0x0c)
};

// Class Solarland.AnimNotify_LegVehicleRiseDust
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_LegVehicleRiseDust : UAnimNotify {
	struct TArray<int32_t> NotifyFootIndex; // 0x38(0x10)
};

// Class Solarland.AnimNotify_PlayParticleAsync
// Size: 0xb0 (Inherited: 0x38)
struct UAnimNotify_PlayParticleAsync : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FVector LocationOffset; // 0x68(0x0c)
	struct FRotator RotationOffset; // 0x74(0x0c)
	struct FVector Scale; // 0x80(0x0c)
	char pad_8C[0x14]; // 0x8c(0x14)
	char Attached : 1; // 0xa0(0x01)
	char pad_A0_1 : 7; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FName SocketName; // 0xa4(0x08)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.AnimNotify_PlayPickupSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PlayPickupSound : UAnimNotify {
	struct FString DefaultSoundEventName; // 0x38(0x10)

	struct FString GetDefaultSoundEventName(); // Function Solarland.AnimNotify_PlayPickupSound.GetDefaultSoundEventName // (Final|Native|Public|Const) // @ game+0x2004310
};

// Class Solarland.AnimNotify_ReloadClip
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_ReloadClip : UAnimNotify {
	struct FName HandBoneName; // 0x38(0x08)
	enum class EAnimReloadNotifyType StepType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Solarland.AnimNotify_ServerRefreshBones
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ServerRefreshBones : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldEndRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldEndRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldHideRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldHideRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldOperatorSet
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldOperatorSet : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldShowRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldShowRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldStartRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldStartRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldUpgradeFinishFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldUpgradeFinishFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ThrowThrown
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ThrowThrown : UAnimNotify {
};

// Class Solarland.AnimNotify_VehicleCameraShake
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_VehicleCameraShake : UAnimNotify {
	struct UCameraShake* VehicleCameraShake; // 0x38(0x08)
};

// Class Solarland.AnimNotify_VehiclePlaySound
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotify_VehiclePlaySound : UAnimNotify {
	bool bCheckEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString SameTeamSound; // 0x40(0x10)
	struct FString EnemySound; // 0x50(0x10)
};

// Class Solarland.AnimNotify_VehiclePreviewSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehiclePreviewSound : UAnimNotify {
	struct FString Sound; // 0x38(0x10)
};

// Class Solarland.AnimNotify_VehicleVFX
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehicleVFX : UAnimNotify {
	struct TArray<struct FVehicleVFX> VehicleVFXes; // 0x38(0x10)
};

// Class Solarland.AnimNotify_WeaponBolt
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_WeaponBolt : UAnimNotify {
};

// Class Solarland.AnimNotifyState_AddLooseGameplayTag
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_AddLooseGameplayTag : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
};

// Class Solarland.AnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_AutoCancelOnInputReleased
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AutoCancelOnInputReleased : UAnimNotifyState {
};

// Class Solarland.SolarAnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct USolarAnimNotifyState : UAnimNotifyState {
	bool bDynamic; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Solarland.AnimNotifyState_CharacterLoopedSound
// Size: 0x58 (Inherited: 0x38)
struct UAnimNotifyState_CharacterLoopedSound : USolarAnimNotifyState {
	struct TArray<struct FCharacterSound> EventListToPlay; // 0x38(0x10)
	struct TArray<struct FCharacterSound> EventListToStop; // 0x48(0x10)
};

// Class Solarland.AnimNotifyState_HideCharacterMesh
// Size: 0x48 (Inherited: 0x30)
struct UAnimNotifyState_HideCharacterMesh : UAnimNotifyState {
	struct FGameplayTag VisibilityTag; // 0x30(0x08)
	bool bPropagateToChildren; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct USceneComponent* ChildrenExceptClass; // 0x40(0x08)
};

// Class Solarland.AnimNotifyState_InhibitAimOffset
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitAimOffset : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_InhibitLeftHandWeaponAttach
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitLeftHandWeaponAttach : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_OpenTreasureBox
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_OpenTreasureBox : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_OverrideHitEffectSurfaceType
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_OverrideHitEffectSurfaceType : UAnimNotifyState {
	enum class EPhysicalSurface SurfaceType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Solarland.AnimNotifyState_PlayGameplayCueLocal
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_PlayGameplayCueLocal : UAnimNotifyState {
	struct FGameplayCueTag GameplayCueTag; // 0x30(0x08)
};

// Class Solarland.AnimNotifyState_RechargeShield
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_RechargeShield : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
	bool bFXorMesh; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Solarland.AnimNotifyState_RepairVehicleWeakPoints
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_RepairVehicleWeakPoints : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_ShieldUpgradeFX
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_ShieldUpgradeFX : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_SolarSpawnMeshAndAttach
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_SolarSpawnMeshAndAttach : UAnimNotifyState {
	struct TArray<struct FAttachedMeshInfo> MeshesInfo; // 0x30(0x10)
	struct TArray<struct UStaticMeshComponent*> SpawnedMeshComps; // 0x40(0x10)
};

// Class Solarland.AnimNotifyState_SolarTimedParticleEffect
// Size: 0xb0 (Inherited: 0x30)
struct UAnimNotifyState_SolarTimedParticleEffect : UAnimNotifyState {
	bool bAsyncLoad; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	bool Attached; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FName SocketName; // 0x6c(0x08)
	struct FVector LocationOffset; // 0x74(0x0c)
	struct FRotator RotationOffset; // 0x80(0x0c)
	struct FVector Scale; // 0x8c(0x0c)
	bool bDestroyAtEnd; // 0x98(0x01)
	bool bLockRelativeRotation; // 0x99(0x01)
	char pad_9A[0x16]; // 0x9a(0x16)
};

// Class Solarland.AnimNotifyState_UpgradeShield
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_UpgradeShield : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
};

// Class Solarland.AttributeSubExecCalc
// Size: 0x68 (Inherited: 0x40)
struct UAttributeSubExecCalc : UGameplayEffectExecutionCalculation {
	struct UAttributeSubExecProxy* CDOProxyClass; // 0x40(0x08)
	struct UAttributeSubExecProxy* CDOProxy; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
};

// Class Solarland.AttributeSubExecProxy
// Size: 0x30 (Inherited: 0x28)
struct UAttributeSubExecProxy : UObject {
	struct TWeakObjectPtr<struct UAttributeSubExecCalc> CDOOwner; // 0x28(0x08)

	void ModifyAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, enum class EAttributeSubBehavior Behavior, int32_t AttributeSubID, struct FName AttrSubTag, float ModifyValue); // Function Solarland.AttributeSubExecProxy.ModifyAttributeSub // (Final|Native|Protected|BlueprintCallable) // @ game+0x2004670
	struct FGameplayModifierEvaluatedData MakeExecProxyEvaluated(struct FGameplayAttribute InAttribute, float InMagnitud); // Function Solarland.AttributeSubExecProxy.MakeExecProxyEvaluated // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x2004390
	void ExecutePureAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs); // Function Solarland.AttributeSubExecProxy.ExecutePureAttributeSub // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void ExecuteAttributeCalculation(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs, struct TArray<struct FGameplayAttribute>& InAttribute, struct TArray<struct FGameplayModifierEvaluatedData>& OutModResults); // Function Solarland.AttributeSubExecProxy.ExecuteAttributeCalculation // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2649560
	struct UAttributeSubExecProxy* CreateProxy(struct UAttributeSubExecCalc* InCDOOwner, struct UAttributeSubExecProxy* ProxyClass); // Function Solarland.AttributeSubExecProxy.CreateProxy // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x2004240
};

// Class Solarland.AttributeSubGameplayEffect
// Size: 0x868 (Inherited: 0x848)
struct UAttributeSubGameplayEffect : UGameplayEffect {
	struct TArray<struct FAttributeSubSetting> AttributeSubMods; // 0x848(0x10)
	struct TArray<struct FAttributeSubSetting> PureAttributeSubs; // 0x858(0x10)

	void UpdateAttributeBySub(struct FGameplayAttribute Attribute); // Function Solarland.AttributeSubGameplayEffect.UpdateAttributeBySub // (Final|Native|Public|BlueprintCallable) // @ game+0x20048e0
	struct UAttributeSubGameplayEffect* CreateAttributeSubEffectInstance(struct UObject* Outer, struct UAttributeSubExecCalc* AttributeSubCalcClass, struct UAttributeSubGameplayEffect* Class); // Function Solarland.AttributeSubGameplayEffect.CreateAttributeSubEffectInstance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2004140
	void CancelPureAttributeSub(int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x20040b0
	void CancelAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x2003ea0
	void AddPureAttributeSub(int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x2003dd0
	void AddAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x2003800
};

// Class Solarland.AttributeSubInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttributeSubInterface : UInterface {

	struct USolarAttributeSubComponent* GetAttributeSubComponent(); // Function Solarland.AttributeSubInterface.GetAttributeSubComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1ffd0d0
};

// Class Solarland.VertAnimMeshComponent
// Size: 0x630 (Inherited: 0x600)
struct UVertAnimMeshComponent : UStaticMeshComponent {
	char pad_600[0x30]; // 0x600(0x30)

	void PlayInfo(struct FVertexAnimInfo& InAnimInfo); // Function Solarland.VertAnimMeshComponent.PlayInfo // (Final|Native|Public|HasOutParms) // @ game+0x231cc90
	void Play(int32_t InStartFrame, int32_t InEndFrame, float InLength, bool InLoop); // Function Solarland.VertAnimMeshComponent.Play // (Final|Native|Public) // @ game+0x231cb30
};

// Class Solarland.BackpackVertAnimMeshComponent
// Size: 0x710 (Inherited: 0x630)
struct UBackpackVertAnimMeshComponent : UVertAnimMeshComponent {
	struct FVertexAnimInfo DefaultAnimInfo; // 0x630(0x10)
	struct TMap<enum class EBackPackAnimSubType, struct FVertexAnimInfo> BackPackAnimInfoMap; // 0x640(0x50)
	struct ASolarCharacter* SolarCharacter; // 0x690(0x08)
	struct ASolarBackpackActor* BackPackActor; // 0x698(0x08)
	char pad_6A0[0x70]; // 0x6a0(0x70)
};

// Class Solarland.SolarAttributeSet
// Size: 0x30 (Inherited: 0x30)
struct USolarAttributeSet : UAttributeSet {

	void K2_SetAttributeValue(struct FName AttributeName, float NewVal); // Function Solarland.SolarAttributeSet.K2_SetAttributeValue // (Final|Native|Protected|BlueprintCallable) // @ game+0x20d34b0
	void K2_OnReplicationAttribute(struct FGameplayAttributeData& OldValue, struct FGameplayAttributeData& ReplicatedAttribute, struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_OnReplicationAttribute // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x20d3360
	void K2_InitAttributeValue(struct FGameplayAttributeData& OriginAttribute, float NewVal); // Function Solarland.SolarAttributeSet.K2_InitAttributeValue // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x20d3270
	float K2_GetAttributeValue(struct FGameplayAttributeData& OriginAttribute); // Function Solarland.SolarAttributeSet.K2_GetAttributeValue // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x20c5d90
	struct FGameplayAttribute K2_GetAttribute(struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_GetAttribute // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x20d3110
};

// Class Solarland.BasalAttributeSet
// Size: 0x50 (Inherited: 0x30)
struct UBasalAttributeSet : USolarAttributeSet {
	struct FGameplayAttributeData MaxHealth; // 0x30(0x10)
	struct FGameplayAttributeData CurrentHealth; // 0x40(0x10)

	void OnRep_MaxHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_MaxHealth // (Native|Protected|HasOutParms) // @ game+0x200aee0
	void OnRep_CurrentHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_CurrentHealth // (Native|Protected|HasOutParms) // @ game+0x200ae30
};

// Class Solarland.BattleChat
// Size: 0x338 (Inherited: 0x260)
struct UBattleChat : UUserWidget {
	struct UGaugeImage* ChatCDMask; // 0x260(0x08)
	struct UImage* ImgBG; // 0x268(0x08)
	struct UCheckBoxGroup* CBGroupOperation; // 0x270(0x08)
	struct UScrollBox* PanelChatOptions; // 0x278(0x08)
	struct USolarCheckBox* CBoxChatSwitch; // 0x280(0x08)
	struct UWidgetAnimation* AnimChatCooldown; // 0x288(0x08)
	struct UQuickChatUnit* ChatButtonClass; // 0x290(0x08)
	struct FSlateBrush SeparatorBrush; // 0x298(0x98)
	char pad_330[0x8]; // 0x330(0x08)

	void SetLogDisplay(bool bDisplay); // Function Solarland.BattleChat.SetLogDisplay // (Final|Native|Protected) // @ game+0x200b570
	void ReceiveQuickMessage(struct FString InName, struct FString InMessage1, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleChat.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x200b0a0
	void ReceiveQuickChatSending(); // Function Solarland.BattleChat.ReceiveQuickChatSending // (Final|Native|Protected) // @ game+0x200b080
	void OnGroupOperationStateChanged(struct TArray<struct UCheckBox*>& ChildChangedArray, int32_t CheckedChildIndex); // Function Solarland.BattleChat.OnGroupOperationStateChanged // (Final|Native|Protected|HasOutParms) // @ game+0x200a9a0
};

// Class Solarland.SolarHUD
// Size: 0x318 (Inherited: 0x318)
struct ASolarHUD : AHUD {
};

// Class Solarland.BattleHUDBase
// Size: 0x398 (Inherited: 0x318)
struct ABattleHUDBase : ASolarHUD {
	struct UHUDDispatcherBase* Dispatcher; // 0x318(0x08)
	struct UHUDDispatcherBase* WidgetEventDispatcher; // 0x320(0x08)
	bool bUseBattleDeathView; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct USolarPlayersHPModel* PlayersHPModel; // 0x330(0x08)
	struct USolarPlayersShieldModel* PlayersShieldModel; // 0x338(0x08)
	struct USolarTeamInfoModel* TeamInfoModelModel; // 0x340(0x08)
	char pad_348[0x50]; // 0x348(0x50)

	void ShowDiePage_Deprecated(); // Function Solarland.BattleHUDBase.ShowDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x200b600
	void OnPlayerStateRepInController(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleHUDBase.OnPlayerStateRepInController // (Native|Protected) // @ game+0x200ad60
	void OnPlayerStateRepInCharacter(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleHUDBase.OnPlayerStateRepInCharacter // (Native|Protected) // @ game+0x200ac90
	void OnNewTeamInfo(struct ASolarTeamInfo* TeamInfo); // Function Solarland.BattleHUDBase.OnNewTeamInfo // (Native|Protected) // @ game+0x200aaa0
	void OnCharacterEndPlay(struct ASolarCharacter* Character); // Function Solarland.BattleHUDBase.OnCharacterEndPlay // (Native|Protected) // @ game+0x200a8f0
	struct UUISubsystem* GetUISubSystem(); // Function Solarland.BattleHUDBase.GetUISubSystem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x200a7d0
	void CloseDiePage_Deprecated(struct UUserWidget* InDiePageClass); // Function Solarland.BattleHUDBase.CloseDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x200a4a0
};

// Class Solarland.BattleHUDForTechDesign
// Size: 0x398 (Inherited: 0x398)
struct ABattleHUDForTechDesign : ABattleHUDBase {
};

// Class Solarland.UINoticeBase
// Size: 0x370 (Inherited: 0x348)
struct UUINoticeBase : USolarUserWidget {
	struct USolarRichTextBlock* TextWidget; // 0x348(0x08)
	struct UImage* TxtBg; // 0x350(0x08)
	struct UImage* Icon; // 0x358(0x08)
	struct UImage* IconBg; // 0x360(0x08)
	char pad_368[0x8]; // 0x368(0x08)

	void ShowEnterAnimation(); // Function Solarland.UINoticeBase.ShowEnterAnimation // (Native|Public|BlueprintCallable) // @ game+0xbb7300
	void SetIconBrush(struct FString IconPath); // Function Solarland.UINoticeBase.SetIconBrush // (Final|Native|Public|BlueprintCallable) // @ game+0x23145e0
	void SetColor(struct FNoticeColorData& InColorData); // Function Solarland.UINoticeBase.SetColor // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2314480
	void ResetIsPlayingVoice(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Solarland.UINoticeBase.ResetIsPlayingVoice // (Final|Native|Public) // @ game+0x23142e0
	struct UWidgetAnimation* GetExitAnimation(); // Function Solarland.UINoticeBase.GetExitAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2313b10
	struct UWidgetAnimation* GetEnterAnimation(); // Function Solarland.UINoticeBase.GetEnterAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2313ae0
	void DefaultClose(); // Function Solarland.UINoticeBase.DefaultClose // (Final|Native|Public|BlueprintCallable) // @ game+0x2313ac0
	void CloseNotice(); // Function Solarland.UINoticeBase.CloseNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x2313a10
};

// Class Solarland.BattleNoticeEquipReplace
// Size: 0x458 (Inherited: 0x370)
struct UBattleNoticeEquipReplace : UUINoticeBase {
	struct UImage* Img_Item1; // 0x370(0x08)
	struct UImage* Img_Item2; // 0x378(0x08)
	struct UImage* Img_Item1_BG; // 0x380(0x08)
	struct UImage* Img_Item2_BG; // 0x388(0x08)
	struct UTextBlock* Quality1; // 0x390(0x08)
	struct UTextBlock* Quality2; // 0x398(0x08)
	struct UWidgetAnimation* Enter_Animation_1; // 0x3a0(0x08)
	struct UWidgetAnimation* Enter_Animation_2; // 0x3a8(0x08)
	struct UWidgetAnimation* Enter_Animation_3; // 0x3b0(0x08)
	struct TMap<enum class EItemType, struct TSoftObjectPtr<UTexture2D>> DefaultEquipIcons; // 0x3b8(0x50)
	struct TMap<enum class EWeaponPartType, struct TSoftObjectPtr<UTexture2D>> DefaultWeaponPartIcons; // 0x408(0x50)

	void OnEquipReplaceAnimFinished(); // Function Solarland.BattleNoticeEquipReplace.OnEquipReplaceAnimFinished // (Final|Native|Public) // @ game+0x200a980
};

// Class Solarland.BattleNoticePickup
// Size: 0x3a0 (Inherited: 0x370)
struct UBattleNoticePickup : UUINoticeBase {
	struct USolarTextBlock* Txt_PickupNotice_ItemName; // 0x370(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Head; // 0x378(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Tail; // 0x380(0x08)
	struct UImage* Img_Txt_bg; // 0x388(0x08)
	struct TArray<struct FLinearColor> QualityColor; // 0x390(0x10)
};

// Class Solarland.BattleOBHUD
// Size: 0x3a8 (Inherited: 0x398)
struct ABattleOBHUD : ABattleHUDBase {
	char pad_398[0x8]; // 0x398(0x08)
	struct USolarOBUIModel* SolarOBUIModel; // 0x3a0(0x08)

	void SetBattleOBHUDType(enum class EBattleOBHUDType& Type); // Function Solarland.BattleOBHUD.SetBattleOBHUDType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x200b4e0
	void OpenShortCutKeyboard(); // Function Solarland.BattleOBHUD.OpenShortCutKeyboard // (Final|Native|Public|BlueprintCallable) // @ game+0x200b060
	struct UOBHUDDispatcher* GetOBHUDDispatcher(); // Function Solarland.BattleOBHUD.GetOBHUDDispatcher // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x200a7a0
	enum class EBattleOBHUDType GetBattleOBHUDType(); // Function Solarland.BattleOBHUD.GetBattleOBHUDType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x200a530
	void AddWidgetToOBRoot(struct UPanelSlot*& ResultSlot, struct UWidget* InChildWidget, struct FName& PanelName, bool bReplaceOld); // Function Solarland.BattleOBHUD.AddWidgetToOBRoot // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x200a080
};

// Class Solarland.BattlePassConfigInfo
// Size: 0x38 (Inherited: 0x28)
struct UBattlePassConfigInfo : UObject {
	struct TArray<struct FBattlePassLevelInfo> BattlePassLevel; // 0x28(0x10)

	bool IsMaxLevelWithExp(int32_t BattlePassID, int32_t TotalExp); // Function Solarland.BattlePassConfigInfo.IsMaxLevelWithExp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x200a820
	void Initialize(); // Function Solarland.BattlePassConfigInfo.Initialize // (Final|Native|Public) // @ game+0x200a800
	int32_t GetLevelByTestExp(int32_t BattlePassID, int32_t InTestExp); // Function Solarland.BattlePassConfigInfo.GetLevelByTestExp // (Final|Native|Public) // @ game+0x200a6d0
	int32_t GetExpNeedForLv(int32_t BattlePassID, int32_t Level); // Function Solarland.BattlePassConfigInfo.GetExpNeedForLv // (Final|Native|Public) // @ game+0x200a600
	int32_t GetBattllePassMaxLevel(int32_t BattlePassID); // Function Solarland.BattlePassConfigInfo.GetBattllePassMaxLevel // (Final|Native|Public) // @ game+0x200a560
};

// Class Solarland.BattlePromptWidget
// Size: 0x650 (Inherited: 0x348)
struct UBattlePromptWidget : USolarUserWidget {
	char pad_348[0x10]; // 0x348(0x10)
	struct UCanvasPanel* EnterAnimPanel; // 0x358(0x08)
	struct UMeshRectangleWidget* MeshWidget_Arrow; // 0x360(0x08)
	struct UMeshRectangleWidget* MeshWidget_Detail; // 0x368(0x08)
	struct TMap<enum class EBattlePromptType, enum class EBattlePromptType> DisplayTypeMap; // 0x370(0x50)
	struct TMap<enum class EBattlePromptType, int32_t> TypeUVMap; // 0x3c0(0x50)
	float ElemIconDifference; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	struct TMap<enum class EBattlePromptType, float> ElemRadiusMap; // 0x418(0x50)
	int32_t ThreatFactorDefault; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemArrowColorCurveMap; // 0x470(0x50)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemArrowLengthCurveMap; // 0x4c0(0x50)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemIconScaleCurveMap; // 0x510(0x50)
	int32_t CloseCheckAngleDefault; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct UCurveFloat* CloseCheckAngleCurve; // 0x568(0x08)
	float ElemLerpSpeed; // 0x570(0x04)
	int32_t EditorTestColorFactor; // 0x574(0x04)
	int32_t EditorTestLengthFactor; // 0x578(0x04)
	int32_t EditorTestAngle; // 0x57c(0x04)
	struct TSet<struct AActor*> EffectedNightmareActors; // 0x580(0x50)
	char pad_5D0[0x20]; // 0x5d0(0x20)
	struct TArray<struct FPromptElemInfo> Datas; // 0x5f0(0x10)
	char pad_600[0x50]; // 0x600(0x50)

	void PlayForbidAnim(bool bQuickEnter); // Function Solarland.BattlePromptWidget.PlayForbidAnim // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnSpecTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarPlayerState* NewTarget); // Function Solarland.BattlePromptWidget.OnSpecTargetChanged // (Final|Native|Public) // @ game+0x200af90
	void OnNightComesActorChanged(struct AActor* InActor); // Function Solarland.BattlePromptWidget.OnNightComesActorChanged // (Final|Native|Public) // @ game+0x200ab30
};

// Class Solarland.BattleSubSundry
// Size: 0x398 (Inherited: 0x348)
struct UBattleSubSundry : USolarUserWidget {
	struct UScrollBox* PanelInformation; // 0x348(0x08)
	struct USolarRichTextBlock* TxtInformation03; // 0x350(0x08)
	struct USolarRichTextBlock* TxtInformation02; // 0x358(0x08)
	struct USolarRichTextBlock* TxtInformation01; // 0x360(0x08)
	struct UWidgetAnimation* AnimInformationDisappear; // 0x368(0x08)
	int32_t MaxMessageStock; // 0x370(0x04)
	float ChatCoolDown; // 0x374(0x04)
	float InfoKeepDuration; // 0x378(0x04)
	char pad_37C[0x1c]; // 0x37c(0x1c)

	void ReceiveQuickMessage(struct FString InName, struct FString InMessage, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleSubSundry.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x200b2c0
	void OnPlayerStateRep(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleSubSundry.OnPlayerStateRep // (Final|Native|Protected) // @ game+0x200abc0
};

// Class Solarland.BattleUpgradeEffectCategoryData
// Size: 0x80 (Inherited: 0x30)
struct UBattleUpgradeEffectCategoryData : UDataAsset {
	struct TMap<enum class EBattleUpgradeEffectCategory, struct FBattleUpgradeEffectCategoryConfig> CategoryConfigMap; // 0x30(0x50)

	void BreakBattleUpgradeEffectCategoryColorSet(struct FBattleUpgradeEffectCategoryColorSet& ColorSet, struct FLinearColor& BannerCategoryTextColor, struct FLinearColor& BannerIconColor, struct FLinearColor& BannerBorderColor, struct FLinearColor& BannerBackgroundColor, struct FLinearColor& BadgeIconColor, struct FLinearColor& BadgeBackgroundColor); // Function Solarland.BattleUpgradeEffectCategoryData.BreakBattleUpgradeEffectCategoryColorSet // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x200a200
};

// Class Solarland.BattleUpgradeEffectSettings
// Size: 0x90 (Inherited: 0x38)
struct UBattleUpgradeEffectSettings : UDeveloperSettings {
	struct TSoftObjectPtr<UDataTable> EffectTypeConfig; // 0x38(0x28)
	int32_t SelectEffectHintLocalTextID; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TSoftObjectPtr<UBattleUpgradeEffectCategoryData> EffectCategoryData; // 0x68(0x28)
};

// Class Solarland.BigWaterGun
// Size: 0x390 (Inherited: 0x228)
struct ABigWaterGun : AActor {
	float CylinderRadius; // 0x228(0x04)
	float CylinderLength; // 0x22c(0x04)
	float TraceInterval; // 0x230(0x04)
	float DamageChaPerInterval; // 0x234(0x04)
	float DamageVehPerInterval; // 0x238(0x04)
	float DamageDecayFirst; // 0x23c(0x04)
	float DamageDecaySecond; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct FSoftObjectPath MeshPath; // 0x248(0x18)
	struct FName MeshSocket; // 0x260(0x08)
	struct FRotator WaterColumnEffectRotator; // 0x268(0x0c)
	char pad_274[0x4]; // 0x274(0x04)
	struct UParticleSystem* WaterColumnEffect; // 0x278(0x08)
	struct FName InstigatorEffectID; // 0x280(0x08)
	struct UCameraShake* CameraShakeClass; // 0x288(0x08)
	struct UUserWidget* InCrossHairClass; // 0x290(0x08)
	float NearlyEndTime; // 0x298(0x04)
	bool bShowDebug; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	struct FVector TraceStartRelativeLocation; // 0x2a0(0x0c)
	struct FVector TraceStartRelativeLocation_Crouch; // 0x2ac(0x0c)
	float MuzzleTraceOffset; // 0x2b8(0x04)
	struct FName ShotAnimNotifyName; // 0x2bc(0x08)
	struct FName UnequipAnimNotifyName; // 0x2c4(0x08)
	struct FName UnequipAnimNotifyName_Gatling; // 0x2cc(0x08)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct UCurveFloat* DamageDecayCurve; // 0x2d8(0x08)
	struct FGameplayTag ChaSlowDownDecayDataTag; // 0x2e0(0x08)
	struct UCurveFloat* ChaSlowDownDecayCurve; // 0x2e8(0x08)
	struct FGameplayTag VehSlowDownDecayDataTag; // 0x2f0(0x08)
	struct UCurveFloat* VehSlowDownDecayCurve; // 0x2f8(0x08)
	float OcclusionCheckZOffset; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
	struct TArray<struct ASummonItemBase*> BlockDamageItemClasses; // 0x308(0x10)
	struct USkeletalMeshComponent* Mesh; // 0x318(0x08)
	bool bInFire; // 0x320(0x01)
	bool bHitOther; // 0x321(0x01)
	char pad_322[0x6]; // 0x322(0x06)
	struct UParticleSystemComponent* ClientWaterColumnEffectHandle; // 0x328(0x08)
	int32_t InstigatorEffectHandle; // 0x330(0x04)
	char pad_334[0x4]; // 0x334(0x04)
	struct UCameraShake* CameraShakeInstance; // 0x338(0x08)
	char pad_340[0x8]; // 0x340(0x08)
	struct UCrossHairWidget* CrossHairWidget; // 0x348(0x08)
	struct FGameplayEffectSpecHandle SlowDownEffectHandle; // 0x350(0x10)
	char pad_360[0x20]; // 0x360(0x20)
	struct FName LeftHandIKGripSocketName; // 0x380(0x08)
	struct FGameplayTag BigWaterGunOrnamentTag; // 0x388(0x08)

	void PlayNearlyEndSound(); // Function Solarland.BigWaterGun.PlayNearlyEndSound // (Final|Native|Private) // @ game+0x200ece0
	void OnRep_InFire(); // Function Solarland.BigWaterGun.OnRep_InFire // (Final|Native|Private) // @ game+0x200ecc0
	void OnRep_HitOther(); // Function Solarland.BigWaterGun.OnRep_HitOther // (Final|Native|Private) // @ game+0x200eca0
	void OnMontageNotifyCallBack(struct FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload); // Function Solarland.BigWaterGun.OnMontageNotifyCallBack // (Final|Native|Private|HasOutParms) // @ game+0x200ebb0
};

// Class Solarland.SpawnerInGuide
// Size: 0x278 (Inherited: 0x228)
struct ASpawnerInGuide : AActor {
	int32_t BotAISpawnerId; // 0x228(0x04)
	int32_t BotAICharacterId; // 0x22c(0x04)
	int32_t TeamID; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FString AIName; // 0x238(0x10)
	bool bSpawnDeathBox; // 0x248(0x01)
	bool bSpawnBeginPlay; // 0x249(0x01)
	char pad_24A[0x2]; // 0x24a(0x02)
	float DelaySec; // 0x24c(0x04)
	struct FVector SpawnLocationOffset; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct ASolarBotAIController* BotAIControllerClass; // 0x260(0x08)
	char pad_268[0x10]; // 0x268(0x10)

	struct ASolarBotAIController* SpawnBotAI(); // Function Solarland.SpawnerInGuide.SpawnBotAI // (Final|Native|Public|BlueprintCallable) // @ game+0x22fd520
	void SetBotAIConfig(struct ASolarBotAIController* Ctrl); // Function Solarland.SpawnerInGuide.SetBotAIConfig // (Native|Public) // @ game+0x22b4590
	struct ASolarBotAIController* GetSpawnedAIController(); // Function Solarland.SpawnerInGuide.GetSpawnedAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x22fc390
};

// Class Solarland.BotAISpawnerInGuide
// Size: 0x2b8 (Inherited: 0x278)
struct ABotAISpawnerInGuide : ASpawnerInGuide {
	struct UBehaviorTree* BehaviorTree; // 0x278(0x08)
	struct TArray<struct FDeathBoxItemData> DeathBoxItems; // 0x280(0x10)
	int32_t BotDefaultWeaponId; // 0x290(0x04)
	uint32_t BotShootDisperse; // 0x294(0x04)
	float HitRate; // 0x298(0x04)
	float ActiveDamageRate; // 0x29c(0x04)
	float NoDamageLeftHP; // 0x2a0(0x04)
	float BotAttackRange; // 0x2a4(0x04)
	struct FVector MoveTarget; // 0x2a8(0x0c)
	char pad_2B4[0x4]; // 0x2b4(0x04)
};

// Class Solarland.BTDecorator_BlackboardDelay
// Size: 0xc8 (Inherited: 0xc0)
struct UBTDecorator_BlackboardDelay : UBTDecorator_Blackboard {
	float DelaySeconds; // 0xc0(0x04)
	bool bOnlyDelayLowerPri; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
};

// Class Solarland.BTDecorator_TickFlow
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_TickFlow : UBTDecorator_BlackboardBase {
	float TickInterval; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotAttributeCompare
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_BotAttributeCompare : UBTDecorator_TickFlow {
	enum class EBotAttrType AttrType; // 0x98(0x01)
	enum class EBotAttrValueType ValueType; // 0x99(0x01)
	enum class EBotAttrOperator Operator; // 0x9a(0x01)
	char pad_9B[0x1]; // 0x9b(0x01)
	float CompareValue; // 0x9c(0x04)
	bool bCheckVehicle; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float EqualThreshold; // 0xa4(0x04)
};

// Class Solarland.BTDecorator_BotCheck
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheck : UBTDecorator_TickFlow {
	enum class EBotCheckCondition Condition; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckAIServer
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckAIServer : UBTDecorator_TickFlow {
	enum class EBotCheckAIServer Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckGameplayTags
// Size: 0xb8 (Inherited: 0x98)
struct UBTDecorator_BotCheckGameplayTags : UBTDecorator_TickFlow {
	struct FGameplayTagContainer AbilityTags; // 0x98(0x20)
};

// Class Solarland.BTDecorator_BotCheckInEffectArea
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckInEffectArea : UBTDecorator_TickFlow {
	enum class EPerceivableEffectAreaType CheckInAreaType; // 0x98(0x01)
	bool bCheckAreaTendency; // 0x99(0x01)
	enum class EPerceivableEffectAreaTendency AreaTendency; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Solarland.BTDecorator_BotCheckNgaiMLAction
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckNgaiMLAction : UBTDecorator_TickFlow {
	enum class EBotCheckNgaiMLAction Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckRoleAbility
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_BotCheckRoleAbility : UBTDecorator {
	struct FGameplayTag AbilityTag; // 0x68(0x08)
};

// Class Solarland.BTDecorator_BotCheckShieldUpgradeItem
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_BotCheckShieldUpgradeItem : UBTDecorator {
};

// Class Solarland.BTDecorator_BotCheckState
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckState : UBTDecorator_TickFlow {
	enum class EBotCheckState CheckState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckTeamMemberState
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckTeamMemberState : UBTDecorator_TickFlow {
	enum class ESolarBotMemberState CheckState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckWeaponType
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_BotCheckWeaponType : UBTDecorator_BlackboardBase {
	enum class EWeaponType WeaponType; // 0x90(0x01)
	bool bCheckById; // 0x91(0x01)
	char pad_92[0x2]; // 0x92(0x02)
	int32_t weaponid; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyDetectArea
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyDetectArea : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	float TimeThresholdMin; // 0x9c(0x04)
	float TimeThresholdMinDeviation; // 0xa0(0x04)
	bool bSpecifyAreaType; // 0xa4(0x01)
	enum class EPerceivableEffectAreaType SpecifiedAreaType; // 0xa5(0x01)
	bool bSpecifyAreaTendency; // 0xa6(0x01)
	enum class EPerceivableEffectAreaTendency SpecifiedAreaTendency; // 0xa7(0x01)
	float MinInfluenceValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyHit
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyHit : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	bool bIncludeHearingHit; // 0x9c(0x01)
	bool bTriggerDelay; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
	float TriggerDelaySeconds; // 0xa0(0x04)
	float TriggerDelaySecondsDeviation; // 0xa4(0x04)
	float TriggerExpiredSeconds; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_CheckGetOnPlayerVehicle
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_CheckGetOnPlayerVehicle : UBTDecorator_TickFlow {
	float AcceptableRadius; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Solarland.BTDecorator_CheckTagState
// Size: 0xc8 (Inherited: 0xc0)
struct UBTDecorator_CheckTagState : UBTDecorator_Blackboard {
	struct FGameplayTag CheckStateTag; // 0xc0(0x08)
};

// Class Solarland.BTDecorator_DistanceCompare
// Size: 0x128 (Inherited: 0x98)
struct UBTDecorator_DistanceCompare : UBTDecorator_TickFlow {
	enum class EDistanceComparison Operator; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FBlackboardKeySelector BlackboardKeyFrom; // 0xa0(0x28)
	struct FBlackboardKeySelector BlackboardKeyTo; // 0xc8(0x28)
	float DistanceToCompare; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FBlackboardKeySelector BBK_DistanceToCompare; // 0xf8(0x28)
	bool bDistance2D; // 0x120(0x01)
	char pad_121[0x3]; // 0x121(0x03)
	float EqualThreshold; // 0x124(0x04)
};

// Class Solarland.BTDecorator_TimeLimitRand
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_TimeLimitRand : UBTDecorator_TimeLimit {
	float RandDeviation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Solarland.BTDecorator_VehicleCheck
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_VehicleCheck : UBTDecorator_TickFlow {
	struct TArray<int32_t> VehicleIDs; // 0x98(0x10)
};

// Class Solarland.BuffEffectActorGroupVO
// Size: 0xd8 (Inherited: 0x28)
struct UBuffEffectActorGroupVO : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TMap<struct FName, struct FBuffEffectActorElemList> InstantActorListMap; // 0x30(0x50)
	char pad_80[0x8]; // 0x80(0x08)
	struct TMap<struct FName, struct UBuffEffectActorElem*> DurationActorMap; // 0x88(0x50)
};

// Class Solarland.BuffEffectVO
// Size: 0x40 (Inherited: 0x28)
struct UBuffEffectVO : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Solarland.BuffEffectActorVO
// Size: 0x58 (Inherited: 0x40)
struct UBuffEffectActorVO : UBuffEffectVO {
	char pad_40[0x18]; // 0x40(0x18)
};

// Class Solarland.BuffEffectActorElem
// Size: 0x40 (Inherited: 0x28)
struct UBuffEffectActorElem : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Solarland.BuffEffectLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuffEffectLibrary : UBlueprintFunctionLibrary {

	void StopScreenEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x200efc0
	void StopActorEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x200ef00
	int32_t StartScreenEffect(struct UObject* WorldContextObject, struct FString RowName); // Function Solarland.BuffEffectLibrary.StartScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x200ee20
	int32_t StartActorEffect(struct UObject* WorldContextObject, struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectLibrary.StartActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x200ed00
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.GetActorEffectPSComponents // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x200eaa0
};

// Class Solarland.BuffEffectScreenPanel
// Size: 0x4f8 (Inherited: 0x348)
struct UBuffEffectScreenPanel : USolarUserWidget {
	char pad_348[0x10]; // 0x348(0x10)
	struct UCanvasPanel* LayerDurationGroup; // 0x358(0x08)
	struct UCanvasPanel* LayerDurationTwoSidePart; // 0x360(0x08)
	struct UCanvasPanel* LayerDurationBottomHalfPart; // 0x368(0x08)
	struct UCanvasPanel* LayerDurationBorderPart; // 0x370(0x08)
	struct UCanvasPanel* LayerDurationTopHalfPart; // 0x378(0x08)
	struct UCanvasPanel* LayerDurationFullPart; // 0x380(0x08)
	struct UCanvasPanel* LayerInstantGroup; // 0x388(0x08)
	struct UCanvasPanel* LayerInstantTwoSidePart; // 0x390(0x08)
	struct UCanvasPanel* LayerInstantBottomHalfPart; // 0x398(0x08)
	struct UCanvasPanel* LayerInstantBorderPart; // 0x3a0(0x08)
	struct UCanvasPanel* LayerInstantTopHalfPart; // 0x3a8(0x08)
	struct UCanvasPanel* LayerInstantFullPart; // 0x3b0(0x08)
	char pad_3B8[0xa0]; // 0x3b8(0xa0)
	struct TMap<int32_t, struct USolarScreenEffectWidget*> HandleToWidget; // 0x458(0x50)
	struct TMap<struct USolarScreenEffectWidget*, struct FScreenEffectWidgetCacheInfo> WidgetsCanBeReused; // 0x4a8(0x50)
};

// Class Solarland.BuffEffectSubsystem
// Size: 0x220 (Inherited: 0x30)
struct UBuffEffectSubsystem : UWorldSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct TMap<uint32_t, struct UBuffEffectActorGroupVO*> BuffEffectActorGroupMap; // 0x40(0x50)
	struct TMap<uint32_t, struct UBuffEffectActorElem*> BuffEffectActorElemMap; // 0x90(0x50)
	struct TMap<int32_t, struct UBuffEffectActorVO*> BuffEffectActorHandleMap; // 0xe0(0x50)
	struct TMap<enum class EBuffEffectTagType, struct FScreenEffectGroup> ScreenEffectGroups; // 0x130(0x50)
	char pad_180[0xa0]; // 0x180(0xa0)

	void StopScreenEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x2014430
	void StopActorEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x20143a0
	int32_t StartScreenEffectSafe(struct FName& RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2014300
	int32_t StartScreenEffect(struct FString RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x2014250
	int32_t StartActorEffectSafe(struct FName& RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2014160
	int32_t StartActorEffect(struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x2014070
	void OnPSCompFinish(struct UParticleSystemComponent* PSComponent); // Function Solarland.BuffEffectSubsystem.OnPSCompFinish // (Final|Native|Private) // @ game+0x2013e40
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.GetActorEffectPSComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x2013a30
};

// Class Solarland.CameraModifier_CameraShakeWithCurve
// Size: 0xb8 (Inherited: 0x48)
struct UCameraModifier_CameraShakeWithCurve : UCameraModifier {
	struct TMap<struct UCameraShakeWithCurve*, struct FCameraShakeWithCurvePool> ShakePoolByClass; // 0x48(0x50)
	struct TArray<struct FCameraShakeWithCurveTemplatePool> ShakePoolByTemplate; // 0x98(0x10)
	struct TArray<struct FActiveCameraShakeWithCurve> ActiveShakes; // 0xa8(0x10)
};

// Class Solarland.CameraShakeWithCurve
// Size: 0xe0 (Inherited: 0x28)
struct UCameraShakeWithCurve : UObject {
	bool bSingleInstance; // 0x28(0x01)
	bool bDisableObjectPool; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct UCameraModifier_CameraShakeWithCurve* Modifier; // 0x30(0x08)
	float ShakeTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FRuntimeFloatCurve ShakeCurve; // 0x40(0x88)
	struct TArray<struct UCameraShakeWithCurve_Element*> ShakeElements; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// Class Solarland.CameraShakeWithCurve_Element
// Size: 0x28 (Inherited: 0x28)
struct UCameraShakeWithCurve_Element : UObject {
};

// Class Solarland.CameraShakeWithCurve_Location
// Size: 0x60 (Inherited: 0x28)
struct UCameraShakeWithCurve_Location : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat XRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat ZRange; // 0x40(0x0c)
	bool bLocalSpace; // 0x4c(0x01)
	char pad_4D[0x13]; // 0x4d(0x13)
};

// Class Solarland.CameraShakeWithCurve_Rotation
// Size: 0x58 (Inherited: 0x28)
struct UCameraShakeWithCurve_Rotation : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat PitchRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YawRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat RollRange; // 0x40(0x0c)
	char pad_4C[0xc]; // 0x4c(0x0c)
};

// Class Solarland.CameraShakeWithCurve_FOV
// Size: 0x38 (Inherited: 0x28)
struct UCameraShakeWithCurve_FOV : UCameraShakeWithCurve_Element {
	struct FRangeFloat FOVRange; // 0x28(0x08)
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Solarland.CapsuleFormationData
// Size: 0x90 (Inherited: 0x30)
struct UCapsuleFormationData : UDataAsset {
	struct TMap<char, struct FEchelonFormation> TeamFormation; // 0x30(0x50)
	struct FCruiseFormation CruiseFormation; // 0x80(0x10)

	void OverrideTeamFormation(struct TMap<char, struct FEchelonFormation>& InNewFormation); // Function Solarland.CapsuleFormationData.OverrideTeamFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2013ed0
	void ClearTeamFormationData(); // Function Solarland.CapsuleFormationData.ClearTeamFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x2013a10
	void ClearCruiseFormationData(); // Function Solarland.CapsuleFormationData.ClearCruiseFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x20139d0
	void AddTeamFormationLocation(char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddTeamFormationLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2013310
	void AddLocationToTeamFormation(struct TMap<char, struct FEchelonFormation>& InFormation, char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddLocationToTeamFormation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2013180
	void AddEchelonFormation(char InEchelon, struct FEchelonFormation& InFormation); // Function Solarland.CapsuleFormationData.AddEchelonFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2013000
	void AddCruiseFormation(struct FCruiseFormation& InFormation); // Function Solarland.CapsuleFormationData.AddCruiseFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2012f50
};

// Class Solarland.CardView
// Size: 0x228 (Inherited: 0x138)
struct UCardView : UWidget {
	struct UUserWidget* EntryWidgetClass; // 0x138(0x08)
	struct FUserWidgetPool EntryWidgetPool; // 0x140(0x80)
	float CenterScale; // 0x1c0(0x04)
	float CenterOffset; // 0x1c4(0x04)
	float PageSpacing; // 0x1c8(0x04)
	float AlignmentPercent; // 0x1cc(0x04)
	enum class EOrientation Orientation; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct TArray<struct UObject*> ListItems; // 0x1d8(0x10)
	char pad_1E8[0x10]; // 0x1e8(0x10)
	struct FMulticastInlineDelegate BP_OnItemClicked; // 0x1f8(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedItemChanged; // 0x208(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedIndexChanged; // 0x218(0x10)

	void SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.SetListItems // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x2013440
	void RemoveItem(struct UObject* InItem); // Function Solarland.CardView.RemoveItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x2013fe0
	struct TArray<struct UObject*> GetListItems(); // Function Solarland.CardView.GetListItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2013c40
	struct TArray<struct UUserWidget*> GetDisplayedEntryWidgets(); // Function Solarland.CardView.GetDisplayedEntryWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2013bb0
	void ClearListItems(); // Function Solarland.CardView.ClearListItems // (Final|Native|Protected|BlueprintCallable) // @ game+0x20139f0
	void BP_SetSelectedItem(struct UObject* Item); // Function Solarland.CardView.BP_SetSelectedItem // (Final|Native|Private|BlueprintCallable) // @ game+0x20135c0
	void BP_SetSelectedIndex(int32_t Index, bool bFromFirst); // Function Solarland.CardView.BP_SetSelectedIndex // (Final|Native|Private|BlueprintCallable) // @ game+0x20134f0
	void BP_SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.BP_SetListItems // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x2013440
	struct UObject* BP_GetSelectedItem(); // Function Solarland.CardView.BP_GetSelectedItem // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x2013410
	int32_t BP_GetSelectedIndex(); // Function Solarland.CardView.BP_GetSelectedIndex // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x20133e0
	void AddItem(struct UObject* InItem); // Function Solarland.CardView.AddItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x20130f0
};

// Class Solarland.CardViewDesignerPreviewItem
// Size: 0x28 (Inherited: 0x28)
struct UCardViewDesignerPreviewItem : UObject {
};

// Class Solarland.CGCustomeBattleRoyaleComponent
// Size: 0xd8 (Inherited: 0xd0)
struct UCGCustomeBattleRoyaleComponent : UGameModeCompBase {
	char pad_D0[0x8]; // 0xd0(0x08)

	void ChangeEnvironmentTime(struct ASolarTimeLineManager* SolarTimeLineManager, int32_t DaylightChange); // Function Solarland.CGCustomeBattleRoyaleComponent.ChangeEnvironmentTime // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.CGFormula
// Size: 0x258 (Inherited: 0x228)
struct ACGFormula : AInfo {
	struct FKnockoutParams KnockoutParams; // 0x228(0x28)
	bool bInitKnockParams; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)

	struct TArray<struct FString> MakeStringForLuaByAnyStruct(struct UObject* AnyStruct); // Function Solarland.CGFormula.MakeStringForLuaByAnyStruct // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2013d30
	bool IsSettlementBagItem(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.IsSettlementBagItem // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void InitKnockoutPointParams(struct FKnockoutParams& InParams); // Function Solarland.CGFormula.InitKnockoutPointParams // (Final|Native|Public|HasOutParms) // @ game+0x2013c70
	int32_t GetZomborg(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetZomborg // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2649560
	void GetWeeklyChallenge(struct FString InSolarPlayerID, struct TArray<struct FString>& OutChallengeName, struct TArray<int32_t>& OutChallengeValue); // Function Solarland.CGFormula.GetWeeklyChallenge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	int32_t GetWeaponExp(struct ASolarPlayerState* InPS, int32_t InWeaponID); // Function Solarland.CGFormula.GetWeaponExp // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void GetTeamScoreComparison(struct ASolarPlayerState* InPS, struct FString& OutTeamScore); // Function Solarland.CGFormula.GetTeamScoreComparison // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void GetStrategyGuideConditions(struct ASolarPlayerState* InPS, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetStrategyGuideConditions // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void GetShowPageIndexs(struct ASolarPlayerState* InPS, struct FSettlePageParam& InParam, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetShowPageIndexs // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	struct TArray<struct FSettlementReward> GetSettlementRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetSettlementRewards // (Event|Public|BlueprintEvent) // @ game+0x2649560
	struct TArray<struct FString> GetPersonalResultPlayerExData(struct FString SolarPlayerID, struct FString& InPBName); // Function Solarland.CGFormula.GetPersonalResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	float GetKDA(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetKDA // (Event|Public|BlueprintEvent) // @ game+0x2649560
	struct TArray<struct FString> GetGroupResultPlayerExData(struct FString SolarPlayerID, struct FString& InPBName); // Function Solarland.CGFormula.GetGroupResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	struct TArray<struct FSettlementParam_ExtraRewardInfo> GetExtraRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetExtraRewards // (Event|Public|BlueprintEvent) // @ game+0x2649560
	int32_t GetCombatCore(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetCombatCore // (Native|Event|Public|BlueprintEvent) // @ game+0x2013b10
	void GetCharacterExp(struct ASolarPlayerState* InPS, int32_t& OutGetExp, struct TArray<int32_t>& OutReason); // Function Solarland.CGFormula.GetCharacterExp // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	int32_t GetAccountExp(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetAccountExp // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2649560
	int32_t CalculateTeamRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateTeamRank // (Native|Event|Public|BlueprintEvent) // @ game+0x2013930
	struct TArray<enum class ESCMPlayerPunishType> CalculatePunish(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculatePunish // (Native|Event|Public|BlueprintEvent) // @ game+0x2013850
	int32_t CalculatePlayerRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculatePlayerRank // (Native|Event|Public|BlueprintEvent) // @ game+0x20137b0
	float CalculateMVPScore(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateMVPScore // (Event|Public|BlueprintEvent) // @ game+0x2649560
	int32_t CalculateKnockoutPoints(int32_t InTeamRank, int32_t InKillNum, float InTotalDamage, float InTotalDamageTaken); // Function Solarland.CGFormula.CalculateKnockoutPoints // (Final|Native|Public) // @ game+0x2013650
};

// Class Solarland.SolarGameModeAIComponent
// Size: 0x160 (Inherited: 0xd0)
struct USolarGameModeAIComponent : UGameModeCompBase {
	char pad_D0[0x10]; // 0xd0(0x10)
	struct ASolarBotAIController* BotAIControllerClass; // 0xe0(0x08)
	struct ASolarAIControllerBase* OfflinePlayerAIControllerClass; // 0xe8(0x08)
	struct ASolarGameMode* GameModeOwner; // 0xf0(0x08)
	bool bEnableIrisAIStrategy; // 0xf8(0x01)
	bool bEnableMLSetting; // 0xf9(0x01)
	bool bPreserveBotOnMatchStart; // 0xfa(0x01)
	char pad_FB[0x5]; // 0xfb(0x05)
	struct USolarBotAITeamManager* BotTeamManagerClass; // 0x100(0x08)
	struct USolarPreservedBotManager* BotPreservedManagerClass; // 0x108(0x08)
	struct USolarBotAIWarmServiceSystem* BotWarmServiceSystemClass; // 0x110(0x08)
	struct USolarBotTimelineSystem* BotTimelineSystemClass; // 0x118(0x08)
	int32_t MaxNumPreservedBots; // 0x120(0x04)
	float MaxRatioPreservedBots; // 0x124(0x04)
	char pad_128[0x10]; // 0x128(0x10)
	struct USolarBotAITeamManager* BotTeamManager; // 0x138(0x08)
	struct USolarPreservedBotManager* BotPreservedManager; // 0x140(0x08)
	struct USolarBotAIWarmServiceSystem* BotWarmServiceSystem; // 0x148(0x08)
	struct USolarBotTimelineSystem* BotTimelineSystem; // 0x150(0x08)
	bool bInitBotByTeamPreset; // 0x158(0x01)
	bool bCanBotTeamRebirth; // 0x159(0x01)
	bool bCanPlayerTeamRebirth; // 0x15a(0x01)
	bool bCanBotTeamBuyRescue; // 0x15b(0x01)
	bool bCanPlayerTeamBuyRescue; // 0x15c(0x01)
	char pad_15D[0x3]; // 0x15d(0x03)

	bool PreserveBot(struct ASolarBotAIController* InBotController, struct FVector& InPreservedLocation); // Function Solarland.SolarGameModeAIComponent.PreserveBot // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2144fc0
	bool PopPreservedBot(struct ASolarBotAIController*& OutController, struct FVector& OutTeleportLocation, struct ASolarBotAIController* InSpecificController); // Function Solarland.SolarGameModeAIComponent.PopPreservedBot // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2144dc0
	void OnAcquiredIrisAIFeedStrategy(struct TArray<struct FFeedBotStrategyInfo>& StrategyInfos); // Function Solarland.SolarGameModeAIComponent.OnAcquiredIrisAIFeedStrategy // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void GetDeathBoxExtraStuff(struct ASolarPlayerState* BotState, struct ASolarPlayerState* PlayerState, struct TMap<int32_t, int32_t>& Stuff); // Function Solarland.SolarGameModeAIComponent.GetDeathBoxExtraStuff // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x21444b0
};

// Class Solarland.CGMAIComponent
// Size: 0x160 (Inherited: 0x160)
struct UCGMAIComponent : USolarGameModeAIComponent {
};

// Class Solarland.CGMCrossLevelDataMgr
// Size: 0x78 (Inherited: 0x28)
struct UCGMCrossLevelDataMgr : UObject {
	struct TMap<struct FString, struct UObject*> CrossLevelData; // 0x28(0x50)

	void RegistryCrossLevelData(struct FString InSoltName, struct UObject* InDataObj); // Function Solarland.CGMCrossLevelDataMgr.RegistryCrossLevelData // (Final|Native|Public|BlueprintCallable) // @ game+0x2017f10
	struct UObject* GetCrossLevelData(struct FString InSoltName); // Function Solarland.CGMCrossLevelDataMgr.GetCrossLevelData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2017700
};

// Class Solarland.CustomGameModeComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCustomGameModeComponent : UGameModeCompBase {
};

// Class Solarland.CGMDataComponent
// Size: 0xe8 (Inherited: 0xd0)
struct UCGMDataComponent : UCustomGameModeComponent {
	struct AGameDataManager* DataManager; // 0xd0(0x08)
	struct UDataTable* DataTable; // 0xd8(0x08)
	float ConfigRepDeltaTime; // 0xe0(0x04)
	float ConfigRepMaxNum; // 0xe4(0x04)
};

// Class Solarland.CGMDeathComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCGMDeathComponent : UCustomGameModeComponent {

	void ReceivePlayerResurrect(struct ASolarCharacter* ResurrectCharacter, struct ASCMPlayerState* ResurrectPlayer); // Function Solarland.CGMDeathComponent.ReceivePlayerResurrect // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerKill(struct ASCMPlayerState* Killer, struct ASCMPlayerState* Killed, struct TArray<struct ASCMPlayerState*>& Assists, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerKill // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerDeathVerge(struct ASCMPlayerState* InAttacker, struct ASCMPlayerState* InDeathVergePlayer, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerDeathVerge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.GameplayConfigBase
// Size: 0x38 (Inherited: 0x30)
struct UGameplayConfigBase : UDataAsset {
	struct UGameModeGlobalSetting* GameModeSettingTemplate; // 0x30(0x08)
};

// Class Solarland.CGMGameplayConfig
// Size: 0x278 (Inherited: 0x38)
struct UCGMGameplayConfig : UGameplayConfigBase {
	struct ACGFormula* Formula; // 0x38(0x08)
	struct USettlementPageConfig* SettlePageConfig; // 0x40(0x08)
	struct TMap<struct FString, struct FSCMMapConfig> MapConfig; // 0x48(0x50)
	struct FDataManagerConfig DataManagerConfig; // 0x98(0x10)
	struct FJobManagerConfig JobConfig; // 0xa8(0x08)
	bool EnableUltimateSkill; // 0xb0(0x01)
	enum class ERoleSkillOperation UltimateSkillStateOperationOnInit; // 0xb1(0x01)
	bool EnableTacticalSkill; // 0xb2(0x01)
	enum class ERoleSkillOperation TacticalSkillStateOperationOnInit; // 0xb3(0x01)
	int32_t AirDropSkillMode; // 0xb4(0x04)
	bool EnableWeaponUpgrade; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32_t InitInGamePlayerLevel; // 0xbc(0x04)
	bool EnablePlayerUpgrade; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct FInGameLevelingConfig InGameLevelingConfig; // 0xc8(0x08)
	struct TArray<enum class ESolarTablesEnum_BattleUpgradeEffectType> CharacterDamageUpgradeTypes; // 0xd0(0x10)
	struct FExpItemConfig ExpItemConfig; // 0xe0(0x10)
	struct FExpItemReduceRate ExpItemReduceRateConfig; // 0xf0(0x08)
	struct FBoxBurstItemConfig BoxBurstItemConfig; // 0xf8(0x08)
	bool bIfShouldSpawnDeathBox; // 0x100(0x01)
	bool bIfSupportDeathverge; // 0x101(0x01)
	char pad_102[0x6]; // 0x102(0x06)
	struct TMap<int32_t, int32_t> DeathBoxEnergyLimitConfig; // 0x108(0x50)
	bool bAutoMarkDamagedEnemy; // 0x158(0x01)
	bool EnableSect; // 0x159(0x01)
	char pad_15A[0x6]; // 0x15a(0x06)
	struct FCustomRoomData CustomRoomData; // 0x160(0x78)
	bool bIsCustomRoomMode; // 0x1d8(0x01)
	bool bEnableTracking; // 0x1d9(0x01)
	char pad_1DA[0x2]; // 0x1da(0x02)
	float InitTrackingDelay; // 0x1dc(0x04)
	float TrackingTimeInterval; // 0x1e0(0x04)
	float DefaultTrackMaxRevealDistance; // 0x1e4(0x04)
	float TrackReplaceDistance; // 0x1e8(0x04)
	float MinRevealDistance; // 0x1ec(0x04)
	float TrackTimeout; // 0x1f0(0x04)
	int32_t MaxTrackNum; // 0x1f4(0x04)
	struct FFinalsBGMData FinalsBGMData; // 0x1f8(0x28)
	bool bEnableSkydivingTrail; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
	struct TSoftClassPtr<UObject> FlyTrailClass; // 0x228(0x28)
	struct TSoftClassPtr<UObject> DebugTrailEffectClass; // 0x250(0x28)

	bool IsEnableSect(); // Function Solarland.CGMGameplayConfig.IsEnableSect // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017cb0
	bool IsCustomRoomMode(); // Function Solarland.CGMGameplayConfig.IsCustomRoomMode // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xc90770
	int32_t GetRequiredExpForLevel(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetRequiredExpForLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017b70
	int32_t GetMaxShieldMatCountToDeathbox(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetMaxShieldMatCountToDeathbox // (Final|Native|Public|Const) // @ game+0x2017ad0
	int32_t GetMaxInGameLevel(); // Function Solarland.CGMGameplayConfig.GetMaxInGameLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017aa0
	float GetExpItemReduceRate(int32_t DeathCount); // Function Solarland.CGMGameplayConfig.GetExpItemReduceRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017a00
	int32_t GetExpItemCountByLevel(int32_t InLevel, int32_t InLevelGap); // Function Solarland.CGMGameplayConfig.GetExpItemCountByLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017930
	struct FCustomRoomData GetCustomRoomData(); // Function Solarland.CGMGameplayConfig.GetCustomRoomData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x20177b0
	struct TArray<int32_t> GetBurstItemSplitPiles(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemSplitPiles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017620
	struct TArray<float> GetBurstItemModelScale(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemModelScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017540
	int32_t GetBurstItemMaxPileNum(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemMaxPileNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x20174a0
	struct TArray<int32_t> GetBurstItemIDs(); // Function Solarland.CGMGameplayConfig.GetBurstItemIDs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2017420
};

// Class Solarland.CGMLogicComponent
// Size: 0x138 (Inherited: 0xd0)
struct UCGMLogicComponent : UCustomGameModeComponent {
	float TimeOutSeconds; // 0xd0(0x04)
	char pad_D4[0x64]; // 0xd4(0x64)

	void ReceiveSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceiveSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveServerLevelLoaded(struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceiveServerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2649560
	bool ReceivePlayerTeamPreJoinRequest(struct TArray<struct ASCMPlayerState*>& PreJoinPlayers, int32_t TeamID); // Function Solarland.CGMLogicComponent.ReceivePlayerTeamPreJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2017e10
	bool ReceivePlayerReJoinRequest(struct FString PlayerId, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2017cf0
	void ReceivePlayerReJoin(struct ASCMPlayerState* NewPlayer); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoin // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerPreLogin(struct FString PlayerId, struct ASCMPlayerState* OfflinePlayer, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerPreLogin // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerNonSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceivePlayerNonSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerLevelLoaded(struct ASCMPlayerController* Player, struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceivePlayerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerJoinData(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinData // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerJoinBattle(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinBattle // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerJoin(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoin // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerCancelJoin(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerCancelJoin // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceivePlayerBattleEnd(struct ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType); // Function Solarland.CGMLogicComponent.ReceivePlayerBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveOBPlayersChanged(); // Function Solarland.CGMLogicComponent.ReceiveOBPlayersChanged // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveGameModeInit(); // Function Solarland.CGMLogicComponent.ReceiveGameModeInit // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveBattleTick(float BattleTime, float DeltaTime); // Function Solarland.CGMLogicComponent.ReceiveBattleTick // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveBattleEnd(); // Function Solarland.CGMLogicComponent.ReceiveBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveBattleBegin(); // Function Solarland.CGMLogicComponent.ReceiveBattleBegin // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnStartBattle(); // Function Solarland.CGMLogicComponent.OnStartBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x2017cd0
	void OnPlayerSettled(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.OnPlayerSettled // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerReconnect(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.OnPlayerReconnect // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerOfflineTimeOut(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerOfflineTimeOut // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerGiveUp(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerGiveUp // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerDisconnect(struct ASCMPlayerState* OfflinePlayer); // Function Solarland.CGMLogicComponent.OnPlayerDisconnect // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerCheat(struct ASCMPlayerState* CheatPlayer); // Function Solarland.CGMLogicComponent.OnPlayerCheat // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnPlayerAbnormal(struct ASCMPlayerState* CheatPlayer); // Function Solarland.CGMLogicComponent.OnPlayerAbnormal // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnMatchEnd(int32_t RPCID); // Function Solarland.CGMLogicComponent.OnMatchEnd // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnDSClose(); // Function Solarland.CGMLogicComponent.OnDSClose // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnBotAIDataReady(int32_t AICount); // Function Solarland.CGMLogicComponent.OnBotAIDataReady // (Event|Public|BlueprintEvent) // @ game+0x2649560
	bool IsAllowReconnectGame(struct ASCMPlayerState* InPC); // Function Solarland.CGMLogicComponent.IsAllowReconnectGame // (Native|Event|Public|BlueprintEvent) // @ game+0x2017c10
};

// Class Solarland.SolarGameplayConfigComponent
// Size: 0xd8 (Inherited: 0xb0)
struct USolarGameplayConfigComponent : UActorComponent {
	bool EnableTestGameplayConfig; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct UGameplayConfigBase* CGMConfig; // 0xb8(0x08)
	struct UGameplayConfigBase* TestCGMConfig; // 0xc0(0x08)
	struct UGameplayConfigBase* InstGameplayConfig; // 0xc8(0x08)
	struct UGameplayConfigBase* InstTestGameplayConfig; // 0xd0(0x08)

	struct UGameplayConfigBase* GetConfigs(); // Function Solarland.SolarGameplayConfigComponent.GetConfigs // (Native|Public|BlueprintCallable) // @ game+0x214fd30
};

// Class Solarland.CGMManagerConfigComponent
// Size: 0xd8 (Inherited: 0xd8)
struct UCGMManagerConfigComponent : USolarGameplayConfigComponent {
};

// Class Solarland.CGMMapInfo
// Size: 0x180 (Inherited: 0xd0)
struct UCGMMapInfo : UGameModeCompBase {
	struct TArray<struct FVector> AreaPosArray; // 0xd0(0x10)
	int32_t MapID; // 0xe0(0x04)
	int32_t UsedAirlineID; // 0xe4(0x04)
	struct FAirlineData UsedAirlineData; // 0xe8(0x28)
	char pad_110[0x10]; // 0x110(0x10)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0x120(0x50)
	int32_t MaskWidth; // 0x170(0x04)
	float MaskScale; // 0x174(0x04)
	int32_t MapWidth; // 0x178(0x04)
	int32_t MapHeight; // 0x17c(0x04)

	void LoadAirlineData(); // Function Solarland.CGMMapInfo.LoadAirlineData // (Final|Native|Protected|BlueprintCallable) // @ game+0x201b8d0
	void InitInfo(int32_t InMapID); // Function Solarland.CGMMapInfo.InitInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x201b840
	int32_t GetUsedAirlineData(struct FAirlineData& outData); // Function Solarland.CGMMapInfo.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x201b790
	int32_t GetMapIDByName(struct ASCustomGameState* InGameState, struct FString Name); // Function Solarland.CGMMapInfo.GetMapIDByName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b660
};

// Class Solarland.CGMSettlementComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UCGMSettlementComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct USettlementPageConfig* PageConfig; // 0xb8(0x08)
	struct TArray<int32_t> PageIndexs; // 0xc0(0x10)
	bool IsCustomRoom; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)

	bool SkipToTarget(); // Function Solarland.CGMSettlementComponent.SkipToTarget // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	bool ShowNextStage(); // Function Solarland.CGMSettlementComponent.ShowNextStage // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.ChaAT_AddSynchronizedForce
// Size: 0xe8 (Inherited: 0x80)
struct UChaAT_AddSynchronizedForce : UAbilityTask {
	char pad_80[0x68]; // 0x80(0x68)
};

// Class Solarland.ChaAT_AltitudeQuery
// Size: 0x130 (Inherited: 0x80)
struct UChaAT_AltitudeQuery : UAbilityTask {
	struct FMulticastInlineDelegate OnResponsed; // 0x80(0x10)
	char pad_90[0xa0]; // 0x90(0xa0)

	struct UChaAT_AltitudeQuery* StartSphereAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, float Radius, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartSphereAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x201c540
	struct UChaAT_AltitudeQuery* StartLineAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartLineAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x201c280
};

// Class Solarland.ChaAT_HighAlert
// Size: 0x150 (Inherited: 0x80)
struct UChaAT_HighAlert : USolarAbilityTask {
	struct FMulticastInlineDelegate OnHighAlertDelegate; // 0x80(0x10)
	char pad_90[0xc0]; // 0x90(0xc0)
};

// Class Solarland.ChaAT_LimitCameraOnStickingOutOfVehicle
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_LimitCameraOnStickingOutOfVehicle : USolarAbilityTask {
	char pad_80[0x20]; // 0x80(0x20)

	struct UChaAT_LimitCameraOnStickingOutOfVehicle* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_LimitCameraOnStickingOutOfVehicle.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201a8e0
};

// Class Solarland.ChaAT_ListenChaTakeDamage
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_ListenChaTakeDamage : UAbilityTask {
	struct FMulticastInlineDelegate OnTakeDamageDelegate; // 0x80(0x10)

	void OnCharacterTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaAT_ListenChaTakeDamage.OnCharacterTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x201b8f0
	struct UChaAT_ListenChaTakeDamage* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_ListenChaTakeDamage.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201a970
};

// Class Solarland.ChaAT_ListenScopeOpeningAction
// Size: 0x98 (Inherited: 0x80)
struct UChaAT_ListenScopeOpeningAction : USolarAbilityTask {
	struct UGameplayAbility* OwnerAbility; // 0x80(0x08)
	struct ASolarCharacter* TaskCharacter; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)

	struct UChaAT_ListenScopeOpeningAction* CreateTask(struct UGameplayAbility* OwningAbility, struct ASolarCharacter* InCharacter, float MaxWaitTime); // Function Solarland.ChaAT_ListenScopeOpeningAction.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201aa00
};

// Class Solarland.ChaAT_ListenSkydive
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_ListenSkydive : USolarAbilityTask {
	char pad_80[0x10]; // 0x80(0x10)

	void OnSkydiveStageChanged(struct ASolarCharacter* InCharacter, enum class ESkydiveStage InOldStage, enum class ESkydiveStage InNewStage); // Function Solarland.ChaAT_ListenSkydive.OnSkydiveStageChanged // (Final|Native|Private) // @ game+0x201bd20
};

// Class Solarland.ChaAT_PlayMontageAndWaitForNotify
// Size: 0x118 (Inherited: 0x108)
struct UChaAT_PlayMontageAndWaitForNotify : UAbilityTask_PlayMontageAndWait {
	struct FMulticastInlineDelegate OnMontageNotify; // 0x108(0x10)

	void OnMontageNotifyCallBack(struct FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointPayload); // Function Solarland.ChaAT_PlayMontageAndWaitForNotify.OnMontageNotifyCallBack // (Final|Native|Private|HasOutParms) // @ game+0x201bc30
	struct UChaAT_PlayMontageAndWaitForNotify* CreateTask(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct UAnimMontage* InMontageToPlay, float InRate, struct FName InStartSection, bool bInStopWhenAbilityEnds, float InAnimRootMotionTranslationScale); // Function Solarland.ChaAT_PlayMontageAndWaitForNotify.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201ab10
};

// Class Solarland.ChaAT_PlayMontageForMeshAndWaitForEvent
// Size: 0x150 (Inherited: 0x80)
struct UChaAT_PlayMontageForMeshAndWaitForEvent : UAbilityTask {
	struct FMulticastInlineDelegate OnCompleted; // 0x80(0x10)
	struct FMulticastInlineDelegate OnBlendOut; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct FMulticastInlineDelegate EventReceived; // 0xc0(0x10)
	struct USkeletalMeshComponent* Mesh; // 0xd0(0x08)
	struct UAnimMontage* MontageToPlay; // 0xd8(0x08)
	struct FGameplayTagContainer EventTags; // 0xe0(0x20)
	float Rate; // 0x100(0x04)
	struct FName StartSection; // 0x104(0x08)
	float AnimRootMotionTranslationScale; // 0x10c(0x04)
	bool bStopWhenAbilityEnds; // 0x110(0x01)
	bool bReplicateMontage; // 0x111(0x01)
	char pad_112[0x2]; // 0x112(0x02)
	float OverrideBlendOutTimeForCancelAbility; // 0x114(0x04)
	float OverrideBlendOutTimeForStopWhenEndAbility; // 0x118(0x04)
	bool bInterruptedCalledBeforeBlendingOut; // 0x11c(0x01)
	char pad_11D[0x33]; // 0x11d(0x33)

	struct UChaAT_PlayMontageForMeshAndWaitForEvent* PlayMontageForMeshAndWaitForEvent(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct USkeletalMeshComponent* Mesh, struct UAnimMontage* MontageToPlay, float Rate, struct FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, bool bReplicateMontage, float OverrideBlendOutTimeForCancelAbility, float OverrideBlendOutTimeForStopWhenEndAbility); // Function Solarland.ChaAT_PlayMontageForMeshAndWaitForEvent.PlayMontageForMeshAndWaitForEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201bf40
};

// Class Solarland.ChaAT_SkywardDiveTask
// Size: 0xb0 (Inherited: 0x80)
struct UChaAT_SkywardDiveTask : USolarAbilityTask {
	char pad_80[0x30]; // 0x80(0x30)

	struct UChaAT_SkywardDiveTask* CreateTask(struct UGameplayAbility* OwningAbility, struct FVector InLauncherLocation, int32_t InOccupyLaunchDeviceIndex); // Function Solarland.ChaAT_SkywardDiveTask.CreateTask // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x201ad20
};

// Class Solarland.ChaAT_UpdateSkydiveTrail
// Size: 0x88 (Inherited: 0x80)
struct UChaAT_UpdateSkydiveTrail : USolarAbilityTask {
	char pad_80[0x8]; // 0x80(0x08)

	struct UChaAT_UpdateSkydiveTrail* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_UpdateSkydiveTrail.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201ae40
};

// Class Solarland.ChaAT_UpdateZipline
// Size: 0xc0 (Inherited: 0x80)
struct UChaAT_UpdateZipline : USolarAbilityTask {
	char pad_80[0x40]; // 0x80(0x40)

	struct UChaAT_UpdateZipline* CreateTask(struct UGameplayAbility* OwningAbility, struct FVector& InStartLoc, struct FVector& InEndLoc, float InSpeed, float InCheckDis); // Function Solarland.ChaAT_UpdateZipline.CreateTask // (Final|Native|Static|Public|HasOutParms|HasDefaults) // @ game+0x201aed0
};

// Class Solarland.ChaAT_WaitCharacterDeathEnd
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_WaitCharacterDeathEnd : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterDeathEnd; // 0x80(0x10)

	struct UChaAT_WaitCharacterDeathEnd* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_WaitCharacterDeathEnd.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b0a0
};

// Class Solarland.ChaAT_WaitCharacterLaunchEnd
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitCharacterLaunchEnd : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterLaunchEnd; // 0x80(0x10)
	char pad_90[0xc]; // 0x90(0x0c)
	float MoveModeCheckDelayTime; // 0x9c(0x04)

	struct UChaAT_WaitCharacterLaunchEnd* CreateTask(struct UGameplayAbility* OwningAbility, float InWaitLaunchingTime); // Function Solarland.ChaAT_WaitCharacterLaunchEnd.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b130
};

// Class Solarland.ChaAT_WaitCharacterPostDeath
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitCharacterPostDeath : USolarAbilityTask {
	struct FMulticastInlineDelegate OnDestroyCharacterCorpse; // 0x80(0x10)
	char pad_90[0x10]; // 0x90(0x10)

	struct UChaAT_WaitCharacterPostDeath* CreateTask(struct UGameplayAbility* OwningAbility, float InDestroyCorpseTime); // Function Solarland.ChaAT_WaitCharacterPostDeath.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b200
};

// Class Solarland.ChaAT_WaitCharacterSprintCancel
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_WaitCharacterSprintCancel : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterSprintCancel; // 0x80(0x10)

	struct UChaAT_WaitCharacterSprintCancel* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_WaitCharacterSprintCancel.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b2d0
};

// Class Solarland.ChaAT_WaitControlRotationYawOutOfRange
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitControlRotationYawOutOfRange : UAbilityTask {
	char pad_80[0x20]; // 0x80(0x20)

	struct UChaAT_WaitControlRotationYawOutOfRange* CreateTask(struct UGameplayAbility* OwningAbility, float YawMin, float YawMax); // Function Solarland.ChaAT_WaitControlRotationYawOutOfRange.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201b360
};

// Class Solarland.ChaAT_WaitDelay
// Size: 0x98 (Inherited: 0x80)
struct UChaAT_WaitDelay : UAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	char pad_90[0x8]; // 0x90(0x08)

	struct UChaAT_WaitDelay* WaitDelay(struct UGameplayAbility* OwningAbility, float Time); // Function Solarland.ChaAT_WaitDelay.WaitDelay // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201c840
};

// Class Solarland.ChaAT_WaitLandingSpot
// Size: 0xc0 (Inherited: 0x80)
struct UChaAT_WaitLandingSpot : UAbilityTask {
	char pad_80[0x40]; // 0x80(0x40)
};

// Class Solarland.ChaAT_WaitOverlapEx
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitOverlapEx : UAbilityTask {
	struct FMulticastInlineDelegate OnOverLap; // 0x80(0x10)
	char pad_90[0x10]; // 0x90(0x10)

	struct UChaAT_WaitOverlapEx* WaitForOverlap(struct UGameplayAbility* OwningAbility, struct TArray<struct AActor*> InIgnoreClasses); // Function Solarland.ChaAT_WaitOverlapEx.WaitForOverlap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x201c910
	void OnHitCallback(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Solarland.ChaAT_WaitOverlapEx.OnHitCallback // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x201ba50
};

// Class Solarland.ChaAT_WaitVehicleWeakPointRepairingEnd
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitVehicleWeakPointRepairingEnd : USolarAbilityTask {
	char pad_80[0x8]; // 0x80(0x08)
	struct FMulticastInlineDelegate OnVehicleWeakPointRepairingEnd; // 0x88(0x10)
	char pad_98[0x8]; // 0x98(0x08)

	struct UChaAT_WaitVehicleWeakPointRepairingEnd* CreateTask(struct UGameplayAbility* OwningAbility, struct FVehicleWeakPointSpec& RepairingVehicleWeakPoint); // Function Solarland.ChaAT_WaitVehicleWeakPointRepairingEnd.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x201b460
};

// Class Solarland.SolarGameplayAbility
// Size: 0x418 (Inherited: 0x400)
struct USolarGameplayAbility : UGameplayAbility {
	bool bTryActivateWhenGranted; // 0x400(0x01)
	enum class ESolarGAInputID InputID; // 0x401(0x01)
	bool bAllowReconnection; // 0x402(0x01)
	bool bActiveOnPress; // 0x403(0x01)
	char pad_404[0x4]; // 0x404(0x04)
	struct TArray<struct FAbilityMeshMontage> CurrentAbilityMeshMontages; // 0x408(0x10)

	void RemoveGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.RemoveGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2151720
	void ReceivingGiven(struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpec& Spec); // Function Solarland.SolarGameplayAbility.ReceivingGiven // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2649560
	bool OnLevelUp(int32_t OldLevel, struct FGameplayAbilitySpec& Spec); // Function Solarland.SolarGameplayAbility.OnLevelUp // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2151460
	void MontageStopForMesh(struct USkeletalMeshComponent* InMesh, float OverrideBlendOutTime); // Function Solarland.SolarGameplayAbility.MontageStopForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x2151390
	void MontageStopForAllMeshes(float OverrideBlendOutTime); // Function Solarland.SolarGameplayAbility.MontageStopForAllMeshes // (Final|Native|Protected|BlueprintCallable) // @ game+0x2151310
	void MontageSetNextSectionNameForMesh(struct USkeletalMeshComponent* InMesh, struct FName FromSectionName, struct FName ToSectionName); // Function Solarland.SolarGameplayAbility.MontageSetNextSectionNameForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x2151200
	void MontageJumpToSectionForMesh(struct USkeletalMeshComponent* InMesh, struct FName SectionName); // Function Solarland.SolarGameplayAbility.MontageJumpToSectionForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x2151130
	int32_t GetDefaultGrantedLevel(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.SolarGameplayAbility.GetDefaultGrantedLevel // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x214fe00
	struct UAnimMontage* GetCurrentMontageForMesh(struct USkeletalMeshComponent* InMesh); // Function Solarland.SolarGameplayAbility.GetCurrentMontageForMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x214fd60
	void ExecuteGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.ExecuteGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x214fae0
	void AddGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.AddGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x214f620
};

// Class Solarland.ResidentPassiveSkill
// Size: 0x438 (Inherited: 0x418)
struct UResidentPassiveSkill : USolarGameplayAbility {
	struct TArray<struct UGameplayEffect*> ResidentEffectClasses; // 0x418(0x10)
	char pad_428[0x10]; // 0x428(0x10)
};

// Class Solarland.ChaGA_AerialReconnaissance
// Size: 0x438 (Inherited: 0x438)
struct UChaGA_AerialReconnaissance : UResidentPassiveSkill {

	void OnSkydiveStageChanged(struct ASolarCharacter* InCharacter, enum class ESkydiveStage InOldStage, enum class ESkydiveStage InNewStage); // Function Solarland.ChaGA_AerialReconnaissance.OnSkydiveStageChanged // (Final|Native|Private) // @ game+0x201be30
};

// Class Solarland.SolarCharacterGameplayAbility
// Size: 0x460 (Inherited: 0x418)
struct USolarCharacterGameplayAbility : USolarGameplayAbility {
	struct FGameplayTagContainer ActivationOwnedReplicatedTags; // 0x418(0x20)
	struct TArray<struct FSolarGameplayEffectConfig> ActivationOwnedReplicatedGameplayEffects; // 0x438(0x10)
	char pad_448[0x18]; // 0x448(0x18)

	struct ASolarCharacter* GetOwningCharacterFromActorInfo(); // Function Solarland.SolarCharacterGameplayAbility.GetOwningCharacterFromActorInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2117f60
	struct ASolarCharacter* GetAvatarSolarCharacterFromActorInfo(); // Function Solarland.SolarCharacterGameplayAbility.GetAvatarSolarCharacterFromActorInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2117ef0
};

// Class Solarland.ChaGA_Aim
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Aim : USolarCharacterGameplayAbility {
	struct UGameplayEffect* AimGameplayEffectClass; // 0x460(0x08)
};

// Class Solarland.ChaGA_ThrowSkill
// Size: 0x4c0 (Inherited: 0x460)
struct UChaGA_ThrowSkill : USolarCharacterGameplayAbility {
	enum class ESkillAnimType SkillAnimType; // 0x460(0x01)
	enum class ESkillAnimRightHandType SkillAnimRightHandType; // 0x461(0x01)
	bool bShouldWaitMontageNotifyToThrow; // 0x462(0x01)
	char pad_463[0x1]; // 0x463(0x01)
	struct FName MontageNotifyToWait; // 0x464(0x08)
	bool bCanHoldWeapon; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct FName ActiveMontageNotifyToReady; // 0x470(0x08)
	bool bShouldWaitActiveMontageNotifyToPrepare; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	struct FName ActiveMontageNotifyToPrepare; // 0x47c(0x08)
	bool bShouldWaitActiveMontageNotifyToThrow; // 0x484(0x01)
	char pad_485[0x3]; // 0x485(0x03)
	struct FName ActiveMontageNotifyToThrow; // 0x488(0x08)
	struct FName MontageSectionToJumpOnInputReleased; // 0x490(0x08)
	struct UAbilityTask_NetworkSyncPoint* WaitThrowTask; // 0x498(0x08)
	struct UAnimMontage* ActiveMontage; // 0x4a0(0x08)
	struct UAnimMontage* FireMontage; // 0x4a8(0x08)
	struct UAnimMontage* CancelMontage; // 0x4b0(0x08)
	char pad_4B8[0x8]; // 0x4b8(0x08)

	void WaitToThrow(); // Function Solarland.ChaGA_ThrowSkill.WaitToThrow // (Final|Native|Protected) // @ game+0x20291b0
	void StartToThrow(); // Function Solarland.ChaGA_ThrowSkill.StartToThrow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1570c90
	void PrepareToThrow(); // Function Solarland.ChaGA_ThrowSkill.PrepareToThrow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1571070
	void OnRceiveWaitToThrow(); // Function Solarland.ChaGA_ThrowSkill.OnRceiveWaitToThrow // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_ThrowSkill.OnMontageNotify // (Native|Protected) // @ game+0x2028970
	void OnMontageCompleted(); // Function Solarland.ChaGA_ThrowSkill.OnMontageCompleted // (Native|Protected) // @ game+0x1564ae0
	void OnFireMontageStartBlendingOut(); // Function Solarland.ChaGA_ThrowSkill.OnFireMontageStartBlendingOut // (Native|Protected) // @ game+0x1564a00
	void OnActiveMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_ThrowSkill.OnActiveMontageNotify // (Native|Protected) // @ game+0x2028590
	void OnActiveMontageCompleted(); // Function Solarland.ChaGA_ThrowSkill.OnActiveMontageCompleted // (Native|Protected) // @ game+0x1564c40
};

// Class Solarland.SolarSkillGA_Projectile
// Size: 0x5f0 (Inherited: 0x4c0)
struct USolarSkillGA_Projectile : UChaGA_ThrowSkill {
	struct FSolarSkillProjectileData ProjectileData; // 0x4c0(0xd0)
	struct AGameplayAbilityTargetActor* GATargetActorClass; // 0x590(0x08)
	struct TArray<struct AActor*> SpawnActorClasses; // 0x598(0x10)
	struct UGameplayEffect* GEToSelfClass; // 0x5a8(0x08)
	struct UGameplayEffect* GEToTargetClass; // 0x5b0(0x08)
	bool bUseKeyUpLocation; // 0x5b8(0x01)
	bool bUseKeyUpDirection; // 0x5b9(0x01)
	char pad_5BA[0x6]; // 0x5ba(0x06)
	struct UAbilityTask_WaitTargetData* WaitTargetDataTask; // 0x5c0(0x08)
	struct TArray<struct AActor*> SpawnActors; // 0x5c8(0x10)
	struct TWeakObjectPtr<struct AGameplayAbilityTargetActor> TargetActorCache; // 0x5d8(0x08)
	char pad_5E0[0x10]; // 0x5e0(0x10)

	void OnWaitTargetDataTaskValid(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.SolarSkillGA_Projectile.OnWaitTargetDataTaskValid // (Native|Protected|HasOutParms) // @ game+0x22021c0
	void OnWaitTargetDataTaskCancelled(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.SolarSkillGA_Projectile.OnWaitTargetDataTaskCancelled // (Native|Protected|HasOutParms) // @ game+0x22020a0
};

// Class Solarland.SolarSkillGA_Summon
// Size: 0x620 (Inherited: 0x5f0)
struct USolarSkillGA_Summon : USolarSkillGA_Projectile {
	struct USolarSummonDetectionConfig* SummonConfig; // 0x5e8(0x08)
	int32_t SummonFailedNoticeID; // 0x5f0(0x04)
	bool bUseKeyUpLocationSummon; // 0x5f4(0x01)
	struct TWeakObjectPtr<struct ASolarSkillGATA_Summon> SummonTargetActor; // 0x5f8(0x08)
	struct UAnimMontage* ActiveMontageForGunAim; // 0x600(0x08)
	struct UAnimMontage* FireMontageForGunAim; // 0x608(0x08)
	struct UAnimMontage* CancelMontageForGunAim; // 0x610(0x08)
	char pad_61D[0x3]; // 0x61d(0x03)
};

// Class Solarland.ChaGA_AirDrop
// Size: 0x690 (Inherited: 0x620)
struct UChaGA_AirDrop : USolarSkillGA_Summon {
	struct ASolarTreasureBoxSpawner* TreasureBoxSpawnerClass; // 0x618(0x08)
	int32_t OutcomeID; // 0x620(0x04)
	struct TArray<struct FAirDropSkillDatas> AirDropSkillSetting; // 0x628(0x10)
	int32_t ChestID; // 0x638(0x04)
	int32_t BoxType; // 0x63c(0x04)
	float CastTime; // 0x640(0x04)
	float ReadyTime; // 0x644(0x04)
	struct FGameplayTag PrepareGameplayCue; // 0x648(0x08)
	struct FGameplayTag OpenAirDropMontageTag; // 0x650(0x08)
	char pad_65C[0x4]; // 0x65c(0x04)
	struct FTransform SpawnTransform; // 0x660(0x30)

	void OnWaitCompleted(); // Function Solarland.ChaGA_AirDrop.OnWaitCompleted // (Final|Native|Private) // @ game+0x20213a0
};

// Class Solarland.ChaGA_AntiexposureSuit
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_AntiexposureSuit : UResidentPassiveSkill {
	struct FGameplayTag ExecuteCueTag; // 0x438(0x08)

	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_AntiexposureSuit.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x2020f80
};

// Class Solarland.ChaGA_AttributeInit
// Size: 0x428 (Inherited: 0x418)
struct UChaGA_AttributeInit : USolarGameplayAbility {
	struct TArray<struct UGameplayEffect*> InitializationEffectClasses; // 0x418(0x10)
};

// Class Solarland.CharacterTalent
// Size: 0x420 (Inherited: 0x418)
struct UCharacterTalent : USolarGameplayAbility {
	struct UGameplayEffect* GrantedEffectClass; // 0x418(0x08)

	float GetTalentCooldownDuration(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.CharacterTalent.GetTalentCooldownDuration // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2034230
	float GetTalentActivationDuration(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.CharacterTalent.GetTalentActivationDuration // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2034160
};

// Class Solarland.PermanentTalent
// Size: 0x440 (Inherited: 0x420)
struct UPermanentTalent : UCharacterTalent {
	struct TArray<struct UGameplayEffect*> PermanentEffectClasses; // 0x420(0x10)
	char pad_430[0x10]; // 0x430(0x10)
};

// Class Solarland.PermanentTalentOnVehicle
// Size: 0x458 (Inherited: 0x440)
struct UPermanentTalentOnVehicle : UPermanentTalent {
	struct TArray<int32_t> ActivatedVehicleTypes; // 0x440(0x10)
	struct FGameplayTag GetOffVehicleEventTag; // 0x450(0x08)

	void ReceiveGetOffVehicle(struct FGameplayEventData InPayload); // Function Solarland.PermanentTalentOnVehicle.ReceiveGetOffVehicle // (Final|Native|Protected) // @ game+0x2088c80
};

// Class Solarland.ChaGA_AutoHealingOnVehicle
// Size: 0x468 (Inherited: 0x458)
struct UChaGA_AutoHealingOnVehicle : UPermanentTalentOnVehicle {
	struct UGameplayEffect* FullHealthSignEffect; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)

	void ReceiveCurrentHealthChange(); // Function Solarland.ChaGA_AutoHealingOnVehicle.ReceiveCurrentHealthChange // (Final|Native|Protected) // @ game+0x2021500
};

// Class Solarland.ChaGA_BigRechargeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_BigRechargeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag RechargeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_BigWaterGun
// Size: 0x4c0 (Inherited: 0x460)
struct UChaGA_BigWaterGun : USolarCharacterGameplayAbility {
	struct ABigWaterGun* BigWaterGunClass; // 0x460(0x08)
	struct ABigWaterGun* CacheBigWaterGun; // 0x468(0x08)
	enum class ESkillAnimType SkillAnimType; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
	struct UAnimMontage* PreAnimMontage; // 0x478(0x08)
	struct UAnimMontage* ExcuteAnimMontage; // 0x480(0x08)
	struct UAnimMontage* PostAnimMontage; // 0x488(0x08)
	struct UAnimMontage* StopAnimMontage; // 0x490(0x08)
	float LifeTime; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct UGameplayEffect* SlowDownGameplayEffect; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)
	struct UAbilityTask_NetworkSyncPoint* StopTask; // 0x4b0(0x08)
	char pad_4B8[0x8]; // 0x4b8(0x08)

	void OnStopPhase(); // Function Solarland.ChaGA_BigWaterGun.OnStopPhase // (Final|Native|Private) // @ game+0x2020f60
	void OnPrePhase(); // Function Solarland.ChaGA_BigWaterGun.OnPrePhase // (Final|Native|Private) // @ game+0x2020db0
	void OnPreMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnPreMontageCompleted // (Final|Native|Private) // @ game+0x2020360
	void OnPostPhase(); // Function Solarland.ChaGA_BigWaterGun.OnPostPhase // (Final|Native|Private) // @ game+0x2020d90
	void OnPostMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnPostMontageCompleted // (Final|Native|Private) // @ game+0x2020d70
	void OnExecutePhase(); // Function Solarland.ChaGA_BigWaterGun.OnExecutePhase // (Final|Native|Private) // @ game+0x2020360
	void OnExecuteMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnExecuteMontageCompleted // (Final|Native|Private) // @ game+0x2020340
};

// Class Solarland.ChaGA_Bolt
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Bolt : USolarCharacterGameplayAbility {
	struct FGameplayTag BoltMontageTag; // 0x460(0x08)
};

// Class Solarland.ChaGA_CancelSprint
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_CancelSprint : USolarCharacterGameplayAbility {
	struct UGameplayEffect* CancelSprintEffectClass; // 0x460(0x08)
};

// Class Solarland.ChaGA_ChangeCurrentCDRemain
// Size: 0x460 (Inherited: 0x418)
struct UChaGA_ChangeCurrentCDRemain : USolarGameplayAbility {
	struct FGameplayTagContainer AbilityQueryTags; // 0x418(0x20)
	enum class EGameplayModOp RemainTimeModifierOption; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct FScalableFloat RemainTimeModifierValue; // 0x440(0x20)
};

// Class Solarland.ChaGA_ChangeTotalCD_WithDuration
// Size: 0x450 (Inherited: 0x418)
struct UChaGA_ChangeTotalCD_WithDuration : USolarGameplayAbility {
	struct FGameplayTagContainer AbilityQueryTags; // 0x418(0x20)
	struct UGameplayEffect* CDModifierEffect; // 0x438(0x08)
	bool bUsedForNextActivation; // 0x440(0x01)
	enum class EActiveEffectDurationChangeProxy ActiveEffectDurationChangeProxy; // 0x441(0x01)
	char pad_442[0xe]; // 0x442(0x0e)

	void OnModifierFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_ChangeTotalCD_WithDuration.OnModifierFinished // (Final|Native|Protected|HasOutParms) // @ game+0x20200e0
	void ModifierAppliedFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_ChangeTotalCD_WithDuration.ModifierAppliedFailed // (Final|Native|Protected|HasOutParms) // @ game+0x20200e0
};

// Class Solarland.ChaGA_ChangeTotalCD_WithTimes
// Size: 0x458 (Inherited: 0x450)
struct UChaGA_ChangeTotalCD_WithTimes : UChaGA_ChangeTotalCD_WithDuration {
	int32_t CDTimes; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)

	void OnCooldownCompleted(); // Function Solarland.ChaGA_ChangeTotalCD_WithTimes.OnCooldownCompleted // (Final|Native|Protected) // @ game+0x2020300
};

// Class Solarland.ChaGA_CombatRegeneration
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_CombatRegeneration : USolarCharacterGameplayAbility {
	float ForecastInterval; // 0x460(0x04)
	float RegenerateInterval; // 0x464(0x04)
	struct FGameplayTag RegenerateCueTag; // 0x468(0x08)
	char pad_470[0x28]; // 0x470(0x28)

	void PreRegenerate(); // Function Solarland.ChaGA_CombatRegeneration.PreRegenerate // (Final|Native|Protected) // @ game+0x20214e0
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HealtDamage); // Function Solarland.ChaGA_CombatRegeneration.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x20210e0
	void OnRegenerate(); // Function Solarland.ChaGA_CombatRegeneration.OnRegenerate // (Final|Native|Protected) // @ game+0x2020dd0
};

// Class Solarland.ChaGA_Crouch
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Crouch : USolarCharacterGameplayAbility {
	char pad_460[0x8]; // 0x460(0x08)

	bool ShouldCancelCrouch(); // Function Solarland.ChaGA_Crouch.ShouldCancelCrouch // (Final|Native|Private) // @ game+0x2021520
};

// Class Solarland.ChaGA_Cruise
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_Cruise : USolarCharacterGameplayAbility {
	struct UGameplayEffect* ParachuteZoneEnteredEffect; // 0x460(0x08)
	struct FName ParachuteActionName; // 0x468(0x08)
	struct UAbilityTask_WaitInputAction* WaitParachuteInputTask; // 0x470(0x08)
	struct UAbilityTask_NetworkSyncPoint* WaitToParachuteTask; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void OnRequestedToParachute(); // Function Solarland.ChaGA_Cruise.OnRequestedToParachute // (Final|Native|Private) // @ game+0x2020df0
	void OnParachuteRequestSynced(); // Function Solarland.ChaGA_Cruise.OnParachuteRequestSynced // (Final|Native|Private) // @ game+0x2020d50
	void OnParachuteRequestRejected(); // Function Solarland.ChaGA_Cruise.OnParachuteRequestRejected // (Final|Native|Private) // @ game+0x2020d30
	void OnIntoParachuteZone(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnIntoParachuteZone // (Final|Native|Private) // @ game+0x2020a20
	void OnForceParachuteEvent(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnForceParachuteEvent // (Final|Native|Private) // @ game+0x2020580
	void OnFinishCruise(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnFinishCruise // (Final|Native|Private) // @ game+0x2020380
};

// Class Solarland.ChaGA_Dance
// Size: 0x4b0 (Inherited: 0x460)
struct UChaGA_Dance : USolarCharacterGameplayAbility {
	struct UGameplayEffect* LeadingDanceEffect; // 0x460(0x08)
	struct TArray<struct FName> CancelActionNames; // 0x468(0x10)
	char pad_478[0x38]; // 0x478(0x38)

	void OnRoleAbilityInputAction(int32_t AbilityIndex, bool bPress, bool bCanActive); // Function Solarland.ChaGA_Dance.OnRoleAbilityInputAction // (Final|Native|Private) // @ game+0x2020e10
	void OnMoveModeChanged(enum class EMovementMode NewMovementMode); // Function Solarland.ChaGA_Dance.OnMoveModeChanged // (Final|Native|Private) // @ game+0x2020c00
	void OnMontageCompleted(); // Function Solarland.ChaGA_Dance.OnMontageCompleted // (Final|Native|Private) // @ game+0x2020c80
	void OnMontageBlendOut(); // Function Solarland.ChaGA_Dance.OnMontageBlendOut // (Final|Native|Private) // @ game+0x2020c80
	void OnMobileWeaponInputAction(enum class EInputButton InButtonType); // Function Solarland.ChaGA_Dance.OnMobileWeaponInputAction // (Final|Native|Private) // @ game+0x2020c00
	void OnHandleNotifyState(struct USolarAnimInstance* AnimInstance, struct USolarAnimNotifyState* Notify, int32_t& OutDenial); // Function Solarland.ChaGA_Dance.OnHandleNotifyState // (Final|Native|Private|HasOutParms) // @ game+0x2020880
	void OnHandleNotify(struct USolarAnimInstance* AnimInstance, struct USolarAnimNotify* Notify, int32_t& OutDenial); // Function Solarland.ChaGA_Dance.OnHandleNotify // (Final|Native|Private|HasOutParms) // @ game+0x2020760
	void OnCancelInput(); // Function Solarland.ChaGA_Dance.OnCancelInput // (Final|Native|Private) // @ game+0x20202e0
};

// Class Solarland.ChaGA_Death
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Death : USolarCharacterGameplayAbility {
	float DestroyCorpseTime; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct UGameplayEffect* RemoveDebuffEffectClass; // 0x468(0x08)

	void DestroyCharacterCorpse(struct ASolarCharacter* Character); // Function Solarland.ChaGA_Death.DestroyCharacterCorpse // (Final|Native|Protected) // @ game+0x2020030
	void DeathEnd(struct ASolarCharacter* Character); // Function Solarland.ChaGA_Death.DeathEnd // (Final|Native|Protected) // @ game+0x201ffa0
};

// Class Solarland.ChaGA_DeathVerge
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_DeathVerge : USolarCharacterGameplayAbility {
	struct TArray<struct UGameplayEffect*> DeathVergeHPEffects; // 0x460(0x10)
	char pad_470[0x10]; // 0x470(0x10)
	struct FGameplayTag DeathVergeMaxHPDataTag; // 0x480(0x08)
	float TimeToWait; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)

	void OnWaitDelayFinished(); // Function Solarland.ChaGA_DeathVerge.OnWaitDelayFinished // (Final|Native|Protected) // @ game+0x8f2720
};

// Class Solarland.ChaGA_DuckRolling
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_DuckRolling : USolarCharacterGameplayAbility {
	enum class ESkillAnimType SkillAnimType; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UDuckRollingConfigDataAsset* ConfigDataAsset; // 0x468(0x08)
	struct UGameplayEffect* SwitchToRollingMeshEffect; // 0x470(0x08)
	struct UAnimMontage* Montage; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
	struct UAbilityTask_WaitDelay* WaitRollingMeshTask; // 0x488(0x08)

	void SyncToSwitchToRollingMesh(); // Function Solarland.ChaGA_DuckRolling.SyncToSwitchToRollingMesh // (Final|Native|Protected) // @ game+0x2021570
	void SwitchToRollingMesh(); // Function Solarland.ChaGA_DuckRolling.SwitchToRollingMesh // (Final|Native|Protected) // @ game+0x2021550
	void OnRollingEnd(); // Function Solarland.ChaGA_DuckRolling.OnRollingEnd // (Final|Native|Protected) // @ game+0x2020f40
	void OnRollingCanceled(); // Function Solarland.ChaGA_DuckRolling.OnRollingCanceled // (Final|Native|Protected) // @ game+0x2020f20
};

// Class Solarland.ChaGA_EnergyBubble
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_EnergyBubble : USolarCharacterGameplayAbility {
	struct ASolarEnergyBubble* EnergyShieldClass; // 0x460(0x08)
	struct AGameplayAbilityTargetActor* GATargetActorClass; // 0x468(0x08)
	struct UAnimMontage* EmptyMontage; // 0x470(0x08)
	struct UAnimMontage* AimMontage; // 0x478(0x08)
	struct FName StartSocketName; // 0x480(0x08)
	struct FName StartEnergyBubbleNotify; // 0x488(0x08)
	struct FName ReleaseEnergyBubbleNotify; // 0x490(0x08)
	struct ASolarEnergyBubble* EnergyShieldActor; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	struct UAbilityTask_WaitTargetData* WaitTargetDataTask; // 0x4a8(0x08)
	struct TWeakObjectPtr<struct AGameplayAbilityTargetActor> TargetActorCache; // 0x4b0(0x08)

	void OnWaitTargetDataTaskValid(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.ChaGA_EnergyBubble.OnWaitTargetDataTaskValid // (Final|Native|Private|HasOutParms) // @ game+0x20213c0
	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_EnergyBubble.OnMontageNotify // (Final|Native|Protected) // @ game+0x2020ca0
};

// Class Solarland.ChaGA_Equip
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Equip : USolarCharacterGameplayAbility {
	struct FGameplayTag EquipMontageTag; // 0x460(0x08)
};

// Class Solarland.SideResidentPassiveSkill
// Size: 0x438 (Inherited: 0x418)
struct USideResidentPassiveSkill : USolarGameplayAbility {
	struct UGameplayEffect* SignEffectClass; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)

	bool OnSidePassiveSkillEnded(struct FSideAttributeSet& InSideAttributeSet, struct ASCMPlayerState* CurrentPlayer, bool bWasCancelled); // Function Solarland.SideResidentPassiveSkill.OnSidePassiveSkillEnded // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x20ba4d0
	bool OnSidePassiveSkillActivated(struct FSideAttributeSet& InSideAttributeSet, struct ASCMPlayerState* CurrentPlayer); // Function Solarland.SideResidentPassiveSkill.OnSidePassiveSkillActivated // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x20ba340
	void OnSideLeaving(struct FGameplayEventData Payload); // Function Solarland.SideResidentPassiveSkill.OnSideLeaving // (Final|Native|Protected) // @ game+0x20ba160
	void OnSideJoining(struct FGameplayEventData Payload); // Function Solarland.SideResidentPassiveSkill.OnSideJoining // (Final|Native|Protected) // @ game+0x20b9f80
	void OnCharacterBeforeChange(); // Function Solarland.SideResidentPassiveSkill.OnCharacterBeforeChange // (Final|Native|Protected) // @ game+0x20b9f60
};

// Class Solarland.ChaGA_FastTreatment
// Size: 0x448 (Inherited: 0x438)
struct UChaGA_FastTreatment : USideResidentPassiveSkill {
	float ModifierTreatmentValue; // 0x438(0x04)
	float ModifierShieldValue; // 0x43c(0x04)
	float ModifierBigShieldValue; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Solarland.ChaGA_Fire
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Fire : USolarCharacterGameplayAbility {
	struct ASolarCharacter* ActCharacter; // 0x460(0x08)
	char pad_468[0x5]; // 0x468(0x05)
	bool bPrintDebugString; // 0x46d(0x01)
	char pad_46E[0x2]; // 0x46e(0x02)

	void OnFireTaskEnd(); // Function Solarland.ChaGA_Fire.OnFireTaskEnd // (Final|Native|Public) // @ game+0x2020560
	void OnCtrlTaskEnd(); // Function Solarland.ChaGA_Fire.OnCtrlTaskEnd // (Final|Native|Public) // @ game+0x2020320
	void DoFireTask(); // Function Solarland.ChaGA_Fire.DoFireTask // (Final|Native|Public) // @ game+0x20200c0
};

// Class Solarland.ChaGA_GetOffVehicle
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_GetOffVehicle : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_GetOnVehicle
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_GetOnVehicle : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_HighAlert
// Size: 0x4a8 (Inherited: 0x438)
struct UChaGA_HighAlert : UResidentPassiveSkill {
	bool bShowDebug; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float HighAlertAngle; // 0x43c(0x04)
	float HighAlertRadiusMin; // 0x440(0x04)
	float HighAlertRadiusMax; // 0x444(0x04)
	struct FVector2D HighAlertBoxExtent; // 0x448(0x08)
	struct TMap<enum class EAlertDirection, float> AlertCD; // 0x450(0x50)
	struct FGameplayCueTag CueTag; // 0x4a0(0x08)

	void OnHighAlert(enum class EAlertDirection Direction); // Function Solarland.ChaGA_HighAlert.OnHighAlert // (Final|Native|Private) // @ game+0x20209a0
};

// Class Solarland.ChaGA_HitRecover
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_HitRecover : USolarCharacterGameplayAbility {
	float Duration; // 0x460(0x04)
	float KnockbackDuration; // 0x464(0x04)
	struct TMap<enum class EHitRecoverType, float> HitbackDistance; // 0x468(0x50)

	void OnBlock(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.ChaGA_HitRecover.OnBlock // (Final|Native|Public|HasOutParms) // @ game+0x20201c0
};

// Class Solarland.ChaGA_HitShield
// Size: 0x4c8 (Inherited: 0x438)
struct UChaGA_HitShield : UResidentPassiveSkill {
	struct ASolarEnergyShield* HitShieldClass; // 0x438(0x08)
	float DistanceToCharacter; // 0x440(0x04)
	float CoolDown; // 0x444(0x04)
	float MaxAngleinZ; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct FGameplayTagContainer BlockShieldSpawnTags; // 0x450(0x20)
	struct TSet<enum class ESCMDamageType> TriggerDamageTypes; // 0x470(0x50)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void SpawnHitShield(struct FVector Direction); // Function Solarland.ChaGA_HitShield.SpawnHitShield // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x2649560
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_HitShield.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x2021240
};

// Class Solarland.ChaGA_Hoarder
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_Hoarder : USideResidentPassiveSkill {
	float ModifierValue; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class Solarland.ChaGA_HomeVault
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_HomeVault : USolarCharacterGameplayAbility {
	struct FGameplayTag ClimbWaterMontageTag; // 0x460(0x08)
	struct FGameplayTag VaultCrossMontageTag; // 0x468(0x08)
	char pad_470[0x20]; // 0x470(0x20)

	void OnMontageCompleted(); // Function Solarland.ChaGA_HomeVault.OnMontageCompleted // (Final|Native|Protected) // @ game+0x2020c80
};

// Class Solarland.ChaGA_InitializationFromGameMode
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_InitializationFromGameMode : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VJetCDOverrideEffect; // 0x460(0x08)
	struct UGameplayEffect* HJetCDOverrideEffect; // 0x468(0x08)
	struct FGameplayTag SettingOverrideTag; // 0x470(0x08)
};

// Class Solarland.ChaGA_Invincible
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Invincible : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_JetFlyAction
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_JetFlyAction : USolarCharacterGameplayAbility {
	bool bVerticalFly; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UGameplayEffect* BoostEffect; // 0x468(0x08)
};

// Class Solarland.ChaGA_JetFlyCharge
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_JetFlyCharge : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VerticalChargeEffect; // 0x460(0x08)
	struct UGameplayEffect* TempVerticalChargeEffect; // 0x468(0x08)
	struct UGameplayEffect* OnceVChargeCompletedEffect; // 0x470(0x08)
	struct UGameplayEffect* HorizontalChargeEffect; // 0x478(0x08)
	struct UGameplayEffect* TempHorizontalChargeEffect; // 0x480(0x08)
	struct UGameplayEffect* OnceHChargeCompletedEffect; // 0x488(0x08)
	struct FGameplayTag TempChargeDurationTag; // 0x490(0x08)
	struct UAbilityTask_WaitGameplayEffectRemoved* OnOnceVJetChargeFinished; // 0x498(0x08)
	struct UAbilityTask_WaitGameplayEffectRemoved* OnOnceHJetChargeFinished; // 0x4a0(0x08)
	char pad_4A8[0x10]; // 0x4a8(0x10)

	void StartVerticalJetChargeFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.StartVerticalJetChargeFailed // (Final|Native|Protected|HasOutParms) // @ game+0x2025b40
	void StartHorizontalJetChargeFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.StartHorizontalJetChargeFailed // (Final|Native|Protected|HasOutParms) // @ game+0x2025a40
	void ReceiveVerticalJetTimesChanged(); // Function Solarland.ChaGA_JetFlyCharge.ReceiveVerticalJetTimesChanged // (Final|Native|Protected) // @ game+0x20259f0
	void ReceiveVerticalChargeCDChanged(float OldCD); // Function Solarland.ChaGA_JetFlyCharge.ReceiveVerticalChargeCDChanged // (Final|Native|Protected) // @ game+0x2025970
	void ReceiveHorizontalJetTimesChanged(); // Function Solarland.ChaGA_JetFlyCharge.ReceiveHorizontalJetTimesChanged // (Final|Native|Protected) // @ game+0x2025950
	void ReceiveHorizontalChargeCDChanged(float OldCD); // Function Solarland.ChaGA_JetFlyCharge.ReceiveHorizontalChargeCDChanged // (Final|Native|Protected) // @ game+0x20258d0
	void OnceVerticalJetChargeFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.OnceVerticalJetChargeFinished // (Final|Native|Protected|HasOutParms) // @ game+0x20257d0
	void OnceHorizontalJetChargeFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.OnceHorizontalJetChargeFinished // (Final|Native|Protected|HasOutParms) // @ game+0x20256f0
};

// Class Solarland.ChaGA_JetSlowFalling
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_JetSlowFalling : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_Jump
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Jump : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_LaunchAction
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_LaunchAction : USolarCharacterGameplayAbility {
	float WaitingLaunchingTime; // 0x460(0x04)
	struct FGameplayTag LaunchCueTag; // 0x464(0x08)
	char pad_46C[0x4]; // 0x46c(0x04)

	void EndLaunch(); // Function Solarland.ChaGA_LaunchAction.EndLaunch // (Final|Native|Protected) // @ game+0x2020c80
};

// Class Solarland.ChaGA_LostConnection
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_LostConnection : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_LowHPShieldRecAcc
// Size: 0x458 (Inherited: 0x420)
struct UChaGA_LowHPShieldRecAcc : UCharacterTalent {
	struct UGameplayEffect* AccelerationEffectClass; // 0x420(0x08)
	struct FScalableFloat LowHPThreshold; // 0x428(0x20)
	char pad_448[0x10]; // 0x448(0x10)

	void CheckHPThreshold(); // Function Solarland.ChaGA_LowHPShieldRecAcc.CheckHPThreshold // (Final|Native|Protected) // @ game+0x20247c0
};

// Class Solarland.ChaGA_LowHPSpeedup
// Size: 0x458 (Inherited: 0x420)
struct UChaGA_LowHPSpeedup : UCharacterTalent {
	struct UGameplayEffect* SpeedupEffectClass; // 0x420(0x08)
	struct FScalableFloat LowHPThreshold; // 0x428(0x20)
	char pad_448[0x10]; // 0x448(0x10)

	void OnSpeedUpFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.OnSpeedUpFinished // (Final|Native|Protected|HasOutParms) // @ game+0x2025400
	void OnCoolingDownFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.OnCoolingDownFinished // (Final|Native|Protected|HasOutParms) // @ game+0x2024de0
	void EffectAppliedFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.EffectAppliedFailed // (Final|Native|Protected|HasOutParms) // @ game+0x2024840
	void CheckHPThreshold(); // Function Solarland.ChaGA_LowHPSpeedup.CheckHPThreshold // (Final|Native|Protected) // @ game+0x20247e0
};

// Class Solarland.ChaGA_MassInvisibility
// Size: 0x4a8 (Inherited: 0x460)
struct UChaGA_MassInvisibility : USolarCharacterGameplayAbility {
	struct UAnimMontage* SkillMontage; // 0x460(0x08)
	struct UAnimMontage* SkillMontageWithWeapon; // 0x468(0x08)
	struct FName StartSkillMontageNotify; // 0x470(0x08)
	struct FGameplayTag MassInvisibilityRangeCueTag; // 0x478(0x08)
	struct UGameplayAbility* MassInvisibilityTargetAbilityClass; // 0x480(0x08)
	float MassInvisibilityRangeRadius; // 0x488(0x04)
	float MassInvisibilityRangeHalfHeight; // 0x48c(0x04)
	struct FGameplayTag OrnamentTag; // 0x490(0x08)
	struct UAnimMontage* OrnamentMontage; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_MassInvisibility.OnMontageNotify // (Final|Native|Protected) // @ game+0x2025110
};

// Class Solarland.ChaGA_MassInvisibilityTarget
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_MassInvisibilityTarget : USolarCharacterGameplayAbility {
	struct FGameplayCueTag MassInvisibilityCueTag; // 0x460(0x08)
	struct UGameplayEffect* MassInvisibilityBuffEffectClass; // 0x468(0x08)
	struct UGameplayEffect* MassInvisibilityPrepareEffectClass; // 0x470(0x08)
	struct UGameplayEffect* MassInvisibilityEffectClass; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void OnMassInvisibilityPrepareEffectRemoved(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_MassInvisibilityTarget.OnMassInvisibilityPrepareEffectRemoved // (Final|Native|Private|HasOutParms) // @ game+0x2025030
	void OnMassInvisibilityEffectRemoved(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_MassInvisibilityTarget.OnMassInvisibilityEffectRemoved // (Final|Native|Private|HasOutParms) // @ game+0x2024f50
};

// Class Solarland.ChaGA_Melee
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_Melee : USolarCharacterGameplayAbility {
	struct TArray<struct FGameplayTag> CrouchMeleeMontageTags; // 0x460(0x10)
	struct TArray<struct FGameplayTag> StandMeleeMontageTags; // 0x470(0x10)
	float MotionWarpingAngleTolerance; // 0x480(0x04)
	char pad_484[0xc]; // 0x484(0x0c)

	void OnStopMelee(struct UGameplayAbility* InActivatedAbility); // Function Solarland.ChaGA_Melee.OnStopMelee // (Final|Native|Public) // @ game+0x20254e0
	void GetYawToleranceMinMax(struct FRotator& CurrentControlRotation, struct FRotator& TargetRotation, float& YawMin, float& YawMax); // Function Solarland.ChaGA_Melee.GetYawToleranceMinMax // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2024920
};

// Class Solarland.ChaGA_MissileSwarm
// Size: 0x7f0 (Inherited: 0x5f0)
struct UChaGA_MissileSwarm : USolarSkillGA_Projectile {
	struct FMissileSwarmSkillConfig SkillConfig; // 0x5e8(0x1d8)
	struct TArray<struct FMissileSwarmSpawnParameter> MissileSwarmSpawnConfig; // 0x7c0(0x10)
	struct UStaticMesh* PreviewMeshTemplate; // 0x7d0(0x08)
	struct UMaterialInterface* PreviewMaterial; // 0x7d8(0x08)
	char pad_7E8[0x8]; // 0x7e8(0x08)
};

// Class Solarland.ChaGA_MultiRecoverShield
// Size: 0x480 (Inherited: 0x460)
struct UChaGA_MultiRecoverShield : USolarCharacterGameplayAbility {
	struct UGameplayEffect* ActivationEffect; // 0x460(0x08)
	struct UGameplayEffect* CustomCoolDownEffect; // 0x468(0x08)
	char pad_470[0x10]; // 0x470(0x10)

	void OnCoolDownEffectStart(); // Function Solarland.ChaGA_MultiRecoverShield.OnCoolDownEffectStart // (Final|Native|Protected) // @ game+0x2024dc0
	void OnCoolDownEffectFinish(); // Function Solarland.ChaGA_MultiRecoverShield.OnCoolDownEffectFinish // (Final|Native|Protected) // @ game+0x2024da0
	void OnActivationEffect(struct FGameplayEventData Payload); // Function Solarland.ChaGA_MultiRecoverShield.OnActivationEffect // (Final|Native|Protected) // @ game+0x2024ac0
};

// Class Solarland.ChaGA_NightComes
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_NightComes : USolarCharacterGameplayAbility {
	struct UGameplayEffect* NightComesBuffGameplayEffect; // 0x460(0x08)
	struct ASolarNightComesActor* NightComesActorClass; // 0x468(0x08)
	struct UAnimMontage* SkillMontage; // 0x470(0x08)
	struct UAnimMontage* SkillMontageWithWeapon; // 0x478(0x08)
	struct FName StartSkillMontageNotify; // 0x480(0x08)
	struct FVector SpawnOffset; // 0x488(0x0c)
	char pad_494[0x4]; // 0x494(0x04)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_NightComes.OnMontageNotify // (Final|Native|Protected) // @ game+0x20251a0
};

// Class Solarland.ChaGA_OpenNewTreasureBox
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_OpenNewTreasureBox : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_OpenScope
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_OpenScope : USolarCharacterGameplayAbility {
	struct FGameplayTagRequirements OngoingTagRequirements; // 0x460(0x50)
	float MaxEnteringScopeOpeningTime; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)

	void OnOngoingTagRequirementsMetStatusChange(bool bMet); // Function Solarland.ChaGA_OpenScope.OnOngoingTagRequirementsMetStatusChange // (Final|Native|Private) // @ game+0x2025330
};

// Class Solarland.ChaGA_OpenTreasureBox
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_OpenTreasureBox : USolarCharacterGameplayAbility {
	struct FGameplayTag OpenTreasureBoxMontageTag; // 0x460(0x08)
};

// Class Solarland.ChaGA_ParkourMaster
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_ParkourMaster : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VertEffect; // 0x460(0x08)
	struct UGameplayEffect* HoriEffect; // 0x468(0x08)
	char pad_470[0x20]; // 0x470(0x20)

	void OnJetFlyActivated(struct UGameplayAbility* InActivatedAbility); // Function Solarland.ChaGA_ParkourMaster.OnJetFlyActivated // (Final|Native|Protected) // @ game+0x2024ec0
};

// Class Solarland.ChaGA_PickUp
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_PickUp : USolarCharacterGameplayAbility {
	struct FGameplayTag PickUpHighEmptyMontageTag; // 0x460(0x08)
	struct FGameplayTag PickUpLowEmptyMontageTag; // 0x468(0x08)
	struct FGameplayTag PickUpHighGunAimMontageTag; // 0x470(0x08)
	struct FGameplayTag PickUpLowGunAimMontageTag; // 0x478(0x08)
	char pad_480[0x10]; // 0x480(0x10)

	void OnWeaponSlotReplace(int32_t InWeaponSlotID, struct ASolarPlayerWeapon* InWeapon); // Function Solarland.ChaGA_PickUp.OnWeaponSlotReplace // (Final|Native|Private) // @ game+0x2025620
	void OnMontageCompleted(); // Function Solarland.ChaGA_PickUp.OnMontageCompleted // (Final|Native|Private) // @ game+0x2020c80
};

// Class Solarland.ChaGA_RadarScanning
// Size: 0x4a8 (Inherited: 0x460)
struct UChaGA_RadarScanning : USolarCharacterGameplayAbility {
	float SpawnRadarDelayTime; // 0x460(0x04)
	float LifeTime; // 0x464(0x04)
	float LifeTimeNoResult; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct ASolarRadarBase* RadarClass; // 0x470(0x08)
	int32_t SpawnRadarEventID; // 0x478(0x04)
	float EffectRadius; // 0x47c(0x04)
	struct FGameplayTag CueTag; // 0x480(0x08)
	struct ASolarRadarBase* SpawnedRadar; // 0x488(0x08)
	char pad_490[0x18]; // 0x490(0x18)

	void StartSpawnRadar(); // Function Solarland.ChaGA_RadarScanning.StartSpawnRadar // (Final|Native|Private) // @ game+0x2025b20
};

// Class Solarland.ChaGA_RapidBoost
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_RapidBoost : USolarCharacterGameplayAbility {
	struct UGameplayEffect* JetFlyCooldownEffectClass; // 0x460(0x08)
};

// Class Solarland.ChaGA_Rebirth
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Rebirth : USolarCharacterGameplayAbility {
	struct UGameplayEffect* RebirthHPEffect; // 0x460(0x08)
	struct UGameplayEffect* ResetJetFlyTimesEffect; // 0x468(0x08)
};

// Class Solarland.ChaGA_RechargeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_RechargeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag RechargeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_Reload
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_Reload : USolarCharacterGameplayAbility {
	struct FGameplayTag ReloadMontageTag; // 0x460(0x08)
	struct FGameplayTag ReloadWithBoltMontageTag; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void OnWeaponReloadComplete(); // Function Solarland.ChaGA_Reload.OnWeaponReloadComplete // (Final|Native|Public) // @ game+0x2025600
};

// Class Solarland.ChaGA_RepairVehicle
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_RepairVehicle : USolarCharacterGameplayAbility {
	struct FGameplayTag RepairVehicleWeakPointsMontageTag; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnVehicleWeakPointRepairingEnd(bool bCompleted); // Function Solarland.ChaGA_RepairVehicle.OnVehicleWeakPointRepairingEnd // (Final|Native|Private) // @ game+0x2025570
};

// Class Solarland.ChaGA_Rescue
// Size: 0x480 (Inherited: 0x460)
struct UChaGA_Rescue : USolarCharacterGameplayAbility {
	float SucceedBeforeSoundTime; // 0x460(0x04)
	struct FGameplayTag TeamRescueMontageTag; // 0x464(0x08)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UChaAT_WaitDelay* DelayTask; // 0x470(0x08)
	struct FGameplayTag SucceedCueTag; // 0x478(0x08)

	bool ShouldCancelRescue(); // Function Solarland.ChaGA_Rescue.ShouldCancelRescue // (Final|Native|Protected) // @ game+0x2025a10
	void OnRescueCompleted(); // Function Solarland.ChaGA_Rescue.OnRescueCompleted // (Final|Native|Protected) // @ game+0x20253c0
	void OnMontageCompleted(); // Function Solarland.ChaGA_Rescue.OnMontageCompleted // (Final|Native|Protected) // @ game+0x2020c80
	void BeforeRescueCompleted(); // Function Solarland.ChaGA_Rescue.BeforeRescueCompleted // (Final|Native|Protected) // @ game+0x2024780
};

// Class Solarland.ChaGA_ReviveTeammates
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_ReviveTeammates : USolarCharacterGameplayAbility {
	struct FGameplayTag ReviveTeammatesMontageTag; // 0x460(0x08)

	void OnReviveCompleted(); // Function Solarland.ChaGA_ReviveTeammates.OnReviveCompleted // (Final|Native|Protected) // @ game+0x20253e0
	void OnAbilityExec(); // Function Solarland.ChaGA_ReviveTeammates.OnAbilityExec // (Event|Public|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.ChaGA_ShopVIP
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_ShopVIP : USideResidentPassiveSkill {
	float ModifierValue; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class Solarland.ChaGA_SkydiveFly
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_SkydiveFly : USolarCharacterGameplayAbility {
	struct FGameplayTag SkydiveSoundCue; // 0x460(0x08)

	void OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Solarland.ChaGA_SkydiveFly.OnMovementModeChanged // (Final|Native|Private) // @ game+0x2025230
};

// Class Solarland.ChaGA_SkydiveLand
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_SkydiveLand : USolarCharacterGameplayAbility {

	void OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Solarland.ChaGA_SkydiveLand.OnMovementModeChanged // (Final|Native|Private) // @ game+0x20252b0
};

// Class Solarland.ChaGA_SkywardDive
// Size: 0x518 (Inherited: 0x460)
struct UChaGA_SkywardDive : USolarCharacterGameplayAbility {
	struct FGameplayTag SkywardDivePrepareCueTag; // 0x460(0x08)
	struct FGameplayTag SkywardDiveLaunchCueTag; // 0x468(0x08)
	float PrepareTimeConfig; // 0x470(0x04)
	float MaxSkywardHeightConfig; // 0x474(0x04)
	struct FRuntimeFloatCurve LaunchSpeedCurveConfig; // 0x478(0x88)
	struct TWeakObjectPtr<struct ASkywardDiveLauncher> SkywardDiveLauncher; // 0x500(0x08)
	char pad_508[0x8]; // 0x508(0x08)
	struct FName CancelActionName; // 0x510(0x08)

	void RealLaunchCharacter(); // Function Solarland.ChaGA_SkywardDive.RealLaunchCharacter // (Final|Native|Protected) // @ game+0x20258b0
	void K2_DoPrepareCue(struct ASolarCharacter* Character, struct ASkywardDiveLauncher* Launcher); // Function Solarland.ChaGA_SkywardDive.K2_DoPrepareCue // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void K2_DoLaunchCue(struct ASolarCharacter* Character, struct ASkywardDiveLauncher* Launcher); // Function Solarland.ChaGA_SkywardDive.K2_DoLaunchCue // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void DoPrepareCue(); // Function Solarland.ChaGA_SkywardDive.DoPrepareCue // (Final|Native|Protected) // @ game+0x2024820
	void DoLaunchCue(); // Function Solarland.ChaGA_SkywardDive.DoLaunchCue // (Final|Native|Protected) // @ game+0x2024800
	void CancelPrepareLaunch(); // Function Solarland.ChaGA_SkywardDive.CancelPrepareLaunch // (Final|Native|Protected) // @ game+0x20247a0
};

// Class Solarland.ChaGA_Sprint
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_Sprint : USolarCharacterGameplayAbility {
	struct UGameplayEffect* SprintEffectClass; // 0x460(0x08)
	struct FGameplayTag CancelSprintEventTag; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void OnSprintCancelled(); // Function Solarland.ChaGA_Sprint.OnSprintCancelled // (Final|Native|Private) // @ game+0x2028cb0
};

// Class Solarland.ChaGA_StickOutOfVehicle
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_StickOutOfVehicle : USolarCharacterGameplayAbility {
	float OutShotTimerForPC; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct FGameplayTagContainer BreakOutShotTags; // 0x468(0x20)

	void OnCancelByAdditionalCheck(); // Function Solarland.ChaGA_StickOutOfVehicle.OnCancelByAdditionalCheck // (Final|Native|Private) // @ game+0x7d3f60
	bool CheckAdditionalCancel(); // Function Solarland.ChaGA_StickOutOfVehicle.CheckAdditionalCancel // (Final|Native|Private) // @ game+0x2028540
};

// Class Solarland.ChaGA_SuperRadarScan
// Size: 0x520 (Inherited: 0x460)
struct UChaGA_SuperRadarScan : USolarCharacterGameplayAbility {
	struct ASolarCharacter* CacheCharacter; // 0x460(0x08)
	bool bSpawnRadarSuccess; // 0x468(0x01)
	bool bSpawnedRadar; // 0x469(0x01)
	bool bBackswingPlayed; // 0x46a(0x01)
	char pad_46B[0x1]; // 0x46b(0x01)
	struct FVector HitLocation; // 0x46c(0x0c)
	struct FGameplayTag RadarOrnamentTag; // 0x478(0x08)
	float LifeTime; // 0x480(0x04)
	float PrecastTime; // 0x484(0x04)
	float BackswingTime; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
	struct UGameplayAbility* RadarScanningAbilityClass; // 0x490(0x08)
	struct UAnimMontage* ScanAnimMontage; // 0x498(0x08)
	struct FGameplayTag CueTag; // 0x4a0(0x08)
	float MoveRadius; // 0x4a8(0x04)
	float OverlookCameraHeight; // 0x4ac(0x04)
	float OverlookCameraPitch; // 0x4b0(0x04)
	float CameraMoveScale; // 0x4b4(0x04)
	struct UParticleSystem* PreviewEffect; // 0x4b8(0x08)
	bool bUseForceLOD; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	int32_t DefaultLOD; // 0x4c4(0x04)
	int32_t OverLookLOD; // 0x4c8(0x04)
	float CancelCD; // 0x4cc(0x04)
	char pad_4D0[0x38]; // 0x4d0(0x38)
	struct ACameraActor* CacheOverlookCamera; // 0x508(0x08)
	struct AActor* CacheViewTarget; // 0x510(0x08)
	struct UParticleSystemComponent* CacheEmitter; // 0x518(0x08)

	void TryCreateRadarForAI(); // Function Solarland.ChaGA_SuperRadarScan.TryCreateRadarForAI // (Final|Native|Private) // @ game+0x2029190
	void TryCreateRadar(bool bSpawn, struct FVector& InLoc); // Function Solarland.ChaGA_SuperRadarScan.TryCreateRadar // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x20290b0
	void StartBackswing(); // Function Solarland.ChaGA_SuperRadarScan.StartBackswing // (Final|Native|Protected) // @ game+0x2029050
	void PlaySound(struct FString InSoundName); // Function Solarland.ChaGA_SuperRadarScan.PlaySound // (Final|Native|Public|BlueprintCallable) // @ game+0x2028fb0
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_SuperRadarScan.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x2028cf0
	void OnSpawnRadarSuccessfulHandle(struct FGameplayTag Tag, int32_t NewCount); // Function Solarland.ChaGA_SuperRadarScan.OnSpawnRadarSuccessfulHandle // (Final|Native|Public) // @ game+0x2028be0
	void OnReceivdTryCreateRadar(bool bSpawn); // Function Solarland.ChaGA_SuperRadarScan.OnReceivdTryCreateRadar // (Final|Native|Public) // @ game+0x2028a20
	void OnPrecastReady(); // Function Solarland.ChaGA_SuperRadarScan.OnPrecastReady // (Final|Native|Protected) // @ game+0x2028a00
	void OnPostMontageCompleted(); // Function Solarland.ChaGA_SuperRadarScan.OnPostMontageCompleted // (Final|Native|Private) // @ game+0x2020d70
	void OnCameraRight(float Value); // Function Solarland.ChaGA_SuperRadarScan.OnCameraRight // (Final|Native|Public) // @ game+0x20286a0
	void OnCameraForward(float Value); // Function Solarland.ChaGA_SuperRadarScan.OnCameraForward // (Final|Native|Public) // @ game+0x2028620
	void OnBackswingReady(); // Function Solarland.ChaGA_SuperRadarScan.OnBackswingReady // (Final|Native|Protected) // @ game+0x2020d70
	void K2_OnPrecastReady(); // Function Solarland.ChaGA_SuperRadarScan.K2_OnPrecastReady // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void K2_OnBackswingStart(bool bSuccess); // Function Solarland.ChaGA_SuperRadarScan.K2_OnBackswingStart // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void K2_OnAbilityEnd(struct ASolarCharacter* Character, bool bSuccess); // Function Solarland.ChaGA_SuperRadarScan.K2_OnAbilityEnd // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void K2_OnAbilityActive(struct ASolarCharacter* Character); // Function Solarland.ChaGA_SuperRadarScan.K2_OnAbilityActive // (Event|Protected|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.ChaGA_Swap
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Swap : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_Swim
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Swim : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_SwitchVehicleSeat
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_SwitchVehicleSeat : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_TacticalDodge
// Size: 0x500 (Inherited: 0x460)
struct UChaGA_TacticalDodge : USolarCharacterGameplayAbility {
	struct UGameplayEffect* DebuffPurifyEffectClass; // 0x460(0x08)
	struct UGameplayEffect* DebuffImmunityEffectClass; // 0x468(0x08)
	struct FTacticalDodgeDirectionConfig ForwardConfig; // 0x470(0x10)
	struct FTacticalDodgeDirectionConfig ForwardLeftConfig; // 0x480(0x10)
	struct FTacticalDodgeDirectionConfig ForwardRightConfig; // 0x490(0x10)
	struct FTacticalDodgeDirectionConfig LeftConfig; // 0x4a0(0x10)
	struct FTacticalDodgeDirectionConfig RightConfig; // 0x4b0(0x10)
	struct FTacticalDodgeDirectionConfig BackwardConfig; // 0x4c0(0x10)
	struct FTacticalDodgeDirectionConfig BackwardLeftConfig; // 0x4d0(0x10)
	struct FTacticalDodgeDirectionConfig BackwardRightConfig; // 0x4e0(0x10)
	struct UGameplayEffect* BuffQuickReloadEffectClass; // 0x4f0(0x08)
	char pad_4F8[0x8]; // 0x4f8(0x08)
};

// Class Solarland.ChaGA_TeamBoost
// Size: 0x4d0 (Inherited: 0x460)
struct UChaGA_TeamBoost : USolarCharacterGameplayAbility {
	struct UAnimMontage* SkillMontage; // 0x460(0x08)
	struct UAnimMontage* SkillMontageArmed; // 0x468(0x08)
	struct FGameplayTag OrnamentTag; // 0x470(0x08)
	struct UAnimMontage* OrnamentMontage; // 0x478(0x08)
	struct UAnimMontage* OrnamentMontageArmed; // 0x480(0x08)
	struct FName StartSkillMontageNotify; // 0x488(0x08)
	struct UGameplayEffect* DebuffPurifyEffectClass; // 0x490(0x08)
	struct UGameplayEffect* DebuffImmunityEffectClass; // 0x498(0x08)
	struct UGameplayEffect* SelfBoostEffectClass; // 0x4a0(0x08)
	struct UGameplayEffect* TeammateBoostEffectClass; // 0x4a8(0x08)
	struct ATeamBoostProjectile* TeamBoostProjectileClass; // 0x4b0(0x08)
	struct FVector ProjectileSpawnRelativeLocation; // 0x4b8(0x0c)
	float SkillRangeRadius; // 0x4c4(0x04)
	float SkillRangeHalfHeight; // 0x4c8(0x04)
	char pad_4CC[0x4]; // 0x4cc(0x04)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_TeamBoost.OnMontageNotify // (Final|Native|Protected) // @ game+0x20288e0
};

// Class Solarland.ChaGA_TrackingMaster
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_TrackingMaster : USolarCharacterGameplayAbility {
	struct UGameplayEffect* TrackingMasterEffect; // 0x460(0x08)
	char pad_468[0x10]; // 0x468(0x10)

	void OnCharacterBeforeChange(); // Function Solarland.ChaGA_TrackingMaster.OnCharacterBeforeChange // (Final|Native|Protected) // @ game+0x2028740
};

// Class Solarland.ChaGA_Treat
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_Treat : USolarCharacterGameplayAbility {
	struct FGameplayTag TreatMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_UAVRescue
// Size: 0x4a0 (Inherited: 0x460)
struct UChaGA_UAVRescue : USolarCharacterGameplayAbility {
	struct ASolarUAVRescue* RescueUAVClass; // 0x460(0x08)
	float LifeTime; // 0x468(0x04)
	bool bEffectTeammates; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct UAnimMontage* SummoEmptyMontage; // 0x470(0x08)
	struct UAnimMontage* SummonAnimMontage; // 0x478(0x08)
	float SummonTime; // 0x480(0x04)
	float PermanentSpawnDelay; // 0x484(0x04)
	float SkillRange; // 0x488(0x04)
	struct FGameplayTag CueTag; // 0x48c(0x08)
	char pad_494[0xc]; // 0x494(0x0c)

	void SummonUAV(); // Function Solarland.ChaGA_UAVRescue.SummonUAV // (Final|Native|Private) // @ game+0x2029070
};

// Class Solarland.ChaGA_UAVShield
// Size: 0x4a0 (Inherited: 0x460)
struct UChaGA_UAVShield : USolarCharacterGameplayAbility {
	struct ASolarUAVShield* ShieldUAVClass; // 0x460(0x08)
	char pad_468[0x10]; // 0x468(0x10)
	float LifeTime; // 0x478(0x04)
	bool bEffectTeammates; // 0x47c(0x01)
	char pad_47D[0x3]; // 0x47d(0x03)
	struct UAnimMontage* SummonAnimMontage; // 0x480(0x08)
	struct UAnimMontage* SummonAnimMontage_Aim; // 0x488(0x08)
	float SummonTime; // 0x490(0x04)
	char pad_494[0xc]; // 0x494(0x0c)

	void SummonUAV(); // Function Solarland.ChaGA_UAVShield.SummonUAV // (Final|Native|Private) // @ game+0x2029090
};

// Class Solarland.ChaGA_UpgradeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_UpgradeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag UpgradeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)

	void OnMontageInterruptOrCanceled(); // Function Solarland.ChaGA_UpgradeShield.OnMontageInterruptOrCanceled // (Final|Native|Private) // @ game+0x20288c0
	void OnMontageCompleted(); // Function Solarland.ChaGA_UpgradeShield.OnMontageCompleted // (Final|Native|Private) // @ game+0x20288a0
};

// Class Solarland.ChaGA_VaultBase
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_VaultBase : USolarCharacterGameplayAbility {
	struct AActor* ContactActor; // 0x460(0x08)
	char pad_468[0x30]; // 0x468(0x30)

	void OnServerConfirm(); // Function Solarland.ChaGA_VaultBase.OnServerConfirm // (Final|Native|Protected) // @ game+0x2028ba0
	void OnMontageCompleted(); // Function Solarland.ChaGA_VaultBase.OnMontageCompleted // (Final|Native|Protected) // @ game+0x2020c80
	void OnMontageBlendOut(); // Function Solarland.ChaGA_VaultBase.OnMontageBlendOut // (Final|Native|Protected) // @ game+0x2028880
};

// Class Solarland.ChaGA_Vault
// Size: 0x568 (Inherited: 0x498)
struct UChaGA_Vault : UChaGA_VaultBase {
	struct FGameplayTag StepMontageTag; // 0x498(0x08)
	struct FGameplayTag Step_CrossMontageTag; // 0x4a0(0x08)
	struct FGameplayTag Step_SprintMontageTag; // 0x4a8(0x08)
	struct FGameplayTag Step_Sprint_CrossMontageTag; // 0x4b0(0x08)
	struct FGameplayTag VaultMontageTag; // 0x4b8(0x08)
	struct FGameplayTag Vault_CrossMontageTag; // 0x4c0(0x08)
	struct FGameplayTag Vault_SprintMontageTag; // 0x4c8(0x08)
	struct FGameplayTag Vault_Sprint_CrossMontageTag; // 0x4d0(0x08)
	struct FGameplayTag ClimbMontageTag; // 0x4d8(0x08)
	struct FGameplayTag Climb_CrossMontageTag; // 0x4e0(0x08)
	struct FGameplayTag Climb_SprintMontageTag; // 0x4e8(0x08)
	struct FGameplayTag Climb_Sprint_CrossMontageTag; // 0x4f0(0x08)
	struct FGameplayTag Climb_WaterMontageTag; // 0x4f8(0x08)
	struct FGameplayTag HighClimbMontageTag; // 0x500(0x08)
	struct FGameplayTag HighClimb_CrossMontageTag; // 0x508(0x08)
	struct FGameplayTag HighClimb_SprintMontageTag; // 0x510(0x08)
	struct FGameplayTag HighClimb_Sprint_CrossMontageTag; // 0x518(0x08)
	struct FString PlayerCancelVaultEventName; // 0x520(0x10)
	struct FString TeammateCancelVaultEventName; // 0x530(0x10)
	struct FString EnemyCancelVaultEventName; // 0x540(0x10)
	char pad_550[0x18]; // 0x550(0x18)

	void OnRootMotionModifierDeactivate(struct ACharacter* Character, struct URootMotionModifier* Modifier); // Function Solarland.ChaGA_Vault.OnRootMotionModifierDeactivate // (Final|Native|Protected) // @ game+0x2028ad0
	void OnHandleNotify(struct USolarAnimInstance* AnimInstance, struct USolarAnimNotify* Notify, int32_t& OutDenial); // Function Solarland.ChaGA_Vault.OnHandleNotify // (Final|Native|Protected|HasOutParms) // @ game+0x2028760
};

// Class Solarland.ChaGA_VehicleFire
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_VehicleFire : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_VehicleForceJetFlyAction
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_VehicleForceJetFlyAction : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_VehicleReload
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_VehicleReload : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_WallRun
// Size: 0x4f0 (Inherited: 0x460)
struct UChaGA_WallRun : USolarCharacterGameplayAbility {
	float WallRunCameraAngleTolerance; // 0x460(0x04)
	float WallRunJumpReactionDelay; // 0x464(0x04)
	float FootOffset; // 0x468(0x04)
	float WallRunBlendOut; // 0x46c(0x04)
	float SurfaceAngleLerpSpeed; // 0x470(0x04)
	float MaxStandAngle; // 0x474(0x04)
	struct FVector2D LandingForceMagnitude; // 0x478(0x08)
	int32_t MaxTriggerNumPerAirMove; // 0x480(0x04)
	float WallRunJumpHeight; // 0x484(0x04)
	float WallRunJumpDist; // 0x488(0x04)
	float WallRunFailedHeight; // 0x48c(0x04)
	float WallRunFailedDist; // 0x490(0x04)
	struct FGameplayTag WithWeaponFailedMontageTag; // 0x494(0x08)
	struct FGameplayTag EmptyHandFailedMontageTag; // 0x49c(0x08)
	struct FName CancelActionName; // 0x4a4(0x08)
	struct FName JumpActionName; // 0x4ac(0x08)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct UChaAT_WaitLandingSpot* LandingTask; // 0x4b8(0x08)
	char pad_4C0[0x30]; // 0x4c0(0x30)

	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HealtDamage); // Function Solarland.ChaGA_WallRun.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x2028e50
	void OnSyncForceBlendOut(); // Function Solarland.ChaGA_WallRun.OnSyncForceBlendOut // (Final|Native|Private) // @ game+0x2028cd0
	void OnServerConfirm(); // Function Solarland.ChaGA_WallRun.OnServerConfirm // (Final|Native|Private) // @ game+0x2028bc0
	void OnRequestedToJump(); // Function Solarland.ChaGA_WallRun.OnRequestedToJump // (Final|Native|Private) // @ game+0x2028ab0
	void OnCancel(); // Function Solarland.ChaGA_WallRun.OnCancel // (Final|Native|Private) // @ game+0x2028720
	void OnAcceptWallRunJump(); // Function Solarland.ChaGA_WallRun.OnAcceptWallRunJump // (Final|Native|Private) // @ game+0x2028570
};

// Class Solarland.ChaGA_WallRunJump
// Size: 0x4a0 (Inherited: 0x460)
struct UChaGA_WallRunJump : USolarCharacterGameplayAbility {
	float CameraRotLagSpeed; // 0x460(0x04)
	struct FGameplayTag WithWeaponJumpMontageTag; // 0x464(0x08)
	struct FGameplayTag EmptyHandJumpMontageTag; // 0x46c(0x08)
	struct FGameplayTag WithWeaponFailedMontageTag; // 0x474(0x08)
	struct FGameplayTag EmptyHandFailedMontageTag; // 0x47c(0x08)
	char pad_484[0x1c]; // 0x484(0x1c)

	void OnMontageCompleted(); // Function Solarland.ChaGA_WallRunJump.OnMontageCompleted // (Final|Native|Private) // @ game+0x2020c80
	void OnMontageBlendOut(); // Function Solarland.ChaGA_WallRunJump.OnMontageBlendOut // (Final|Native|Private) // @ game+0x2020c80
};

// Class Solarland.ChaGA_Zipline
// Size: 0x480 (Inherited: 0x460)
struct UChaGA_Zipline : USolarCharacterGameplayAbility {
	struct FName CancelActionName; // 0x460(0x08)
	char pad_468[0x18]; // 0x468(0x18)

	void OnCancelled(); // Function Solarland.ChaGA_Zipline.OnCancelled // (Final|Native|Protected) // @ game+0x7d3f60
	void OnArrived(); // Function Solarland.ChaGA_Zipline.OnArrived // (Final|Native|Protected) // @ game+0x2020c80
};

// Class Solarland.ChaGC_CharacterActorCueBase
// Size: 0x2b0 (Inherited: 0x298)
struct AChaGC_CharacterActorCueBase : AGameplayCueNotify_Actor {
	struct TArray<struct FCueContent> CueContents; // 0x298(0x10)
	char pad_2A8[0x8]; // 0x2a8(0x08)

	bool WhileActiveInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.WhileActiveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x202e0c0
	bool OnRemoveInternal(struct ASolarCharacter* NullableCharacter, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnRemoveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x202d520
	void OnLocalPlayerSpectateMeStatusChanged(struct ASolarCharacter* Character, bool bIsSpectating); // Function Solarland.ChaGC_CharacterActorCueBase.OnLocalPlayerSpectateMeStatusChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x202d450
	bool OnExecuteInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnExecuteInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x202d280
	bool OnActiveInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnActiveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x202d0b0
	bool ListenLocalPlayerSpectateMeStatus(); // Function Solarland.ChaGC_CharacterActorCueBase.ListenLocalPlayerSpectateMeStatus // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x202d080
};

// Class Solarland.ChaGC_AerialReconnaissanc
// Size: 0x2b8 (Inherited: 0x2b0)
struct AChaGC_AerialReconnaissanc : AChaGC_CharacterActorCueBase {
	float TestDistance; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
};

// Class Solarland.ChaGC_AirDrop
// Size: 0x298 (Inherited: 0x298)
struct AChaGC_AirDrop : AGameplayCueNotify_Actor {
};

// Class Solarland.ChaGC_HighAlert
// Size: 0x2c0 (Inherited: 0x2b0)
struct AChaGC_HighAlert : AChaGC_CharacterActorCueBase {
	bool bShowDebug; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	float DebugTextDuration; // 0x2b4(0x04)
	float DebugDistance; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
};

// Class Solarland.ChaGC_JetSlowFalling
// Size: 0x50 (Inherited: 0x50)
struct UChaGC_JetSlowFalling : UGameplayCueNotify_Static {
};

// Class Solarland.ChaGC_SuperSkillActorCueBase
// Size: 0x2b8 (Inherited: 0x2b0)
struct AChaGC_SuperSkillActorCueBase : AChaGC_CharacterActorCueBase {
	struct FGameplayTag SuperSkillGameplayEffectTag; // 0x2b0(0x08)
};

// Class Solarland.ChaGC_MassInvisibility
// Size: 0x368 (Inherited: 0x2b8)
struct AChaGC_MassInvisibility : AChaGC_SuperSkillActorCueBase {
	struct UMaterialEffectBase* InvisibilityEffectClass; // 0x2b8(0x08)
	struct FGameplayTag InvisibilityOrnamentTag; // 0x2c0(0x08)
	struct FName BeginInvisibleCueEvent; // 0x2c8(0x08)
	int32_t SprintingStatusNotificationID; // 0x2d0(0x04)
	int32_t SprintingStatusTipShowInterval; // 0x2d4(0x04)
	float WarningOtherRange; // 0x2d8(0x04)
	float WarningOtherRangeOutThreshold; // 0x2dc(0x04)
	float PrepareWarningCueEventTriggerPoint; // 0x2e0(0x04)
	struct FName PrepareWarningCueEvent; // 0x2e4(0x08)
	float TimeBeforeEndToStartEndWarning; // 0x2ec(0x04)
	struct FName EndWarningMaterialParameterName; // 0x2f0(0x08)
	float EndWarningRate; // 0x2f8(0x04)
	float EndWarningCueEventTriggerPoint; // 0x2fc(0x04)
	struct FName EndWarningCueEvent; // 0x300(0x08)
	struct UCameraShake* CameraModifierClass; // 0x308(0x08)
	struct FGameplayTag SkillBuffGameplayEffectTag; // 0x310(0x08)
	struct FGameplayTag SkillPreGameplayEffectTag; // 0x318(0x08)
	char pad_320[0x48]; // 0x320(0x48)
};

// Class Solarland.ChaGC_ParkourAcceleration
// Size: 0x310 (Inherited: 0x298)
struct AChaGC_ParkourAcceleration : AGameplayCueNotify_Actor {
	struct FName FlushEffectID; // 0x298(0x08)
	struct FName TrailEffectID; // 0x2a0(0x08)
	struct TMap<struct FName, struct FVector2D> TrailEmitterParameters; // 0x2a8(0x50)
	struct FGameplayTag DurationTag; // 0x2f8(0x08)
	char pad_300[0x10]; // 0x300(0x10)
};

// Class Solarland.ChaGC_SkydiveFly
// Size: 0x2c8 (Inherited: 0x2b0)
struct AChaGC_SkydiveFly : AChaGC_CharacterActorCueBase {
	float MinBoostDuration; // 0x2b0(0x04)
	bool bIsBoost; // 0x2b4(0x01)
	char pad_2B5[0x13]; // 0x2b5(0x13)

	void ShowEncircleParticle(bool bIsLocalTeam, bool bIsDefender); // Function Solarland.ChaGC_SkydiveFly.ShowEncircleParticle // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x202dff0
};

// Class Solarland.ChaGC_SkydiveSound
// Size: 0x2b8 (Inherited: 0x298)
struct AChaGC_SkydiveSound : AGameplayCueNotify_Actor {
	struct TArray<struct FName> StartSoundGroups; // 0x298(0x10)
	struct TArray<struct FName> StopSoundGroups; // 0x2a8(0x10)
};

// Class Solarland.ChaGC_SkywardDiveLaunch
// Size: 0x2d0 (Inherited: 0x298)
struct AChaGC_SkywardDiveLaunch : AGameplayCueNotify_Actor {
	struct UAnimMontage* CharacterSkywardMontage; // 0x298(0x08)
	struct UParticleSystem* LaunchDeviceRealLaunchParticle; // 0x2a0(0x08)
	struct UParticleSystem* CharacterSkywardLaunchParticle; // 0x2a8(0x08)
	struct FName CharacterLaunchParticleSocketName; // 0x2b0(0x08)
	struct FName StartRealLaunchLoopSoundGroupName; // 0x2b8(0x08)
	struct FName StopRealLaunchLoopSoundGroupName; // 0x2c0(0x08)
	struct UParticleSystemComponent* CacheSkywardExtraEffect; // 0x2c8(0x08)
};

// Class Solarland.ChaGC_SkywardDivePrepare
// Size: 0x2f0 (Inherited: 0x298)
struct AChaGC_SkywardDivePrepare : AGameplayCueNotify_Actor {
	struct UAnimMontage* CharacterPrepareMontage; // 0x298(0x08)
	struct UParticleSystem* PrepareBeamParticle; // 0x2a0(0x08)
	struct UParticleSystem* PreparePackageParticle; // 0x2a8(0x08)
	struct TArray<struct FName> PreparePackageSocketNames; // 0x2b0(0x10)
	struct FName StartPrepareLaunchSoundGroupName; // 0x2c0(0x08)
	struct FName StopPrepareLaunchSoundGroupName; // 0x2c8(0x08)
	struct UParticleSystemComponent* PrepareBeamEffect; // 0x2d0(0x08)
	struct TArray<struct UParticleSystemComponent*> PreparePackageEffect; // 0x2d8(0x10)
	char pad_2E8[0x8]; // 0x2e8(0x08)
};

// Class Solarland.ChaGC_SwitchToDuckRollingMesh
// Size: 0x2b0 (Inherited: 0x2b0)
struct AChaGC_SwitchToDuckRollingMesh : AChaGC_CharacterActorCueBase {
};

// Class Solarland.ChaGC_WallRun
// Size: 0x50 (Inherited: 0x50)
struct UChaGC_WallRun : UGameplayCueNotify_Static {
};

// Class Solarland.CharacterBasalAttributeSet
// Size: 0x350 (Inherited: 0x50)
struct UCharacterBasalAttributeSet : UBasalAttributeSet {
	struct FGameplayAttributeData Speed; // 0x50(0x10)
	struct FGameplayAttributeData BaseSpeed; // 0x60(0x10)
	struct FGameplayAttributeData PassiveSkillSpeedMultiple; // 0x70(0x10)
	struct FGameplayAttributeData ShootingSpeedMultiple; // 0x80(0x10)
	struct FGameplayAttributeData CustomJumpHeightMultiple; // 0x90(0x10)
	struct FGameplayAttributeData AllSpeedParamA; // 0xa0(0x10)
	struct FGameplayAttributeData AllSpeedParamB; // 0xb0(0x10)
	struct FGameplayAttributeData AllSpeedParamC; // 0xc0(0x10)
	struct FGameplayAttributeData AllSpeedParamD; // 0xd0(0x10)
	struct FGameplayAttributeData GroundSpeedParamA; // 0xe0(0x10)
	struct FGameplayAttributeData GroundSpeedParamB; // 0xf0(0x10)
	struct FGameplayAttributeData GroundSpeedParamC; // 0x100(0x10)
	struct FGameplayAttributeData GroundSpeedParamD; // 0x110(0x10)
	struct FGameplayAttributeData SwimSpeedParamA; // 0x120(0x10)
	struct FGameplayAttributeData SwimSpeedParamB; // 0x130(0x10)
	struct FGameplayAttributeData SwimSpeedParamC; // 0x140(0x10)
	struct FGameplayAttributeData SwimSpeedParamD; // 0x150(0x10)
	struct FGameplayAttributeData MaxShield; // 0x160(0x10)
	struct FGameplayAttributeData CurrentShield; // 0x170(0x10)
	struct FGameplayAttributeData ShieldMultiRecoverCoeff; // 0x180(0x10)
	struct FGameplayAttributeData ShieldReductionDamageMultiple; // 0x190(0x10)
	struct FGameplayAttributeData RadialDamageReductionMultiple; // 0x1a0(0x10)
	struct FGameplayAttributeData AllDamageReductionMultiple; // 0x1b0(0x10)
	struct FGameplayAttributeData WeaponDamageParamA; // 0x1c0(0x10)
	struct FGameplayAttributeData WeaponDamageParamB; // 0x1d0(0x10)
	struct FGameplayAttributeData WeaponDamageParamC; // 0x1e0(0x10)
	struct FGameplayAttributeData WeaponDamageParamD; // 0x1f0(0x10)
	struct FGameplayAttributeData UnarmedWeaponDamageParamB; // 0x200(0x10)
	struct FGameplayAttributeData VehicleWeaponDamageParamB; // 0x210(0x10)
	struct FGameplayAttributeData VehicleHitDamageParamB; // 0x220(0x10)
	struct FGameplayAttributeData VehicleAbilityDamageParamB; // 0x230(0x10)
	struct FGameplayAttributeData CharacterSkillDamageParamB; // 0x240(0x10)
	struct FGameplayAttributeData VerticalJetTimesCD; // 0x250(0x10)
	struct FGameplayAttributeData VerticalJetInnerCD; // 0x260(0x10)
	struct FGameplayAttributeData VerticalJetTimes; // 0x270(0x10)
	struct FGameplayAttributeData VerticalJetRestTimes; // 0x280(0x10)
	struct FGameplayAttributeData HorizontalJetTimesCD; // 0x290(0x10)
	struct FGameplayAttributeData HorizontalJetInnerCD; // 0x2a0(0x10)
	struct FGameplayAttributeData HorizontalJetTimes; // 0x2b0(0x10)
	struct FGameplayAttributeData HorizontalJetRestTimes; // 0x2c0(0x10)
	struct FGameplayAttributeData RescueRecoveredMultiple; // 0x2d0(0x10)
	struct FGameplayAttributeData TreatmentDurationReductionMultiple; // 0x2e0(0x10)
	struct FGameplayAttributeData ShieldRecoveredMultiple; // 0x2f0(0x10)
	struct FGameplayAttributeData ChargingMultiple; // 0x300(0x10)
	struct FGameplayAttributeData AutoHealingRateOnMotorbike; // 0x310(0x10)
	struct FGameplayAttributeData RescueDurationReductionMultiple; // 0x320(0x10)
	struct FGameplayAttributeData ReviveDurationReductionBonus; // 0x330(0x10)
	struct FGameplayAttributeData QuickReloadOverrideTime; // 0x340(0x10)

	void OnRep_VerticalJetTimesCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetTimesCD // (Final|Native|Protected|HasOutParms) // @ game+0x202df50
	void OnRep_VerticalJetTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetTimes // (Final|Native|Protected|HasOutParms) // @ game+0x202deb0
	void OnRep_VerticalJetRestTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetRestTimes // (Final|Native|Protected|HasOutParms) // @ game+0x202de10
	void OnRep_VerticalJetInnerCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetInnerCD // (Final|Native|Protected|HasOutParms) // @ game+0x202dd70
	void OnRep_TreatmentDurationReductionMultiple(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_TreatmentDurationReductionMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x202dcd0
	void OnRep_Speed(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_Speed // (Native|Protected|HasOutParms) // @ game+0x202dc20
	void OnRep_ShieldMultiRecoverCoeff(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_ShieldMultiRecoverCoeff // (Native|Protected|HasOutParms) // @ game+0x202db70
	void OnRep_RescueDurationReductionMultiple(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_RescueDurationReductionMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x202dad0
	void OnRep_MaxShield(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_MaxShield // (Native|Protected|HasOutParms) // @ game+0x202da20
	void OnRep_HorizontalJetTimesCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetTimesCD // (Final|Native|Protected|HasOutParms) // @ game+0x202d980
	void OnRep_HorizontalJetTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetTimes // (Final|Native|Protected|HasOutParms) // @ game+0x202d8e0
	void OnRep_HorizontalJetRestTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetRestTimes // (Final|Native|Protected|HasOutParms) // @ game+0x202d840
	void OnRep_HorizontalJetInnerCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetInnerCD // (Final|Native|Protected|HasOutParms) // @ game+0x202d7a0
	void OnRep_CurrentShield(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_CurrentShield // (Native|Protected|HasOutParms) // @ game+0x202d6f0
};

// Class Solarland.CharacterBodyScaleConfigDataAsset
// Size: 0x1a8 (Inherited: 0x30)
struct UCharacterBodyScaleConfigDataAsset : UDataAsset {
	struct TMap<enum class ECharacterBodyScaleType, struct FCharacterBodyScaleConfig> ConfigMap; // 0x30(0x50)
	struct FCharacterAssistAimTargetConfig DefaultAssistAimTargetConfig; // 0x80(0xd8)
	struct TMap<enum class ECharacterBodyScaleType, struct FCharacterAssistAimTargetConfig> AssistAimTargetConfigMap; // 0x158(0x50)
};

// Class Solarland.CharacterConfigAsset
// Size: 0x30 (Inherited: 0x30)
struct UCharacterConfigAsset : UDataAsset {
};

// Class Solarland.CharacterCruiseComponent
// Size: 0x108 (Inherited: 0xb0)
struct UCharacterCruiseComponent : UActorComponent {
	struct ASolarCapsuleActor* BoardedCapsulePrivate; // 0xb0(0x08)
	char pad_B8[0xc]; // 0xb8(0x0c)
	struct FName CruiseStartSoundGroupName; // 0xc4(0x08)
	char pad_CC[0x3c]; // 0xcc(0x3c)

	struct ASolarCharacter* GetCharacterOwner(); // Function Solarland.CharacterCruiseComponent.GetCharacterOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x202d060
};

// Class Solarland.CharacterGameplayTagsConfig
// Size: 0x650 (Inherited: 0x30)
struct UCharacterGameplayTagsConfig : UDataAsset {
	struct FGameplayTag CruiseAbilityTag; // 0x30(0x08)
	struct FGameplayTag SkydiveFlyAbilityTag; // 0x38(0x08)
	struct FGameplayTag SkydiveLandAbilityTag; // 0x40(0x08)
	struct FGameplayTag CrouchAbilityTag; // 0x48(0x08)
	struct FGameplayTag JumpAbilityTag; // 0x50(0x08)
	struct FGameplayTag SprintAbilityTag; // 0x58(0x08)
	struct FGameplayTag SwimAbilityTag; // 0x60(0x08)
	struct FGameplayTag VaultAbilityTag; // 0x68(0x08)
	struct FGameplayTag JetFlyAbilityTag; // 0x70(0x08)
	struct FGameplayTag JetFlyVertAbilityTag; // 0x78(0x08)
	struct FGameplayTag JetFlyHoriAbilityTag; // 0x80(0x08)
	struct FGameplayTag LaunchAbilityTag; // 0x88(0x08)
	struct FGameplayTag JetSlowFallingAbilityTag; // 0x90(0x08)
	struct FGameplayTag EquipAbilityTag; // 0x98(0x08)
	struct FGameplayTag MeleeAbilityTag; // 0xa0(0x08)
	struct FGameplayTag FireAbilityTag; // 0xa8(0x08)
	struct FGameplayTag ReloadAbilityTag; // 0xb0(0x08)
	struct FGameplayTag VehicleFireAbilityTag; // 0xb8(0x08)
	struct FGameplayTag VehicleReloadAbilityTag; // 0xc0(0x08)
	struct FGameplayTag BoltAbilityTag; // 0xc8(0x08)
	struct FGameplayTag OpenScopeAbilityTag; // 0xd0(0x08)
	struct FGameplayTag WeaponAbilityTag; // 0xd8(0x08)
	struct FGameplayTag GetOnVehicleAbilityTag; // 0xe0(0x08)
	struct FGameplayTag GetOffVehicleAbilityTag; // 0xe8(0x08)
	struct FGameplayTag SwitchVehicleSeatAbilityTag; // 0xf0(0x08)
	struct FGameplayTag StickOutOffVehicleAbilityTag; // 0xf8(0x08)
	struct FGameplayTag TreatAbilityTag; // 0x100(0x08)
	struct FGameplayTag RechargeShieldAbilityTag; // 0x108(0x08)
	struct FGameplayTag BigRechargeShieldAbilityTag; // 0x110(0x08)
	struct FGameplayTag UpgradeShieldAbilityTag; // 0x118(0x08)
	struct FGameplayTag OpenTreasureBoxAbilityTag; // 0x120(0x08)
	struct FGameplayTag OpenNewTreasureBoxAbilityTag; // 0x128(0x08)
	struct FGameplayTag RepairVehicleAbilityTag; // 0x130(0x08)
	struct FGameplayTag RescueAbilityTag; // 0x138(0x08)
	struct FGameplayTag PickUpAbilityTag; // 0x140(0x08)
	struct FGameplayTag AutoPickUpAbilityTag; // 0x148(0x08)
	struct FGameplayTag ResurrectTeammateAbilityTag; // 0x150(0x08)
	struct FGameplayTag DeathVergeAbilityTag; // 0x158(0x08)
	struct FGameplayTag DeathAbilityTag; // 0x160(0x08)
	struct FGameplayTag RebirthAbilityTag; // 0x168(0x08)
	struct FGameplayTag ParkourMasterEffectTag; // 0x170(0x08)
	struct FGameplayTag HawkEyeEffectTag; // 0x178(0x08)
	struct FGameplayTag MassInvisibilityEffectTag; // 0x180(0x08)
	struct FGameplayTag MassInvisibilityExEffectTag; // 0x188(0x08)
	struct FGameplayTag RapidBoostEffectTag; // 0x190(0x08)
	struct FGameplayTag MainContinousTag; // 0x198(0x08)
	struct FGameplayTag SubContinousTag; // 0x1a0(0x08)
	struct FGameplayTag HasPreBuffTag; // 0x1a8(0x08)
	struct FGameplayTag DurationPauseTag; // 0x1b0(0x08)
	struct FGameplayTag SuperSkillEffectTag; // 0x1b8(0x08)
	struct FGameplayTag TacticleSkillEffectTag; // 0x1c0(0x08)
	struct FGameplayTag SkydiveSoundTag; // 0x1c8(0x08)
	struct FGameplayTag WallRunCueTag; // 0x1d0(0x08)
	struct FGameplayTag CruisingStatusTag; // 0x1d8(0x08)
	struct FGameplayTag WalkingStatusTag; // 0x1e0(0x08)
	struct FGameplayTag FallingStatusTag; // 0x1e8(0x08)
	struct FGameplayTag FlyingStatusTag; // 0x1f0(0x08)
	struct FGameplayTag SwimmingStatusTag; // 0x1f8(0x08)
	struct FGameplayTag SkydivingStatusTag; // 0x200(0x08)
	struct FGameplayTag VaultingStatusTag; // 0x208(0x08)
	struct FGameplayTag VaultingAcceptCancelTag; // 0x210(0x08)
	struct FGameplayTag VaultingAcceptWeaponInputTag; // 0x218(0x08)
	struct FGameplayTag WallRunStatusTag; // 0x220(0x08)
	struct FGameplayTag WallRunAttemptVaultTag; // 0x228(0x08)
	struct FGameplayTag LaunchStatusTag; // 0x230(0x08)
	struct FGameplayTag RunningStatusTag; // 0x238(0x08)
	struct FGameplayTag SprintingStatusTag; // 0x240(0x08)
	struct FGameplayTag StationaryStatusTag; // 0x248(0x08)
	struct FGameplayTag FollowViewRotationStatusTag; // 0x250(0x08)
	struct FGameplayTag RotationFollowVelocityStatusTag; // 0x258(0x08)
	struct FGameplayTag CollisionIgnorePawnChannelStatusTag; // 0x260(0x08)
	struct FGameplayTag WeaponStatusTag; // 0x268(0x08)
	struct FGameplayTag MeleeAttackingStatusTag; // 0x270(0x08)
	struct FGameplayTag FullBodyMeleeStatusTag; // 0x278(0x08)
	struct FGameplayTag FiringStatusTag; // 0x280(0x08)
	struct FGameplayTag VehicleFiringStatusTag; // 0x288(0x08)
	struct FGameplayTag HiddenFireStatusTag; // 0x290(0x08)
	struct FGameplayTag BoltingStatusTag; // 0x298(0x08)
	struct FGameplayTag ReloadingStatusTag; // 0x2a0(0x08)
	struct FGameplayTag ScopeOpeningStatusTag; // 0x2a8(0x08)
	struct FGameplayTag EnteringScopeOpeningStatusTag; // 0x2b0(0x08)
	struct FGameplayTag QuickReloadStatusTag; // 0x2b8(0x08)
	struct FGameplayTag FunctionalityStatusTag; // 0x2c0(0x08)
	struct FGameplayTag OpeningTreasureBoxStatusTag; // 0x2c8(0x08)
	struct FGameplayTag RechargingShieldStatusTag; // 0x2d0(0x08)
	struct FGameplayTag RescuingStatusTag; // 0x2d8(0x08)
	struct FGameplayTag TreatingStatusTag; // 0x2e0(0x08)
	struct FGameplayTag ReviveTeammateStatusTag; // 0x2e8(0x08)
	struct FGameplayTag InVehicleTag; // 0x2f0(0x08)
	struct FGameplayTag DanceStatusTag; // 0x2f8(0x08)
	struct FGameplayTag DanceLeaderStatusTag; // 0x300(0x08)
	struct FGameplayTag UsingContinuousSkill; // 0x308(0x08)
	struct FGameplayTag HoldingSkill; // 0x310(0x08)
	struct FGameplayTag AutoCancelOnInputReleased; // 0x318(0x08)
	struct FGameplayTag MassInvisibilityStatusTag; // 0x320(0x08)
	struct FGameplayTag MassInvisibilityPrepareStatusTag; // 0x328(0x08)
	struct FGameplayTag SuperRadarChooseStatusTag; // 0x330(0x08)
	struct FGameplayTag RadarScanningStatusTag; // 0x338(0x08)
	struct FGameplayTag EMPStatusTag; // 0x340(0x08)
	struct FGameplayTag FreezeStatusTag; // 0x348(0x08)
	struct FGameplayTag PerspectiveByRadarStatusTag; // 0x350(0x08)
	struct FGameplayTag InhibitDebuffStatusTag; // 0x358(0x08)
	struct FGameplayTag CanScoutEnemyTag; // 0x360(0x08)
	struct FGameplayTag DuckRollingStatusTag; // 0x368(0x08)
	struct FGameplayTag DeathVergeStatusTag; // 0x370(0x08)
	struct FGameplayTag DeathStatusTag; // 0x378(0x08)
	struct FGameplayTag InvincibleStatusTag; // 0x380(0x08)
	struct FGameplayTag InhibitOpenScopeStatusTag; // 0x388(0x08)
	struct FGameplayTag InhibitWeaponInputStatusTag; // 0x390(0x08)
	struct FGameplayTag InhibitWeaponFireInputStatusTag; // 0x398(0x08)
	struct FGameplayTag InhibitMoveStatusTag; // 0x3a0(0x08)
	struct FGameplayTag InhibitMoveCombinationStatusTag; // 0x3a8(0x08)
	struct FGameplayTag InhibitUnCrouchStatusTag; // 0x3b0(0x08)
	struct FGameplayTag InhibitSprintStatusTag; // 0x3b8(0x08)
	struct FGameplayTag InhibitAimOffsetStatusTag; // 0x3c0(0x08)
	struct FGameplayTag InhibitLeftHandWeaponAttachTag; // 0x3c8(0x08)
	struct FGameplayTag InhibitLeftHandWeaponAttachAnimNotifyTag; // 0x3d0(0x08)
	struct FGameplayTag InhibitInteractionOption; // 0x3d8(0x08)
	struct FGameplayTag InhibitContinuousTreatStatusTag; // 0x3e0(0x08)
	struct FGameplayTag InhibitFireStatusTag; // 0x3e8(0x08)
	struct FGameplayTag InhibitDamageReactionTag; // 0x3f0(0x08)
	struct FGameplayTag InhibitJetSlowFallingTag; // 0x3f8(0x08)
	struct FGameplayTag InhibitBlackHoleEffectStatusTag; // 0x400(0x08)
	struct FGameplayTag VJetChargingStatusTag; // 0x408(0x08)
	struct FGameplayTag HJetChargingStatusTag; // 0x410(0x08)
	struct FGameplayTag GenericTalentActivationStatusTag; // 0x418(0x08)
	struct FGameplayTag TrackingMasterStatusTag; // 0x420(0x08)
	struct FGameplayTag ShieldMultiRecoverTag; // 0x428(0x08)
	struct FGameplayTag ShieldMultiRecoverOnGoingTag; // 0x430(0x08)
	struct FGameplayTag AerialReconnaissanceTagTag; // 0x438(0x08)
	struct FGameplayTag OpenAirDropTag; // 0x440(0x08)
	struct FGameplayTag ResurrectTeammateTag; // 0x448(0x08)
	struct FGameplayTag ReviveTeammateTag; // 0x450(0x08)
	struct FGameplayTag ReviveSelfTag; // 0x458(0x08)
	struct FGameplayTag HasRotationInputStatusTag; // 0x460(0x08)
	struct FGameplayTag InSmokeStatusTag; // 0x468(0x08)
	struct FGameplayTag InBattleTag; // 0x470(0x08)
	struct FGameplayTag StartCruiseEventTag; // 0x478(0x08)
	struct FGameplayTag IntoParachuteZoneEventTag; // 0x480(0x08)
	struct FGameplayTag ForceParachuteEventTag; // 0x488(0x08)
	struct FGameplayTag FinishCruiseEventTag; // 0x490(0x08)
	struct FGameplayTag CrouchEventTag; // 0x498(0x08)
	struct FGameplayTag LaunchEventTag; // 0x4a0(0x08)
	struct FGameplayTag VaultEventTag; // 0x4a8(0x08)
	struct FGameplayTag StepEventTag; // 0x4b0(0x08)
	struct FGameplayTag WallRunEventTag; // 0x4b8(0x08)
	struct FGameplayTag WallRunJumpEventTag; // 0x4c0(0x08)
	struct FGameplayTag HitRecoverEventTag; // 0x4c8(0x08)
	struct FGameplayTag MeleeAttackEventTag; // 0x4d0(0x08)
	struct FGameplayTag FireEventTag; // 0x4d8(0x08)
	struct FGameplayTag BoltEventTag; // 0x4e0(0x08)
	struct FGameplayTag EquipEventTag; // 0x4e8(0x08)
	struct FGameplayTag SwapEventTag; // 0x4f0(0x08)
	struct FGameplayTag ReloadEventTag; // 0x4f8(0x08)
	struct FGameplayTag VehicleReloadEventTag; // 0x500(0x08)
	struct FGameplayTag VehicleFireEventTag; // 0x508(0x08)
	struct FGameplayTag PickUpEventTag; // 0x510(0x08)
	struct FGameplayTag AutoPickUpEventTag; // 0x518(0x08)
	struct FGameplayTag RepairVehicleEventTag; // 0x520(0x08)
	struct FGameplayTag DanceEventTag; // 0x528(0x08)
	struct FGameplayTag SpawnRadarEventTag; // 0x530(0x08)
	struct FGameplayTag DyingEventTag; // 0x538(0x08)
	struct FGameplayTag KillOrAssistEventTag; // 0x540(0x08)
	struct FGameplayTag GottenOnVehicleEventTag; // 0x548(0x08)
	struct FGameplayTag GottenOffVehicleEventTag; // 0x550(0x08)
	struct FGameplayTag VehicleForJetEventTag; // 0x558(0x08)
	struct FGameplayTag SideLeavingEventTag; // 0x560(0x08)
	struct FGameplayTag SideJoiningEventTag; // 0x568(0x08)
	struct FGameplayTag SuperSkillForbiddenEventTag; // 0x570(0x08)
	struct FGameplayTag SuperSkillBlockEventTag; // 0x578(0x08)
	struct FGameplayTag SuperSkillForbidUIStatusTag; // 0x580(0x08)
	struct FGameplayTag SuperSkillBlockStatusTag; // 0x588(0x08)
	struct FGameplayTag SuperSkillCDReducedStatusTag; // 0x590(0x08)
	struct FGameplayTag TacticalForbiddenEventTag; // 0x598(0x08)
	struct FGameplayTag TacticalBlockEventTag; // 0x5a0(0x08)
	struct FGameplayTag TacticalForbidUIStatusTag; // 0x5a8(0x08)
	struct FGameplayTag TacticalSkillCDReducedStatusTag; // 0x5b0(0x08)
	struct FGameplayTag TacticalSkillBlockStatusTag; // 0x5b8(0x08)
	struct FGameplayTag BigWaterGunActivatingTag; // 0x5c0(0x08)
	struct FGameplayTag AirDropTag; // 0x5c8(0x08)
	struct FGameplayTag NightComesBuff; // 0x5d0(0x08)
	struct FGameplayTag NightComesActorContinous; // 0x5d8(0x08)
	struct FGameplayTag SkywardDiveTag; // 0x5e0(0x08)
	struct FGameplayTag SuperRadarScanTag; // 0x5e8(0x08)
	struct FGameplayTag RadarScanningTag; // 0x5f0(0x08)
	struct FGameplayTag BlackHoleStatusTag; // 0x5f8(0x08)
	struct FGameplayTag RoleAbilityRootTag; // 0x600(0x08)
	struct FGameplayTag RoleAbilityRootTypeTag; // 0x608(0x08)
	struct FGameplayTag SkillTypeTag; // 0x610(0x08)
	struct FGameplayTag SummonTypeTag; // 0x618(0x08)
	struct FGameplayTag ProjectileTypeTag; // 0x620(0x08)
	struct FGameplayTag SummonedJumpPadLaunchCooldownTag; // 0x628(0x08)
	struct FGameplayTag ShieldMultiRecoverCoolDownTag; // 0x630(0x08)
	struct FGameplayTag GenericTalentCooldownTag; // 0x638(0x08)
	struct FGameplayTag VJetCooldownTag; // 0x640(0x08)
	struct FGameplayTag HJetCooldownTag; // 0x648(0x08)
};

// Class Solarland.MaterialChangePriorityTags
// Size: 0x58 (Inherited: 0x30)
struct UMaterialChangePriorityTags : UDataAsset {
	struct FGameplayTag Default; // 0x30(0x08)
	struct FGameplayTag Radar; // 0x38(0x08)
	struct FGameplayTag Stealth; // 0x40(0x08)
	struct FGameplayTag WholeShield; // 0x48(0x08)
	struct FGameplayTag ThermalImaging; // 0x50(0x08)
};

// Class Solarland.VisibilityFlagTags
// Size: 0x70 (Inherited: 0x30)
struct UVisibilityFlagTags : UDataAsset {
	struct FGameplayTag Default; // 0x30(0x08)
	struct FGameplayTag Cruise; // 0x38(0x08)
	struct FGameplayTag Stealth; // 0x40(0x08)
	struct FGameplayTag CameraOverlap; // 0x48(0x08)
	struct FGameplayTag DissolvedDeath; // 0x50(0x08)
	struct FGameplayTag WholeShield; // 0x58(0x08)
	struct FGameplayTag MassInvisibility; // 0x60(0x08)
	struct FGameplayTag MassInvisibilityWarning; // 0x68(0x08)
};

// Class Solarland.CharacterMontageTags
// Size: 0x50 (Inherited: 0x30)
struct UCharacterMontageTags : UDataAsset {
	struct FGameplayTag TeamRescueMontageTag; // 0x30(0x08)
	struct FGameplayTag RechargeShieldTag; // 0x38(0x08)
	struct FGameplayTag UpgradeShieldTag; // 0x40(0x08)
	struct FGameplayTag LeadingDanceTag; // 0x48(0x08)
};

// Class Solarland.CharacterGlobalConfig
// Size: 0xab0 (Inherited: 0x30)
struct UCharacterGlobalConfig : UDataAsset {
	struct TMap<int32_t, struct FCharacterSpecializedComponentInfos> CharacterSpecializedComponentInfos; // 0x30(0x50)
	struct FName HeadBoneName; // 0x80(0x08)
	struct FGameplayCueTag TeamPerspectiveCueTag_LocalPlayer; // 0x88(0x08)
	struct FGameplayCueTag TeamPerspectiveCueTag_Teammate; // 0x90(0x08)
	struct FGameplayTagRequirements TeamPerspectiveTagRequirements_Teammate; // 0x98(0x50)
	struct FGameplayCueTag OpponentPerspectiveCueTag; // 0xe8(0x08)
	float OpponentPerspectiveMinDistance; // 0xf0(0x04)
	float OpponentPerspectiveMaxDistance; // 0xf4(0x04)
	struct FGameplayTagRequirements OpponentPerspectiveLocalPlayerTagRequirements; // 0xf8(0x50)
	struct FGameplayTagRequirements OpponentPerspectiveOpponentTagRequirements; // 0x148(0x50)
	float OpponentPerspectiveDisableDelay; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
	struct FInjectorMeshPreset RescueInjectorPreset; // 0x1a0(0x50)
	int32_t FastReliefPassiveTextID; // 0x1f0(0x04)
	int32_t RescueTextID; // 0x1f4(0x04)
	struct UCameraShake* HitCameraShake; // 0x1f8(0x08)
	float CameraShakeCD; // 0x200(0x04)
	char pad_204[0x4]; // 0x204(0x04)
	struct UMaterialParameterCollection* CameraFOVParameterCollection; // 0x208(0x08)
	int64_t ChargingDoneSoundCD; // 0x210(0x08)
	struct UGameplayEffect* ExtraVJetTimesEffect; // 0x218(0x08)
	struct UGameplayEffect* VJetChargeScaleEffect; // 0x220(0x08)
	struct UGameplayEffect* ExtraHJetTimesEffect; // 0x228(0x08)
	struct UGameplayEffect* HJetChargeScaleEffect; // 0x230(0x08)
	struct FGameplayTag ExtraJetTimesSetterTag; // 0x238(0x08)
	struct FGameplayTag JetChargeScaleSetterTag; // 0x240(0x08)
	int32_t DeathBoxId; // 0x248(0x04)
	float TurnSpeed; // 0x24c(0x04)
	float TurnChangeSpeedThreshold; // 0x250(0x04)
	float TurnAngleThreshold; // 0x254(0x04)
	float SprintTolerantAngle; // 0x258(0x04)
	float SkydiveFollowingTeleportTriggerDistance; // 0x25c(0x04)
	float SkydiveFollowingTeleportDistance; // 0x260(0x04)
	float JetLandingTriggerMinVelocity; // 0x264(0x04)
	float JetLandingHeightThreshold; // 0x268(0x04)
	float JetLandingVelocity; // 0x26c(0x04)
	float MaxSpeedParamB; // 0x270(0x04)
	float MinSpeedParamD; // 0x274(0x04)
	struct FRuntimeFloatCurve NetworkMaxSmoothUpdateDistanceBySpeedCurve; // 0x278(0x88)
	struct FRuntimeFloatCurve NetworkNoSmoothUpdateDistanceBySpeedCurve; // 0x300(0x88)
	struct FRuntimeFloatCurve NetworkSimulatedSmoothLocationTimeBySpeedCurve; // 0x388(0x88)
	struct UCruiseAssetSet* CruiseAssetSet; // 0x410(0x08)
	struct FString AirborneStartSound; // 0x418(0x10)
	struct FString AirborneJumpSound; // 0x428(0x10)
	struct TArray<struct FSkydivingEffectPreset> SkydivingEffectClassList; // 0x438(0x10)
	float LowerLimitOfSpeedForSkydivingSoundEffect; // 0x448(0x04)
	float MinPitchToPlaySkydivingLandingEffect; // 0x44c(0x04)
	struct FName StartSkydiveLoopSoundGroup_Speed; // 0x450(0x08)
	struct FName StopSkydiveLoopSoundGroup_Speed; // 0x458(0x08)
	struct FName StopSkydiveLoopSoundGroup_Height; // 0x460(0x08)
	float VaultDegree; // 0x468(0x04)
	float VaultHalfHeight; // 0x46c(0x04)
	struct FName DetectorProfile; // 0x470(0x08)
	float KneeWaterInfluencesCharacterSpeed; // 0x478(0x04)
	float WaterDraftDepthWhenDeathVerge; // 0x47c(0x04)
	float ShoalWaterMaxDepth; // 0x480(0x04)
	float HeavyJumpWaterMinAxisVelocity; // 0x484(0x04)
	struct FWaterEffectPreset SwimmingWaterEffectPreset; // 0x488(0x50)
	struct FWaterEffectPreset HeavyJumpWaterEffectPreset; // 0x4d8(0x50)
	struct TArray<struct FWaterEffectPreset> SoftJumpWaterEffectPresets; // 0x528(0x10)
	struct FGameplayCueTag InWaterLocalGameplayCueTag; // 0x538(0x08)
	struct FName PickupCollisionProfileName; // 0x540(0x08)
	float PoisonRecommendToleranceTimes; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct FTreasureBoxOperatorMeshPreset TreasureBoxOperatorMeshPreset; // 0x550(0x50)
	int32_t AirDropSkillTextID; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct FString TreatFX; // 0x5a8(0x10)
	int32_t TreatmentTextID; // 0x5b8(0x04)
	float MinHealthRatioToShowMedicineFX; // 0x5bc(0x04)
	struct TSoftObjectPtr<UParticleSystem> RevivePickupFX; // 0x5c0(0x28)
	struct TSoftObjectPtr<UParticleSystem> ReviveClearFX; // 0x5e8(0x28)
	int32_t ResurrectTextID; // 0x610(0x04)
	float ResurrectTime; // 0x614(0x04)
	struct TArray<struct TSoftObjectPtr<UParticleSystem>> ShieldUpgradeBodyLoopFXTemplate; // 0x618(0x10)
	struct TArray<struct TSoftObjectPtr<UParticleSystem>> ShieldUpgradeBodyEndFXTemplate; // 0x628(0x10)
	char pad_638[0x8]; // 0x638(0x08)
	struct FOperatorMeshPreset ShieldOperatorPreset; // 0x640(0x120)
	struct UCurveFloat* ShieldOperatorExpandCurve; // 0x760(0x08)
	struct UCurveFloat* ShieldOperatorNarrowCurve; // 0x768(0x08)
	struct FName EffectAttachBone; // 0x770(0x08)
	struct FString ShieldRechargeEffect; // 0x778(0x10)
	struct FString ShieldBrokenEffect; // 0x788(0x10)
	float HitEffectOffset; // 0x798(0x04)
	int32_t ShieldRechargeTextID; // 0x79c(0x04)
	int32_t ShieldRechargePassiveTextID; // 0x7a0(0x04)
	struct FName ShieldReduceScreenEffectID; // 0x7a4(0x08)
	struct FName ShieldBrokenScreenEffectID; // 0x7ac(0x08)
	char pad_7B4[0x4]; // 0x7b4(0x04)
	struct USkeletalMeshComponentConfig* FirstPersonMeshConfig; // 0x7b8(0x08)
	float BaseGunCollisionTraceDis; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	struct TMap<enum class ECharacterBodyScaleType, float> GunCollisionTraceStartHighIdle; // 0x7c8(0x50)
	struct TMap<enum class ECharacterBodyScaleType, float> GunCollisionTraceStartHighCrouch; // 0x818(0x50)
	float MinDistanceGun2Wall; // 0x868(0x04)
	float GunCollisionXYAdjustDownSide; // 0x86c(0x04)
	float GunCollisionCheckZLimit; // 0x870(0x04)
	char pad_874[0x4]; // 0x874(0x04)
	struct UWeaponSystemPlayer* WeaponSystemPlayerClass; // 0x878(0x08)
	struct UWeaponSystemPlayerAI* WeaponSystemAIClass; // 0x880(0x08)
	struct UMapMarkBase* TrackingMarkWidgetClass; // 0x888(0x08)
	struct FVector WeaponAimStartOffset; // 0x890(0x0c)
	char pad_89C[0x4]; // 0x89c(0x04)
	struct FGameplayTagContainer AbilitiesToCancelOnPressingWeaponAction; // 0x8a0(0x20)
	float DefaultHitTraceLifetime; // 0x8c0(0x04)
	char pad_8C4[0x4]; // 0x8c4(0x04)
	struct UCurveFloat* DefaultHitTraceWidgetScaleCurve; // 0x8c8(0x08)
	float SniperHitTraceLifetime; // 0x8d0(0x04)
	char pad_8D4[0x4]; // 0x8d4(0x04)
	struct UCurveFloat* SniperHitTraceWidgetScaleCurve; // 0x8d8(0x08)
	float MeleeHitTraceLifetime; // 0x8e0(0x04)
	float VehicleHitTraceLifetime; // 0x8e4(0x04)
	struct UCurveFloat* VehicleHitTraceWidgetScaleCurve; // 0x8e8(0x08)
	struct FVehicleRepairToolMeshPreset VehicleRepairToolMeshPreset; // 0x8f0(0x50)
	int32_t RepairWeakPointTextID; // 0x940(0x04)
	char pad_944[0x4]; // 0x944(0x04)
	struct UActorEffect* VehicleStealthEffectClass; // 0x948(0x08)
	struct FTeammateHUDPreset TeammateHUDPreset; // 0x950(0x20)
	float HUDZNomral; // 0x970(0x04)
	float HUDZSwim; // 0x974(0x04)
	float HUDZCrouch; // 0x978(0x04)
	float HUDZCrawl; // 0x97c(0x04)
	float HUDChangeTime; // 0x980(0x04)
	float HUDChangeSpeed; // 0x984(0x04)
	float CheckHUDDistanceToCenter; // 0x988(0x04)
	float HUDTranslucentValue; // 0x98c(0x04)
	struct USolarTeammateHUDWidgetComponent* HUDComponentClass; // 0x990(0x08)
	struct URadarScanSoundDataAsset* RadarScanSoundDataAsset; // 0x998(0x08)
	struct FName RadarScannedEffectID; // 0x9a0(0x08)
	struct FGameplayCueTag RadarDetectedEffectCueTag; // 0x9a8(0x08)
	struct FGameplayCueTag RadarDetectedInSmokeEffectCueTag; // 0x9b0(0x08)
	struct UStaticMeshComponent* MassInvisibilityWarningIconClass; // 0x9b8(0x08)
	struct TSoftObjectPtr<UTexture2D> CharacterMassInvisibilityWarningIcon; // 0x9c0(0x28)
	struct TSoftObjectPtr<UTexture2D> VehicleMassInvisibilityWarningIcon; // 0x9e8(0x28)
	struct FVector MassInvWarningIconScale; // 0xa10(0x0c)
	struct FVector MassInvWarningIconOffsetDefault; // 0xa1c(0x0c)
	struct FVector MassInvWarningIconOffsetCrouch; // 0xa28(0x0c)
	struct FVector MassInvWarningIconOffsetCrawl; // 0xa34(0x0c)
	float MassInvWarningIconOffsetSmoothSpeed; // 0xa40(0x04)
	float MassInvWarningIconOffsetForceNoSmoothDistance; // 0xa44(0x04)
	struct UScoutEnemyConfig* ScoutEnemyConfig; // 0xa48(0x08)
	bool bEnableEMPBlockChargeNotice; // 0xa50(0x01)
	char pad_A51[0x7]; // 0xa51(0x07)
	struct UGyroscopeConfig* GyroscopeConfig; // 0xa58(0x08)
	float CheckInRoomInterval; // 0xa60(0x04)
	float DamageLimitTime; // 0xa64(0x04)
	float DamagingDuration; // 0xa68(0x04)
	struct FName DissolvedDeathFXBindingSocketName; // 0xa6c(0x08)
	char pad_A74[0x4]; // 0xa74(0x04)
	struct TArray<struct UActorEffect*> PersistentActorEffectClasses; // 0xa78(0x10)
	struct FName HealthReduceScreenEffectID; // 0xa88(0x08)
	struct FName HealthLowScreenEffectID; // 0xa90(0x08)
	float HealthLowTipThreshold; // 0xa98(0x04)
	char pad_A9C[0x4]; // 0xa9c(0x04)
	struct UGameplayEffect* EnterBattleEffect; // 0xaa0(0x08)
	struct UGameplayEffect* EnterCombatEffect; // 0xaa8(0x08)
};

// Class Solarland.CharacterMVPConfig
// Size: 0x60 (Inherited: 0x30)
struct UCharacterMVPConfig : UDataAsset {
	struct FSoftObjectPath AnimPath; // 0x30(0x18)
	struct FSoftObjectPath LevelPath; // 0x48(0x18)
};

// Class Solarland.CharacterSkillAttributeSet
// Size: 0xf0 (Inherited: 0x30)
struct UCharacterSkillAttributeSet : USolarAttributeSet {
	struct FGameplayAttributeData TacticalSkillCD; // 0x30(0x10)
	struct FGameplayAttributeData TacticalSkillCDBase; // 0x40(0x10)
	struct FGameplayAttributeData TacticalSkillCDParamA; // 0x50(0x10)
	struct FGameplayAttributeData TacticalSkillCDParamB; // 0x60(0x10)
	struct FGameplayAttributeData TacticalSkillCDFixedValue; // 0x70(0x10)
	struct FGameplayAttributeData SuperSkillCD; // 0x80(0x10)
	struct FGameplayAttributeData SuperSkillCDBase; // 0x90(0x10)
	struct FGameplayAttributeData SuperSkillCDParamA; // 0xa0(0x10)
	struct FGameplayAttributeData SuperSkillCDParamB; // 0xb0(0x10)
	struct FGameplayAttributeData SuperSkillCDFixedValue; // 0xc0(0x10)
	struct FGameplayAttributeData ScoutEnemyTimeRequired; // 0xd0(0x10)
	struct FGameplayAttributeData ScoutEnemyDuration; // 0xe0(0x10)

	void OnRep_TacticalSkillCDParamB(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDParamB // (Native|Protected|HasOutParms) // @ game+0x202dc20
	void OnRep_TacticalSkillCDParamA(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDParamA // (Native|Protected|HasOutParms) // @ game+0x200ae30
	void OnRep_TacticalSkillCDFixedValue(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDFixedValue // (Native|Protected|HasOutParms) // @ game+0x202da20
	void OnRep_TacticalSkillCDBase(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDBase // (Native|Protected|HasOutParms) // @ game+0x200aee0
	void OnRep_SuperSkillCDParamB(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDParamB // (Native|Protected|HasOutParms) // @ game+0x20349c0
	void OnRep_SuperSkillCDParamA(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDParamA // (Native|Protected|HasOutParms) // @ game+0x202db70
	void OnRep_SuperSkillCDFixedValue(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDFixedValue // (Native|Protected|HasOutParms) // @ game+0x2034910
	void OnRep_SuperSkillCDBase(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDBase // (Native|Protected|HasOutParms) // @ game+0x202d6f0
	void OnRep_ScoutEnemyTimeRequired(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_ScoutEnemyTimeRequired // (Native|Protected|HasOutParms) // @ game+0x2034860
	void OnRep_ScoutEnemyDuration(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_ScoutEnemyDuration // (Native|Protected|HasOutParms) // @ game+0x20347b0
};

// Class Solarland.CharacterSkinConfig
// Size: 0x1c8 (Inherited: 0x30)
struct UCharacterSkinConfig : UDataAsset {
	struct FSoftObjectPath SkinIcon; // 0x30(0x18)
	struct FSoftObjectPath DefaultIcon; // 0x48(0x18)
	struct FSoftObjectPath SkinRes; // 0x60(0x18)
	struct FSoftObjectPath CharaSkinRes; // 0x78(0x18)
	struct FSoftObjectPath ShieldRes; // 0x90(0x18)
	struct FSoftObjectPath InvincibleMAT; // 0xa8(0x18)
	struct FSoftClassPath AnimBPRes; // 0xc0(0x18)
	struct TMap<struct FGameplayTag, struct FStaticMeshOrnamentConfig> StaticMeshOrnamentsConfig; // 0xd8(0x50)
	struct TMap<struct FGameplayTag, struct FSkeletalMeshOrnamentConfig> SkeletalMeshOrnamentsConfig; // 0x128(0x50)
	struct TMap<struct FGameplayTag, struct FChildActorOrnamentConfig> ChildActorOrnamentsConfig; // 0x178(0x50)

	struct TMap<struct FGameplayTag, struct FStaticMeshOrnamentConfig> GetStaticMeshOrnamentsConfig(); // Function Solarland.CharacterSkinConfig.GetStaticMeshOrnamentsConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x20340c0
	struct FSoftObjectPath GetSkinRes(); // Function Solarland.CharacterSkinConfig.GetSkinRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x2034090
	struct FSoftObjectPath GetSkinIcon(); // Function Solarland.CharacterSkinConfig.GetSkinIcon // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x2034060
	struct TMap<struct FGameplayTag, struct FSkeletalMeshOrnamentConfig> GetSkeletalMeshOrnamentsConfig(); // Function Solarland.CharacterSkinConfig.GetSkeletalMeshOrnamentsConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2033fc0
	struct FSoftObjectPath GetInvincibleMAT(); // Function Solarland.CharacterSkinConfig.GetInvincibleMAT // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x2033e70
	struct TMap<struct FGameplayTag, struct FChildActorOrnamentConfig> GetChildActorOrnamentsConfig(); // Function Solarland.CharacterSkinConfig.GetChildActorOrnamentsConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2033d80
	struct FSoftObjectPath GetCharaSkinRes(); // Function Solarland.CharacterSkinConfig.GetCharaSkinRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x2033d50
	struct FSoftObjectPath GetAnimBPRes(); // Function Solarland.CharacterSkinConfig.GetAnimBPRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x2033d20
};

// Class Solarland.SoundGroupBase
// Size: 0x28 (Inherited: 0x28)
struct USoundGroupBase : UObject {
};

// Class Solarland.SoundGroupSimple
// Size: 0x38 (Inherited: 0x28)
struct USoundGroupSimple : USoundGroupBase {
	struct FString SoundEvent; // 0x28(0x10)
};

// Class Solarland.SoundGroupByTeammate
// Size: 0x58 (Inherited: 0x28)
struct USoundGroupByTeammate : USoundGroupBase {
	struct FString SelfEvent; // 0x28(0x10)
	struct FString TeammateEvent; // 0x38(0x10)
	struct FString OtherEvent; // 0x48(0x10)
};

// Class Solarland.SoundGroupByBattle
// Size: 0x58 (Inherited: 0x28)
struct USoundGroupByBattle : USoundGroupBase {
	struct FString IAttackOtherEvent; // 0x28(0x10)
	struct FString OtherAttackMeEvent; // 0x38(0x10)
	struct FString OtherEvent; // 0x48(0x10)
};

// Class Solarland.CharacterSoundConfig
// Size: 0x150 (Inherited: 0x30)
struct UCharacterSoundConfig : UDataAsset {
	struct TMap<enum class ECharacterSoundOpt, struct FString> SoundEventTable; // 0x30(0x50)
	struct TMap<struct FName, struct USoundGroupBase*> SoundGroupTable; // 0x80(0x50)
	struct TMap<enum class EPhysicalSurface, struct FName> SurfaceTypeToHitByBulletSoundGroup; // 0xd0(0x50)
	struct FTransform DefaultTransform; // 0x120(0x30)
};

// Class Solarland.CheckBoxGroup
// Size: 0x1c0 (Inherited: 0x160)
struct UCheckBoxGroup : UNamedSlot {
	struct FMulticastInlineDelegate OnStateChangedEvent; // 0x160(0x10)
	struct FMulticastInlineDelegate OnStateChangedEventEx; // 0x170(0x10)
	struct UCheckBox* RevertToCachedChild; // 0x180(0x08)
	struct UCheckBox* LastCheckedChild; // 0x188(0x08)
	struct UPanelWidget* GroupRoot; // 0x190(0x08)
	bool bAllowSwitchOff; // 0x198(0x01)
	enum class EUseType UseType; // 0x199(0x01)
	char pad_19A[0x6]; // 0x19a(0x06)
	struct TArray<struct UCheckBox*> CheckBoxList; // 0x1a0(0x10)
	char pad_1B0[0x10]; // 0x1b0(0x10)

	void SetSelectIndex(int32_t Index); // Function Solarland.CheckBoxGroup.SetSelectIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x2034dc0
	void RevertLastCheck(); // Function Solarland.CheckBoxGroup.RevertLastCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x2034d00
	bool RemoveGroupChild(struct UCheckBox* Child); // Function Solarland.CheckBoxGroup.RemoveGroupChild // (Final|Native|Public|BlueprintCallable) // @ game+0x2034b90
	void OnStateChanged(bool bIsChecked); // Function Solarland.CheckBoxGroup.OnStateChanged // (Final|Native|Protected) // @ game+0x2034a70
	int32_t GetSelectedIndex(); // Function Solarland.CheckBoxGroup.GetSelectedIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x2033f90
	void CleanCheckedState(); // Function Solarland.CheckBoxGroup.CleanCheckedState // (Final|Native|Public|BlueprintCallable) // @ game+0x2033c10
	struct TArray<struct UCheckBox*> CheckChildrenState(int32_t& CheckedChildIndex); // Function Solarland.CheckBoxGroup.CheckChildrenState // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2033b30
	bool AddGroupChild(struct UCheckBox* Child); // Function Solarland.CheckBoxGroup.AddGroupChild // (Final|Native|Public|BlueprintCallable) // @ game+0x2033a90
};

// Class Solarland.ChooseWeaponItemObject
// Size: 0xb0 (Inherited: 0x28)
struct UChooseWeaponItemObject : UObject {
	char pad_28[0x88]; // 0x28(0x88)
};

// Class Solarland.ChooseWeaponItemWidget
// Size: 0x368 (Inherited: 0x348)
struct UChooseWeaponItemWidget : USolarUserWidget {
	char pad_348[0x8]; // 0x348(0x08)
	struct USolarButton* Btn_Collect; // 0x350(0x08)
	struct USolarButton* Btn_Select; // 0x358(0x08)
	struct FChooseWeaponItemState UiState; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)

	void SelectWeapon(); // Function Solarland.ChooseWeaponItemWidget.SelectWeapon // (Final|Native|Protected) // @ game+0x2034da0
	void K2_OnUIStateChanged(struct FChooseWeaponItemState& NewState); // Function Solarland.ChooseWeaponItemWidget.K2_OnUIStateChanged // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void K2_InitWidget(struct FChooseWeaponItemData& InData); // Function Solarland.ChooseWeaponItemWidget.K2_InitWidget // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	bool K2_GetWeaponUIIcon(int32_t InWeaponTypeId, struct FSoftObjectPath& OutPath); // Function Solarland.ChooseWeaponItemWidget.K2_GetWeaponUIIcon // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x2034510
	void CollectWeapon(); // Function Solarland.ChooseWeaponItemWidget.CollectWeapon // (Final|Native|Protected) // @ game+0x2033c30
};

// Class Solarland.ChooseWeaponWidget
// Size: 0x4c8 (Inherited: 0x348)
struct UChooseWeaponWidget : USolarUserWidget {
	char pad_348[0x18]; // 0x348(0x18)
	struct UTileView* WeaponList; // 0x360(0x08)
	struct UWeaponChosenWidget* WeaponChosen_2; // 0x368(0x08)
	struct UWeaponChosenWidget* WeaponChosen_3; // 0x370(0x08)
	struct TMap<int32_t, struct FChooseWeaponItemData> WeaponDatasMap; // 0x378(0x50)
	struct TMap<int32_t, struct UChooseWeaponItemObject*> ListWeapons; // 0x3c8(0x50)
	struct TMap<enum class EWeaponEquipSlot, struct UWeaponChosenWidget*> EquippedWeaponWidgetMap; // 0x418(0x50)
	struct TSet<int32_t> CollectedWeapons; // 0x468(0x50)
	char pad_4B8[0x4]; // 0x4b8(0x04)
	struct FName CloseActionName; // 0x4bc(0x08)
	char pad_4C4[0x4]; // 0x4c4(0x04)

	void SelectEquipSlot(enum class EWeaponEquipSlot InSlot); // Function Solarland.ChooseWeaponWidget.SelectEquipSlot // (Final|Native|Public|BlueprintCallable) // @ game+0x2034d20
	void ResetChosenWidget(bool bResetFirst, bool bResetSecond); // Function Solarland.ChooseWeaponWidget.ResetChosenWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x2034c30
	void RefreshWeaponList(bool bForce); // Function Solarland.ChooseWeaponWidget.RefreshWeaponList // (Final|Native|Protected) // @ game+0x2034b00
	void OnSelfOpened(); // Function Solarland.ChooseWeaponWidget.OnSelfOpened // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnRequestCollectWeapon(int32_t InWeaponID, bool bInCollected); // Function Solarland.ChooseWeaponWidget.OnRequestCollectWeapon // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnListWeaponSelected(int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.OnListWeaponSelected // (Final|Native|Protected) // @ game+0x2034720
	void OnListWeaponCollected(int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.OnListWeaponCollected // (Final|Native|Protected) // @ game+0x2034690
	void OnEquipSlotSelected(enum class EWeaponEquipSlot InSlot); // Function Solarland.ChooseWeaponWidget.OnEquipSlotSelected // (Final|Native|Protected) // @ game+0x2034610
	void K2_EquipWeapon(enum class EWeaponEquipSlot InSlot, int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.K2_EquipWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x2034440
	void InitWeaponList(struct TArray<struct FChooseWeaponItemData>& InList); // Function Solarland.ChooseWeaponWidget.InitWeaponList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2034300
	int32_t GetWeaponSkinId(int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.GetWeaponSkinId // (Event|Public|BlueprintEvent) // @ game+0x2649560
	struct UChooseWeaponItemWidget* GetListWidgetByWeaponId(int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.GetListWidgetByWeaponId // (Final|Native|Protected|Const) // @ game+0x2033ef0
	struct TArray<struct FChooseWeaponItemData> GetListWeapons(); // Function Solarland.ChooseWeaponWidget.GetListWeapons // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2033ea0
	struct TArray<struct FChooseWeaponItemData> GetEquippedWeaponData(); // Function Solarland.ChooseWeaponWidget.GetEquippedWeaponData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2033e20
	struct TArray<int32_t> GetCollectedWeaponsFormPlayerData(); // Function Solarland.ChooseWeaponWidget.GetCollectedWeaponsFormPlayerData // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void EquipWeapon(enum class EWeaponEquipSlot InSlot, int32_t InWeaponID); // Function Solarland.ChooseWeaponWidget.EquipWeapon // (Final|Native|Protected) // @ game+0x2033c50
};

// Class Solarland.CircleCardView
// Size: 0x228 (Inherited: 0x228)
struct UCircleCardView : UCardView {
};

// Class Solarland.CommonTwiceConfirmBaseWidget
// Size: 0x348 (Inherited: 0x348)
struct UCommonTwiceConfirmBaseWidget : USolarUserWidget {
};

// Class Solarland.ComponentButtonBaseWidget
// Size: 0x350 (Inherited: 0x348)
struct UComponentButtonBaseWidget : USolarUserWidget {
	struct USolarButton* OperateArea; // 0x348(0x08)
};

// Class Solarland.CrashReportManager
// Size: 0x50 (Inherited: 0x28)
struct UCrashReportManager : UObject {
	char pad_28[0x28]; // 0x28(0x28)

	void SetUserID(struct FString InUserId); // Function Solarland.CrashReportManager.SetUserID // (Final|Native|Public) // @ game+0x203ad00
	void SetDeviceUUID(struct FString InDeviceUUID); // Function Solarland.CrashReportManager.SetDeviceUUID // (Final|Native|Public) // @ game+0x203ac60
	void ReportLuaException(struct FString ErrorMsg, struct FString Traceback, bool bHandled); // Function Solarland.CrashReportManager.ReportLuaException // (Final|Native|Static|Public) // @ game+0x203ab30
};

// Class Solarland.CrosshairCanvasPanel
// Size: 0x228 (Inherited: 0x168)
struct UCrosshairCanvasPanel : UCanvasPanel {
	struct TMap<enum class ECrossHairState, struct FStateMapItemStruct> CrosshairStateConfigList; // 0x168(0x50)
	struct TArray<struct UWidget*> IgonreWidgetToStateMap; // 0x1b8(0x10)
	struct TArray<struct FUICrossHairSpreadStruct> SpreadItemList; // 0x1c8(0x10)
	struct TArray<struct FUICrossHairAimColorStruct> AimColorItemList; // 0x1d8(0x10)
	struct UTweenImage* ReloadingTween; // 0x1e8(0x08)
	struct UGaugeImage* BulletGauge; // 0x1f0(0x08)
	struct UTweenImage* OverloadingTween; // 0x1f8(0x08)
	struct UProgressBar* OverloadBar_Normal; // 0x200(0x08)
	struct UProgressBar* OverloadBar_Warn; // 0x208(0x08)
	struct UTweenWidget* OverloadNormalPanelTween; // 0x210(0x08)
	struct TArray<struct UProgressBar*> CoolDownBars; // 0x218(0x10)
};

// Class Solarland.CrossHairWidget
// Size: 0x300 (Inherited: 0x260)
struct UCrossHairWidget : UUserWidget {
	struct TMap<enum class EWeaponType, struct FCrosshairLayout> CrosshairStorageLayout; // 0x260(0x50)
	struct FCrosshairSprite CrosshairSprites; // 0x2b0(0x30)
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UCrosshairCanvasPanel* RootPanel; // 0x2e8(0x08)
	float MinSpread; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct FCrosshairLayout CurrentLayout; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)

	void SetCrosshairSprite(struct UPaperSprite* InSprite); // Function Solarland.CrossHairWidget.SetCrosshairSprite // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnWeaponFired(); // Function Solarland.CrossHairWidget.OnWeaponFired // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnUpdateReloadProgress(float InReloadProgress, int32_t InReservedAmmo, int32_t InMaxAmmo); // Function Solarland.CrossHairWidget.OnUpdateReloadProgress // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnUpdateGatlingRoll(float DeltaTmie, float InRollSpeedInterp, bool bWantFire); // Function Solarland.CrossHairWidget.OnUpdateGatlingRoll // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnUpdateCoolDownProgress(float InCoolDownProgress); // Function Solarland.CrossHairWidget.OnUpdateCoolDownProgress // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnUpdateChargeProgress(bool InbCharging, int32_t InChargeMode, float InChargeProgress, int32_t InChargeBurstCount); // Function Solarland.CrossHairWidget.OnUpdateChargeProgress // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnUpdateAimState(bool InbLockEnemy); // Function Solarland.CrossHairWidget.OnUpdateAimState // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnReloadStarted(float InReloadTime, int32_t InReservedAmmo); // Function Solarland.CrossHairWidget.OnReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnReloadFinished(bool InbReloadSuccess, int32_t InReloadAmmo, int32_t InReservedAmmo, int32_t InMaxAmmo); // Function Solarland.CrossHairWidget.OnReloadFinished // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnPlayWeaponSpecialFire(enum class ECrossHairSpecialFireState InState, float PlayRate); // Function Solarland.CrossHairWidget.OnPlayWeaponSpecialFire // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnOverloadStateChanged(bool bEnter); // Function Solarland.CrossHairWidget.OnOverloadStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnCrosshairInNormalState(); // Function Solarland.CrossHairWidget.OnCrosshairInNormalState // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void OnAmmoChanged(int32_t InReservedAmmo, int32_t InMaxAmmo, bool InbFirst); // Function Solarland.CrossHairWidget.OnAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void InitializeCrosshairSpread(float Spread); // Function Solarland.CrossHairWidget.InitializeCrosshairSpread // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void InitializeCrosshair(enum class EWeaponType WeaponType, bool bIsWeaponEnergy); // Function Solarland.CrossHairWidget.InitializeCrosshair // (Final|Native|Public|BlueprintCallable) // @ game+0x203a450
	void HandleCrosshairState(enum class ECrossHairState InCrosshairState, bool InbQuitState); // Function Solarland.CrossHairWidget.HandleCrosshairState // (Final|Native|Protected) // @ game+0x203a380
	struct UWidget* GetSpreadCanvasWidget(); // Function Solarland.CrossHairWidget.GetSpreadCanvasWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct UUserWidget* GetReloadWidget(); // Function Solarland.CrossHairWidget.GetReloadWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct UUserWidget* GetOverloadWidget(); // Function Solarland.CrossHairWidget.GetOverloadWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct UUserWidget* GetCoolDownWidget(); // Function Solarland.CrossHairWidget.GetCoolDownWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct UUserWidget* GetChargeWidget(); // Function Solarland.CrossHairWidget.GetChargeWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct UUserWidget* GetAmmoWidget(); // Function Solarland.CrossHairWidget.GetAmmoWidget // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	struct FVector2D CalcDeltaScaleBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaScaleBySpread // (Native|Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x2039880
	struct FVector2D CalcDeltaPosBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaPosBySpread // (Native|Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x20397e0
	float CalcDeltaAngleBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaAngleBySpread // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x2039740
};

// Class Solarland.CruiseAssetSet
// Size: 0x58 (Inherited: 0x30)
struct UCruiseAssetSet : UDataAsset {
	struct FSoftClassPath CapsuleActorClass; // 0x30(0x18)
	struct TArray<struct FSoftClassPath> CruiseAbilityClasses; // 0x48(0x10)
};

// Class Solarland.CurvedEffectController
// Size: 0xc8 (Inherited: 0x28)
struct UCurvedEffectController : UActorEffectController {
	struct FRuntimeFloatCurve ProgressCurve; // 0x28(0x88)
	enum class ECurvedEffectControllerStopMode StopMode; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	float StopTime; // 0xb4(0x04)
	char pad_B8[0x10]; // 0xb8(0x10)
};

// Class Solarland.CustomConsoleCommandsComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UCustomConsoleCommandsComponent : UActorComponent {

	void ExecGMCommand(struct FString CommandParameters, struct TArray<struct FString>& ArgsStr); // Function Solarland.CustomConsoleCommandsComponent.ExecGMCommand // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
};

// Class Solarland.CustomGameModeHUD
// Size: 0x398 (Inherited: 0x398)
struct ACustomGameModeHUD : ABattleHUDBase {

	struct TSoftObjectPtr<USolarUserWidget> ShowPanelUI(enum class EUIPanelName PanelName); // Function Solarland.CustomGameModeHUD.ShowPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x203ada0
	void ClosePanelUI(enum class EUIPanelName PanelName); // Function Solarland.CustomGameModeHUD.ClosePanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x2039b80
};

// Class Solarland.CustomNoticeTable
// Size: 0xc8 (Inherited: 0xc8)
struct UCustomNoticeTable : UDataTable {
};

// Class Solarland.CustomNoticeImageTable
// Size: 0xc8 (Inherited: 0xc8)
struct UCustomNoticeImageTable : UDataTable {
};

// Class Solarland.GameManagerBase
// Size: 0x228 (Inherited: 0x228)
struct AGameManagerBase : AInfo {
};

// Class Solarland.CustomRoomManager
// Size: 0x418 (Inherited: 0x228)
struct ACustomRoomManager : AGameManagerBase {
	int32_t RoomTeamMemberLimit; // 0x228(0x04)
	int32_t RoomLeftTime; // 0x22c(0x04)
	bool bIsGameStarted; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)
	struct FString JobName; // 0x238(0x10)
	bool bIsWeaponSettingOpen; // 0x248(0x01)
	bool bIsVehicleSettingOpen; // 0x249(0x01)
	char pad_24A[0x6]; // 0x24a(0x06)
	struct TMap<struct FString, struct FCustomParamConfig> CustomParamConfigMap; // 0x250(0x50)
	struct TArray<struct FUserSetting> UserSettingList; // 0x2a0(0x10)
	struct TArray<char> WeaponTypeAvailableList; // 0x2b0(0x10)
	struct TArray<char> VehicleClassAvailableList; // 0x2c0(0x10)
	struct TArray<int32_t> WeaponSettingBlacklist; // 0x2d0(0x10)
	struct TArray<int32_t> VehicleTypeSettingBlacklist; // 0x2e0(0x10)
	struct FMulticastInlineDelegate WeaponTypeAvailableChangedEvent; // 0x2f0(0x10)
	struct FMulticastInlineDelegate WeaponSettingBlacklistChangedEvent; // 0x300(0x10)
	struct FMulticastInlineDelegate VehicleClassAvailableChangedEvent; // 0x310(0x10)
	struct FMulticastInlineDelegate VehicleTypeSettingBlacklistChangedEvent; // 0x320(0x10)
	char pad_330[0xe8]; // 0x330(0xe8)

	void WeaponTypeAvailableChangedEvent__DelegateSignature(struct TArray<char>& WeaponTypeAvailableList); // DelegateFunction Solarland.CustomRoomManager.WeaponTypeAvailableChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2649560
	void WeaponSettingBlacklistChangedEvent__DelegateSignature(struct TArray<int32_t>& WeaponSettingBlacklist); // DelegateFunction Solarland.CustomRoomManager.WeaponSettingBlacklistChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2649560
	void VehicleTypeSettingBlacklistChangedEvent__DelegateSignature(struct TArray<int32_t>& VehicleTypeSettingBlacklist); // DelegateFunction Solarland.CustomRoomManager.VehicleTypeSettingBlacklistChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2649560
	void VehicleClassAvailableChangedEvent__DelegateSignature(struct TArray<char>& VehicleClassAvailableList); // DelegateFunction Solarland.CustomRoomManager.VehicleClassAvailableChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2649560
	void ReceiveUserSettingChanged(struct FString Name, struct FString Value); // Function Solarland.CustomRoomManager.ReceiveUserSettingChanged // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x203aa30
	void ReceiveTournamentDealy(); // Function Solarland.CustomRoomManager.ReceiveTournamentDealy // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1571170
	void ReceivePlayerRemoved(struct ASCMPlayerState* Player, enum class ERemovedReasonType reason); // Function Solarland.CustomRoomManager.ReceivePlayerRemoved // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x203a960
	void OnUserSettingChangedEvent(struct FString Name, struct FCustomParamConfig ConfigInfo, struct FString Value); // Function Solarland.CustomRoomManager.OnUserSettingChangedEvent // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnTournamentDealy(); // Function Solarland.CustomRoomManager.OnTournamentDealy // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnRoomOwnerLeftRoom(); // Function Solarland.CustomRoomManager.OnRoomOwnerLeftRoom // (Final|Native|Public|BlueprintCallable) // @ game+0x203a940
	void OnRep_WeaponTypeAvailableList(); // Function Solarland.CustomRoomManager.OnRep_WeaponTypeAvailableList // (Final|Native|Private) // @ game+0x203a920
	void OnRep_WeaponSettingBlacklist(); // Function Solarland.CustomRoomManager.OnRep_WeaponSettingBlacklist // (Final|Native|Private) // @ game+0x203a900
	void OnRep_VehicleTypeSettingBlacklist(); // Function Solarland.CustomRoomManager.OnRep_VehicleTypeSettingBlacklist // (Final|Native|Private) // @ game+0x203a8e0
	void OnRep_VehicleClassAvailableList(); // Function Solarland.CustomRoomManager.OnRep_VehicleClassAvailableList // (Final|Native|Private) // @ game+0x203a8c0
	void OnPlayerRemovedFromRoom(struct ASCMPlayerState* Player, enum class ERemovedReasonType reason); // Function Solarland.CustomRoomManager.OnPlayerRemovedFromRoom // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	bool OnGameStart(); // Function Solarland.CustomRoomManager.OnGameStart // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnClientRoomDataReady(); // Function Solarland.CustomRoomManager.OnClientRoomDataReady // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	bool IsWeaponTypeAvailable(char WeaponType); // Function Solarland.CustomRoomManager.IsWeaponTypeAvailable // (Final|Native|Public) // @ game+0x203a830
	bool IsWeaponSettingOpen(); // Function Solarland.CustomRoomManager.IsWeaponSettingOpen // (Final|Native|Public) // @ game+0x203a810
	bool IsWeaponAvailable(int32_t weaponid); // Function Solarland.CustomRoomManager.IsWeaponAvailable // (Final|Native|Public) // @ game+0x203a770
	bool IsVehicleTypeAvailable(int32_t VehicleTypeID); // Function Solarland.CustomRoomManager.IsVehicleTypeAvailable // (Final|Native|Public) // @ game+0x203a6d0
	bool IsVehicleSettingOpen(); // Function Solarland.CustomRoomManager.IsVehicleSettingOpen // (Final|Native|Public) // @ game+0x203a6b0
	bool IsVehicleClassAvailable(char VehicleClassValue); // Function Solarland.CustomRoomManager.IsVehicleClassAvailable // (Final|Native|Public) // @ game+0x203a620
	bool IsRoomOwner(struct ASCMPlayerState* Player); // Function Solarland.CustomRoomManager.IsRoomOwner // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x203a580
	bool IsRoomHasMinimalSides(); // Function Solarland.CustomRoomManager.IsRoomHasMinimalSides // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x203a550
	bool IsRoomHasEnoughPlayers(); // Function Solarland.CustomRoomManager.IsRoomHasEnoughPlayers // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x203a520
	struct TArray<char> GetWeaponTypeAvailableList(); // Function Solarland.CustomRoomManager.GetWeaponTypeAvailableList // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x203a2b0
	void GetWeaponSettingLists(struct TArray<int32_t>& OutWeaponBlacklist, struct TArray<int32_t>& OutWeaponWhitelist); // Function Solarland.CustomRoomManager.GetWeaponSettingLists // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x203a190
	struct TArray<int32_t> GetWeaponSettingBlacklist(); // Function Solarland.CustomRoomManager.GetWeaponSettingBlacklist // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x203a0c0
	void GetVehicleTypeSettingLists(struct TArray<int32_t>& OutVehicleBlacklist, struct TArray<int32_t>& OutVehicleWhitelist); // Function Solarland.CustomRoomManager.GetVehicleTypeSettingLists // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x2039fa0
	struct TArray<int32_t> GetVehicleTypeSettingBlacklist(); // Function Solarland.CustomRoomManager.GetVehicleTypeSettingBlacklist // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2039ed0
	struct TArray<char> GetVehicleClassAvailableList(); // Function Solarland.CustomRoomManager.GetVehicleClassAvailableList // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2039e00
	struct FString GetModeParam(struct FString Name, struct FCustomParamConfig& ParamInfo); // Function Solarland.CustomRoomManager.GetModeParam // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x2039c00
	void ExecuteGameStart(); // Function Solarland.CustomRoomManager.ExecuteGameStart // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x7debe0
	bool CheckWeaponTypeCanSetting(enum class EWeaponUIType WeaponUIType); // Function Solarland.CustomRoomManager.CheckWeaponTypeCanSetting // (Final|Native|Public) // @ game+0x2039af0
	bool CheckWeaponCanSetting(int32_t weaponid); // Function Solarland.CustomRoomManager.CheckWeaponCanSetting // (Final|Native|Public) // @ game+0x2039a50
	bool CheckVehicleTypeCanSetting(int32_t VehicleTypeID); // Function Solarland.CustomRoomManager.CheckVehicleTypeCanSetting // (Final|Native|Public) // @ game+0x20399b0
	bool CheckVehicleClassCanSetting(enum class EVehicleClass VehicleClass); // Function Solarland.CustomRoomManager.CheckVehicleClassCanSetting // (Final|Native|Public) // @ game+0x2039920
};

// Class Solarland.DeathTreasureBox
// Size: 0x728 (Inherited: 0x5d0)
struct ADeathTreasureBox : ASolarTreasureBoxActor {
	float CharacterPickupRange; // 0x5d0(0x04)
	float CurrEnergyValue; // 0x5d4(0x04)
	float CurrExtraEnergyValue; // 0x5d8(0x04)
	char pad_5DC[0x4]; // 0x5dc(0x04)
	struct FString PlayerId; // 0x5e0(0x10)
	struct FString NickName; // 0x5f0(0x10)
	bool IsPickuped; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct TArray<struct ASolarPlayerWeapon*> WeaponList; // 0x608(0x10)
	struct TArray<struct FBoxChargingInfo> ChargingChars; // 0x618(0x10)
	float PickupRadius; // 0x628(0x04)
	float ResurrectDistance; // 0x62c(0x04)
	enum class EBResurrectionState CurrResurrectionState; // 0x630(0x01)
	char pad_631[0x3]; // 0x631(0x03)
	float ReviveTotalTime; // 0x634(0x04)
	float ReviveStartTime; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct USkeletalMeshComponent* PreViewMesh; // 0x640(0x08)
	struct FName ReviveStartSound; // 0x648(0x08)
	struct FName ReviveBeforeCompleteSound; // 0x650(0x08)
	struct FName ReviveCompleteSound; // 0x658(0x08)
	struct FName ReviveFailedSound; // 0x660(0x08)
	float ResurrectionBeforeSoundTime; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct UParticleSystem* ReviveCompletePS; // 0x670(0x08)
	struct FName ReviveCompletePSAttachedSocket; // 0x678(0x08)
	float PreviewMeshZOffset; // 0x680(0x04)
	float PreviewMeshZRotation; // 0x684(0x04)
	char pad_688[0x10]; // 0x688(0x10)
	struct USceneComponent* FXPosComponent; // 0x698(0x08)
	struct TArray<struct TSoftObjectPtr<UParticleSystem>> QualityPS; // 0x6a0(0x10)
	char pad_6B0[0x10]; // 0x6b0(0x10)
	struct UActorEffect* RevivePreviewEffectClass; // 0x6c0(0x08)
	char pad_6C8[0x8]; // 0x6c8(0x08)
	struct TMap<enum class ECharacterBodyScaleType, struct FSoftObjectPath> PreviewAnim; // 0x6d0(0x50)
	float SphereRadius; // 0x720(0x04)
	float UnpickableSphereRadius; // 0x724(0x04)

	void ReceiveSetUIEnable(bool IsShow); // Function Solarland.DeathTreasureBox.ReceiveSetUIEnable // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void ReceiveRemoveEffect(struct ASolarCharacter* SolarChar); // Function Solarland.DeathTreasureBox.ReceiveRemoveEffect // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void ReceiveRefreshExtraEnergy(struct FString Message); // Function Solarland.DeathTreasureBox.ReceiveRefreshExtraEnergy // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void ReceiveAddEffect(struct ASolarCharacter* SolarChar); // Function Solarland.DeathTreasureBox.ReceiveAddEffect // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void OnUntrigger(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Solarland.DeathTreasureBox.OnUntrigger // (Final|Native|Protected) // @ game+0x203e830
	void OnTrigger(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Solarland.DeathTreasureBox.OnTrigger // (Final|Native|Protected|HasOutParms) // @ game+0x203e610
	void OnRep_ReviveStartTime(); // Function Solarland.DeathTreasureBox.OnRep_ReviveStartTime // (Final|Native|Protected) // @ game+0x203e0d0
	void OnRep_PickupedChanged(); // Function Solarland.DeathTreasureBox.OnRep_PickupedChanged // (Final|Native|Public) // @ game+0x203e0b0
	void OnRep_CurrExtraEnergyValueChanged(); // Function Solarland.DeathTreasureBox.OnRep_CurrExtraEnergyValueChanged // (Final|Native|Public) // @ game+0x203e070
	void OnRep_BResurrectionStateChanged(); // Function Solarland.DeathTreasureBox.OnRep_BResurrectionStateChanged // (Final|Native|Public) // @ game+0x203e050
	void OnRefreshPickupStatusEffect(bool IsShow); // Function Solarland.DeathTreasureBox.OnRefreshPickupStatusEffect // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	bool IsInResurrectRange(struct ASolarCharacter* InReqCharacter, float& RealDistance); // Function Solarland.DeathTreasureBox.IsInResurrectRange // (Final|Native|Public|HasOutParms) // @ game+0x203d9a0
	bool CanBuyResurrect(struct ASolarCharacter* InReqCharacter); // Function Solarland.DeathTreasureBox.CanBuyResurrect // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x203d730
};

// Class Solarland.DeathViewGoodsSlotWidget
// Size: 0x3f8 (Inherited: 0x348)
struct UDeathViewGoodsSlotWidget : USolarUserWidget {
	struct UImage* Img_Icon; // 0x348(0x08)
	struct UTextBlock* Txt_Num; // 0x350(0x08)
	struct FSlateBrush ImageOuter; // 0x358(0x98)
	int32_t ItemID; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)

	void OnSpectateTargetItemsChanged(struct TArray<struct FReplicateItemData> InItemDatas); // Function Solarland.DeathViewGoodsSlotWidget.OnSpectateTargetItemsChanged // (Final|Native|Protected) // @ game+0x203e490
};

// Class Solarland.DeathViewHPWidget
// Size: 0x3d8 (Inherited: 0x348)
struct UDeathViewHPWidget : USolarUserWidget {
	char pad_348[0x28]; // 0x348(0x28)
	bool bSplitHPBar; // 0x370(0x01)
	char pad_371[0x7]; // 0x371(0x07)
	struct USolarShieldProgressBoard* AdvBar_Shield; // 0x378(0x08)
	struct USolarHPProgressBoard* AdvBar_HP; // 0x380(0x08)
	char pad_388[0x20]; // 0x388(0x20)
	struct FLinearColor HPColorNormal; // 0x3a8(0x10)
	struct FLinearColor HPColorDying; // 0x3b8(0x10)
	char pad_3C8[0x10]; // 0x3c8(0x10)

	void UpdateHPBar(float InCurHealth, float InMaxHealth, float InHPGridUnit); // Function Solarland.DeathViewHPWidget.UpdateHPBar // (Final|Native|Protected) // @ game+0x203ec50
	void OnSpecTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarPlayerState* NewTarget); // Function Solarland.DeathViewHPWidget.OnSpecTargetChanged // (Final|Native|Private) // @ game+0x203e330
	void OnShieldValueChanged(struct USinglePlayerShieldModel* ShieldModel); // Function Solarland.DeathViewHPWidget.OnShieldValueChanged // (Final|Native|Public|Const) // @ game+0x203e2a0
	void OnShieldChanged(struct USinglePlayerShieldModel* ShieldModel); // Function Solarland.DeathViewHPWidget.OnShieldChanged // (Final|Native|Public|Const) // @ game+0x203e210
	void OnShieldAvailableChanged(struct USinglePlayerShieldModel* ShieldModel); // Function Solarland.DeathViewHPWidget.OnShieldAvailableChanged // (Final|Native|Public|Const) // @ game+0x203e180
	void OnHPModelChanged(struct USinglePlayerHPModel* HPModel); // Function Solarland.DeathViewHPWidget.OnHPModelChanged // (Final|Native|Private) // @ game+0x203df30
	void OnCharacterEndPlay(struct ASolarCharacter* Character); // Function Solarland.DeathViewHPWidget.OnCharacterEndPlay // (Final|Native|Private) // @ game+0x203dd00
};

// Class Solarland.DeathViewTeammateWidget
// Size: 0x3c0 (Inherited: 0x348)
struct UDeathViewTeammateWidget : USolarUserWidget {
	float SwitchCDTime; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct UUIComponentNationalFlag* UI_Component_NationalFlag; // 0x350(0x08)
	struct USolarUserWidget* UI_Input_Device; // 0x358(0x08)
	struct UTextBlock* Txt_PlayerName; // 0x360(0x08)
	struct UImage* Img_View_Name_Bg; // 0x368(0x08)
	struct UImage* Img_TeamPos; // 0x370(0x08)
	struct UImage* Img_View_TeamPos_Bg; // 0x378(0x08)
	struct USizeBox* Panel_TeamPos; // 0x380(0x08)
	struct UOverlay* Panel_Death; // 0x388(0x08)
	struct UOverlay* Panel_Selected; // 0x390(0x08)
	struct UImage* Img_Loading; // 0x398(0x08)
	struct UWidget* ScaleBox_1; // 0x3a0(0x08)
	struct UWidgetAnimation* Sel_Anim; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct ASolarPlayerState* CurrentPlayerState; // 0x3b8(0x08)

	void TrySelect(); // Function Solarland.DeathViewTeammateWidget.TrySelect // (Final|Native|Private) // @ game+0x203eb60
	void SetTeamPos(int32_t PosInTeam); // Function Solarland.DeathViewTeammateWidget.SetTeamPos // (Event|Public|BlueprintEvent) // @ game+0x2649560
	void SetPlayerState(struct ASolarPlayerState* TargetPS); // Function Solarland.DeathViewTeammateWidget.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x203eab0
	void OnTeammateStateChanged(bool NeedRefresh); // Function Solarland.DeathViewTeammateWidget.OnTeammateStateChanged // (Final|Native|Private) // @ game+0x203e580
	void OnSelectedPlayerChanged(struct ASolarPlayerState* SelectedPS); // Function Solarland.DeathViewTeammateWidget.OnSelectedPlayerChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x203e0f0
	void OnHPChanged(char PosInTeam, float CurHP, float MaxHP); // Function Solarland.DeathViewTeammateWidget.OnHPChanged // (Final|Native|Private) // @ game+0x203de20
	void OnBroadcastModeChanged(); // Function Solarland.DeathViewTeammateWidget.OnBroadcastModeChanged // (Final|Native|Private) // @ game+0x203dce0
};

// Class Solarland.DeathViewWidget
// Size: 0x380 (Inherited: 0x348)
struct UDeathViewWidget : USolarUserWidget {
	char pad_348[0x8]; // 0x348(0x08)
	struct UDeathViewHPWidget* DeathViewHP; // 0x350(0x08)
	struct UCanvasPanel* Panel_ScopeUI; // 0x358(0x08)
	struct USolarTextBlock* Text_PlayerLevel; // 0x360(0x08)
	struct USolarTextBlock* Txt_Lv_Head; // 0x368(0x08)
	struct UImage* Img_Lv_Bg_2; // 0x370(0x08)
	struct UImage* Img_Lv_Border_2; // 0x378(0x08)

	void OnSpecTargetChanged(struct ASolarSpectateInfo* SpectateInfo); // Function Solarland.DeathViewWidget.OnSpecTargetChanged // (Final|Native|Private) // @ game+0x203e400
	void OnLocalSpecInfoReady(struct ASolarSpectateInfo* SpecInfo); // Function Solarland.DeathViewWidget.OnLocalSpecInfoReady // (Final|Native|Private) // @ game+0x203dfc0
	void OnCharacterLevelChanged(int32_t InLevel); // Function Solarland.DeathViewWidget.OnCharacterLevelChanged // (Final|Native|Private) // @ game+0x203dd90
	void AddScopeToPanel(struct UUserWidget* InChildWidget, bool bInSpectate); // Function Solarland.DeathViewWidget.AddScopeToPanel // (Final|Native|Private) // @ game+0x203d660
};

// Class Solarland.DefenderManager
// Size: 0x2b8 (Inherited: 0x228)
struct ADefenderManager : AGameManagerBase {
	struct FMulticastInlineDelegate OnRepDefenderListNotify; // 0x228(0x10)
	struct FTerminatorNotifyUIConfig TerminatorNotifyUIConfig; // 0x238(0x28)
	struct ASolarTrailEffect* TrailEffect; // 0x260(0x08)
	struct FString DefenderSide; // 0x268(0x10)
	struct TArray<struct ASolarPlayerState*> DefenderList; // 0x278(0x10)
	char pad_288[0x8]; // 0x288(0x08)
	struct FString TerminatorPlayerId; // 0x290(0x10)
