// WidgetBlueprintGeneratedClass UI_CustomizeLayout_DirectionControl.UI_CustomizeLayout_DirectionControl_C
// Size: 0x6f8 (Inherited: 0x348)
struct UUI_CustomizeLayout_DirectionControl_C : USolarUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x348(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Cardown_Drag_2; // 0x350(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_CarInfo_Drag; // 0x358(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Carup_Drag; // 0x360(0x08)
	struct USolarButton* BT_ChangeSeat; // 0x368(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Drive_D_Drag; // 0x370(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Drive_R_Drag; // 0x378(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Drive_S_Drag; // 0x380(0x08)
	struct UImage* BT_Driver_Fire; // 0x388(0x08)
	struct UImage* BT_Driver_Fire_3; // 0x390(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Driver_Fire_Drag; // 0x398(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Driver_Fire_Drag_3; // 0x3a0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_DriveShot_Drag; // 0x3a8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_ExitWeapon_Drag; // 0x3b0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Gunsight_Drag; // 0x3b8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_JoystickSprint_Drag; // 0x3c0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Left_Drag_2; // 0x3c8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_OutVehicle_Drag; // 0x3d0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_QuickADS_Drag; // 0x3d8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Reload_Drag; // 0x3e0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Right_Drag_2; // 0x3e8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Skill_Drag_1; // 0x3f0(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Skill_Drag_2; // 0x3f8(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Switch_Drag; // 0x400(0x08)
	struct UUI_Warehouse_DragPanel_C* BT_Trumpet_Drag; // 0x408(0x08)
	struct UUniformGridPanel* GridPanel_Normal; // 0x410(0x08)
	struct UImage* Image; // 0x418(0x08)
	struct UImage* Image_2; // 0x420(0x08)
	struct UImage* Image_3; // 0x428(0x08)
	struct UImage* Image_4; // 0x430(0x08)
	struct UImage* Image_5; // 0x438(0x08)
	struct UImage* Image_6; // 0x440(0x08)
	struct UImage* Image_7; // 0x448(0x08)
	struct UImage* Image_8; // 0x450(0x08)
	struct UImage* Image_9; // 0x458(0x08)
	struct UImage* Image_10; // 0x460(0x08)
	struct UImage* Image_191; // 0x468(0x08)
	struct UImage* Image_242; // 0x470(0x08)
	struct UImage* Image_287; // 0x478(0x08)
	struct UImage* Image_333; // 0x480(0x08)
	struct UImage* Image_390; // 0x488(0x08)
	struct UImage* Image_458; // 0x490(0x08)
	struct UImage* Image_546; // 0x498(0x08)
	struct UImage* Image_792; // 0x4a0(0x08)
	struct UImage* Image_841; // 0x4a8(0x08)
	struct UImage* Image_Reload; // 0x4b0(0x08)
	struct UImage* Image_ReloadBg; // 0x4b8(0x08)
	struct UImage* Img_Bg_2; // 0x4c0(0x08)
	struct UImage* Img_Body_2; // 0x4c8(0x08)
	struct UImage* img_Brand; // 0x4d0(0x08)
	struct UImage* Img_Cardown_2; // 0x4d8(0x08)
	struct UImage* Img_Carup_2; // 0x4e0(0x08)
	struct UImage* Img_Drive_Shot_Bg; // 0x4e8(0x08)
	struct UImage* Img_Drive_Shot_Icon; // 0x4f0(0x08)
	struct UImage* Img_DriverSeat; // 0x4f8(0x08)
	struct UImage* Img_Exit; // 0x500(0x08)
	struct UImage* Img_Icon_2; // 0x508(0x08)
	struct UImage* Img_Icon_3; // 0x510(0x08)
	struct UImage* Img_JoystickSprint_Select; // 0x518(0x08)
	struct UImage* img_Select; // 0x520(0x08)
	struct UImage* img_Select_2; // 0x528(0x08)
	struct UImage* img_Select_5; // 0x530(0x08)
	struct UImage* img_Select_6; // 0x538(0x08)
	struct UImage* img_Select_7; // 0x540(0x08)
	struct UImage* img_Select_8; // 0x548(0x08)
	struct UImage* img_Select_9; // 0x550(0x08)
	struct UImage* img_Select_10; // 0x558(0x08)
	struct UImage* img_Select_11; // 0x560(0x08)
	struct UImage* img_Select_12; // 0x568(0x08)
	struct UImage* img_Select_13; // 0x570(0x08)
	struct UImage* img_Select_14; // 0x578(0x08)
	struct UImage* img_Select_15; // 0x580(0x08)
	struct UImage* img_Select_16; // 0x588(0x08)
	struct UImage* img_Select_17; // 0x590(0x08)
	struct UImage* img_Select_18; // 0x598(0x08)
	struct UImage* img_Select_19; // 0x5a0(0x08)
	struct UImage* img_Select_25; // 0x5a8(0x08)
	struct UImage* Img_Select_CarInfo; // 0x5b0(0x08)
	struct UImage* Img_Select_QuickADS; // 0x5b8(0x08)
	struct UImage* Img_SkillOuter; // 0x5c0(0x08)
	struct UImage* Img_SkillOuter_2; // 0x5c8(0x08)
	struct UImage* Img_WeakPoint; // 0x5d0(0x08)
	struct UImage* Img_WeakPoint_6; // 0x5d8(0x08)
	struct UImage* Img_WeakPoint_7; // 0x5e0(0x08)
	struct UImage* Img_WeakPoint_8; // 0x5e8(0x08)
	struct UUI_Customize_Data_C* LayoutData; // 0x5f0(0x08)
	struct UCanvasPanel* Panel_CarInfo; // 0x5f8(0x08)
	struct UCanvasPanel* Panel_DisableFire_Left; // 0x600(0x08)
	struct UCanvasPanel* Panel_DisableFire_Right; // 0x608(0x08)
	struct UCanvasPanel* Panel_Drive_Out; // 0x610(0x08)
	struct UCanvasPanel* Panel_DriveBackward; // 0x618(0x08)
	struct UCanvasPanel* Panel_DriveCardown; // 0x620(0x08)
	struct UCanvasPanel* Panel_DriveCarup; // 0x628(0x08)
	struct UCanvasPanel* Panel_DriveForward; // 0x630(0x08)
	struct UCanvasPanel* Panel_DriveLeft; // 0x638(0x08)
	struct UCanvasPanel* Panel_DriveRight; // 0x640(0x08)
	struct UCanvasPanel* Panel_DriveShot; // 0x648(0x08)
	struct UCanvasPanel* Panel_DriveStop; // 0x650(0x08)
	struct UCanvasPanel* Panel_Gunsight; // 0x658(0x08)
	struct UCanvasPanel* Panel_JoystickSprint; // 0x660(0x08)
	struct UCanvasPanel* Panel_Line; // 0x668(0x08)
	struct UCanvasPanel* Panel_QuickADS; // 0x670(0x08)
	struct UCanvasPanel* Panel_Reload; // 0x678(0x08)
	struct UCanvasPanel* Panel_SwitchSeat; // 0x680(0x08)
	struct UCanvasPanel* Panel_Trumpet; // 0x688(0x08)
	struct UCanvasPanel* Panel_Vehicle_PrimaryFire; // 0x690(0x08)
	struct UCanvasPanel* Panel_Vehicle_SecondaryFire; // 0x698(0x08)
	struct UCanvasPanel* Panel_VehicleSkill_1; // 0x6a0(0x08)
	struct UCanvasPanel* Panel_VehicleSkill_2; // 0x6a8(0x08)
	struct UCanvasPanel* Panel_Weapon_Exit; // 0x6b0(0x08)
	struct USolarCheckBox* Seat1; // 0x6b8(0x08)
	struct USolarCheckBox* Seat2; // 0x6c0(0x08)
	struct USolarCheckBox* Seat3; // 0x6c8(0x08)
	struct USolarCheckBox* Seat4; // 0x6d0(0x08)
	struct UCheckBoxGroup* SeatFlag; // 0x6d8(0x08)
	struct UTextBlock* Txt_Health; // 0x6e0(0x08)
	struct UTextBlock* Txt_Health_percent; // 0x6e8(0x08)
	struct UTextBlock* Txt_Speed_2; // 0x6f0(0x08)

	struct FString GetModuleName(); // Function UI_CustomizeLayout_DirectionControl.UI_CustomizeLayout_DirectionControl_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
	enum class ECheckBoxState Get_Hero01_CheckedState_1(); // Function UI_CustomizeLayout_DirectionControl.UI_CustomizeLayout_DirectionControl_C.Get_Hero01_CheckedState_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2649560
	void PreConstruct(bool IsDesignTime); // Function UI_CustomizeLayout_DirectionControl.UI_CustomizeLayout_DirectionControl_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void ExecuteUbergraph_UI_CustomizeLayout_DirectionControl(int32_t EntryPoint); // Function UI_CustomizeLayout_DirectionControl.UI_CustomizeLayout_DirectionControl_C.ExecuteUbergraph_UI_CustomizeLayout_DirectionControl // (Final|UbergraphFunction) // @ game+0x2649560
};

