// WidgetBlueprintGeneratedClass UI_Currency_Bar.UI_Currency_Bar_C
// Size: 0x418 (Inherited: 0x348)
struct UUI_Currency_Bar_C : USolarUserWidget {
	struct UButton* Btn_charge; // 0x348(0x08)
	struct UImage* img_charge; // 0x350(0x08)
	struct UImage* Img_Currency; // 0x358(0x08)
	struct UImage* Img_Currency_2; // 0x360(0x08)
	struct UImage* Img_Currency_01; // 0x368(0x08)
	struct UImage* Img_Currency_02; // 0x370(0x08)
	struct UImage* Line_3; // 0x378(0x08)
	struct UImage* Line_4; // 0x380(0x08)
	struct UImage* Line_5; // 0x388(0x08)
	struct UImage* Line_6; // 0x390(0x08)
	struct UOverlay* Overlay_Vip; // 0x398(0x08)
	struct UCanvasPanel* Panel_Currency_01; // 0x3a0(0x08)
	struct UCanvasPanel* Panel_Currency_02; // 0x3a8(0x08)
	struct UCanvasPanel* Panel_Currency_03; // 0x3b0(0x08)
	struct UCanvasPanel* Panel_Currency_04; // 0x3b8(0x08)
	struct UCanvasPanel* Panel_Root; // 0x3c0(0x08)
	struct USolarButton* SolarBtn_BG; // 0x3c8(0x08)
	struct USolarButton* SolarBtn_BG_2; // 0x3d0(0x08)
	struct USolarButton* SolarBtn_BG_3; // 0x3d8(0x08)
	struct USolarButton* SolarBtn_BG_02; // 0x3e0(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General; // 0x3e8(0x08)
	struct UTextBlock* Txt_Number; // 0x3f0(0x08)
	struct UTextBlock* Txt_Number_2; // 0x3f8(0x08)
	struct UTextBlock* Txt_Number_01; // 0x400(0x08)
	struct UTextBlock* Txt_Number_02; // 0x408(0x08)
	struct UUI_Vip_Cards_C* UI_Vip_Cards; // 0x410(0x08)

	struct FString GetModuleName(); // Function UI_Currency_Bar.UI_Currency_Bar_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
};

