// WidgetBlueprintGeneratedClass UI_Lobby_StartBtn.UI_Lobby_StartBtn_C
// Size: 0x51c (Inherited: 0x348)
struct UUI_Lobby_StartBtn_C : USolarUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x348(0x08)
	struct UWidgetAnimation* Anim_Tournament_Enter; // 0x350(0x08)
	struct UWidgetAnimation* Anim_Activity_Enter; // 0x358(0x08)
	struct UWidgetAnimation* Loop_Normal_Anim; // 0x360(0x08)
	struct UWidgetAnimation* Loading_Anim; // 0x368(0x08)
	struct UWidgetAnimation* Loop_Start_Anim; // 0x370(0x08)
	struct UButton* Btn_Activity_Point; // 0x378(0x08)
	struct UButton* Btn_Cancel; // 0x380(0x08)
	struct UButton* Btn_Clan_Join; // 0x388(0x08)
	struct UButton* Btn_Clan_Reward; // 0x390(0x08)
	struct UButton* Btn_GameMode; // 0x398(0x08)
	struct UButton* Btn_Start; // 0x3a0(0x08)
	struct UButton* Btn_Tournament_Reward; // 0x3a8(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag; // 0x3b0(0x08)
	struct UScaleBox* GameMode; // 0x3b8(0x08)
	struct UHorizontalBox* HorizontalBox_PC; // 0x3c0(0x08)
	struct UImage* Image_X; // 0x3c8(0x08)
	struct UImage* Img_Activity_BG; // 0x3d0(0x08)
	struct UImage* Img_Activity_BG_Light; // 0x3d8(0x08)
	struct UImage* Img_Activity_BG_Light_2; // 0x3e0(0x08)
	struct UImage* Img_Activity_BG_Light_3; // 0x3e8(0x08)
	struct UImage* Img_Activity_BG_Light_4; // 0x3f0(0x08)
	struct UImage* Img_Arrow; // 0x3f8(0x08)
	struct UImage* Img_Arrow_Light; // 0x400(0x08)
	struct UImage* Img_GameMode; // 0x408(0x08)
	struct UImage* Img_Loading; // 0x410(0x08)
	struct UImage* Img_Start_Bg; // 0x418(0x08)
	struct UImage* Img_Start_Normal_Light; // 0x420(0x08)
	struct UCanvasPanel* Panel_Activity_All; // 0x428(0x08)
	struct UCanvasPanel* Panel_Anim; // 0x430(0x08)
	struct UCanvasPanel* Panel_Battle; // 0x438(0x08)
	struct UCanvasPanel* Panel_Cancel; // 0x440(0x08)
	struct UCanvasPanel* Panel_Gamemode; // 0x448(0x08)
	struct UCanvasPanel* Panel_Matching; // 0x450(0x08)
	struct UCanvasPanel* panel_start; // 0x458(0x08)
	struct UCanvasPanel* Panel_Start_Anim; // 0x460(0x08)
	struct USolarRedHint_General_C* RedHint_More; // 0x468(0x08)
	struct USolarImage* SolarImage_ClanFlag; // 0x470(0x08)
	struct USolarRichTextBlock* SolarRichTextBlock_Team; // 0x478(0x08)
	struct UTextBlock* Text_MatchDuration; // 0x480(0x08)
	struct USolarTextBlock* Text_Matching; // 0x488(0x08)
	struct USolarTextBlock* Text_Start; // 0x490(0x08)
	struct UTickerWidget_C* TickerWidget_Join; // 0x498(0x08)
	struct UTickerWidget_C* TickerWidget_Reward; // 0x4a0(0x08)
	struct USolarRichTextBlock* Txt_Activity_Point; // 0x4a8(0x08)
	struct USolarTextBlock* TXT_GameMap; // 0x4b0(0x08)
	struct USolarTextBlock* Txt_Mode; // 0x4b8(0x08)
	struct UTextBlock* Txt_Team_Num; // 0x4c0(0x08)
	struct URichTextBlock* Txt_Tournament_Reward; // 0x4c8(0x08)
	struct UUI_Component_Platform_C* UI_Component_Platform; // 0x4d0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Activity; // 0x4d8(0x08)
	bool Leader; // 0x4e0(0x01)
	bool Matching; // 0x4e1(0x01)
	bool Ready; // 0x4e2(0x01)
	bool Disable; // 0x4e3(0x01)
	bool PC; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)
	struct FLinearColor StartBtnLinearColorWordSolid; // 0x4e8(0x10)
	struct FLinearColor StartBtnLinearColorTimeSolid; // 0x4f8(0x10)
	struct FLinearColor StartBtnLinearColorWordGreyout; // 0x508(0x10)
	float ActivityIntervalTime; // 0x518(0x04)

	struct FString GetModuleName(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
	void UpdatePlatformBlendState(bool NewParam); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void UpdatePanelState(bool Leader, bool Matching, bool Ready, bool Disable); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void Update All Widgets(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets // (BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void Construct(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb43660
	void ExecuteUbergraph_UI_Lobby_StartBtn(int32_t EntryPoint); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn // (Final|UbergraphFunction|HasDefaults) // @ game+0x2649560
};

