// WidgetBlueprintGeneratedClass UI_Lobby_RandomPack.UI_Lobby_RandomPack_C
// Size: 0x390 (Inherited: 0x348)
struct UUI_Lobby_RandomPack_C : USolarUserWidget {
	struct UWidgetAnimation* Enter_Anim; // 0x348(0x08)
	struct USolarButton* Btn_RandomPack; // 0x350(0x08)
	struct UCanvasPanel* Bubble; // 0x358(0x08)
	struct UHorizontalBox* Bubble_ToBeClaimed; // 0x360(0x08)
	struct UImage* Img_XELB; // 0x368(0x08)
	struct UCanvasPanel* Panel_VX; // 0x370(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General; // 0x378(0x08)
	struct UTickerWidget_C* Txt_Reminder; // 0x380(0x08)
	struct UTickerWidget_C* Txt_ToBeClaimed; // 0x388(0x08)

	struct FString GetModuleName(); // Function UI_Lobby_RandomPack.UI_Lobby_RandomPack_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
};

