// WidgetBlueprintGeneratedClass UI_Lobby_PlayerInfo.UI_Lobby_PlayerInfo_C
// Size: 0x388 (Inherited: 0x348)
struct UUI_Lobby_PlayerInfo_C : USolarUserWidget {
	struct UButton* Btn_PlayerInfo; // 0x348(0x08)
	struct UCanvasPanel* Panel_PlayerInformation; // 0x350(0x08)
	struct UProgressBar* ProgressBar_PlayerExp; // 0x358(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General_4; // 0x360(0x08)
	struct UTextBlock* Txt_PlayerLevel; // 0x368(0x08)
	struct UUI_Component_NationalFlag_C* UI_Component_NationalFlag; // 0x370(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead; // 0x378(0x08)
	struct UUI_Component_PlayerName_C* UI_Component_PlayerName; // 0x380(0x08)

	struct FString GetModuleName(); // Function UI_Lobby_PlayerInfo.UI_Lobby_PlayerInfo_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
};

