// WidgetBlueprintGeneratedClass UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C
// Size: 0x57b (Inherited: 0x348)
struct UUI_Lobby_RoomInvite_Popup_C : USolarUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x348(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x350(0x08)
	struct UWidgetAnimation* Anim_Exit; // 0x358(0x08)
	struct UWidgetAnimation* Anim_Enter; // 0x360(0x08)
	struct USolarButton* Btn_Join_Common; // 0x368(0x08)
	struct USolarButton* Btn_Join_League; // 0x370(0x08)
	struct USolarButton* Btn_Joining; // 0x378(0x08)
	struct UButton* Btn_Player; // 0x380(0x08)
	struct UButton* Btn_Player_2; // 0x388(0x08)
	struct USolarButton* Btn_Watch; // 0x390(0x08)
	struct UHorizontalBox* HorizentalBox_Match; // 0x398(0x08)
	struct UHorizontalBox* HorizentalBox_Spectator; // 0x3a0(0x08)
	struct UHorizontalBox* HorizontalBox_Join; // 0x3a8(0x08)
	struct UHorizontalBox* HorizontalBox_Joining_2; // 0x3b0(0x08)
	struct UHorizontalBox* HorizontalBox_League; // 0x3b8(0x08)
	struct UHorizontalBox* HorizontalBox_Player; // 0x3c0(0x08)
	struct UHorizontalBox* HorizontalBox_Title_Common; // 0x3c8(0x08)
	struct UHorizontalBox* HorizontalBox_Title_Common_2; // 0x3d0(0x08)
	struct UHorizontalBox* HorizontalBox_Title_League; // 0x3d8(0x08)
	struct UHorizontalBox* HorizontalBox_Watch; // 0x3e0(0x08)
	struct UImage* Img_BG_Light; // 0x3e8(0x08)
	struct UImage* Img_BG_Light_01; // 0x3f0(0x08)
	struct UImage* Img_Btn_Join; // 0x3f8(0x08)
	struct UImage* Img_Btn_Join_2; // 0x400(0x08)
	struct UImage* Img_Btn_Joining_Close; // 0x408(0x08)
	struct UImage* Img_Btn_Watch; // 0x410(0x08)
	struct UImage* Img_Division; // 0x418(0x08)
	struct UImage* Img_Join_Common_Light; // 0x420(0x08)
	struct UImage* Img_Join_Light; // 0x428(0x08)
	struct USolarImageURL* Img_League_Icon; // 0x430(0x08)
	struct UImage* Img_Title_BG; // 0x438(0x08)
	struct UImage* Img_Title_BG_2; // 0x440(0x08)
	struct UImage* Img_Watch_Light; // 0x448(0x08)
	struct UOverlay* Overlay_Avatar; // 0x450(0x08)
	struct UOverlay* Overlay_Avatar_2; // 0x458(0x08)
	struct UOverlay* Overlay_Cup; // 0x460(0x08)
	struct UCanvasPanel* Panel_Info_CreateRoom; // 0x468(0x08)
	struct UCanvasPanel* Panel_Info_Invitation; // 0x470(0x08)
	struct UCanvasPanel* Panel_Pop_Common; // 0x478(0x08)
	struct UCanvasPanel* Panel_Pop_League; // 0x480(0x08)
	struct USolarRichTextBlock* RichTxt_LvlRequired; // 0x488(0x08)
	struct USolarTextBlock* Txt_Capacity; // 0x490(0x08)
	struct USolarTextBlock* Txt_Clan_Quantity; // 0x498(0x08)
	struct USolarTextBlock* Txt_GameMode; // 0x4a0(0x08)
	struct USolarTextBlock* Txt_GameMode_2; // 0x4a8(0x08)
	struct USolarTextBlock* Txt_Invitation; // 0x4b0(0x08)
	struct USolarTextBlock* Txt_Join; // 0x4b8(0x08)
	struct USolarTextBlock* Txt_Join_Common; // 0x4c0(0x08)
	struct USolarTextBlock* Txt_Joining; // 0x4c8(0x08)
	struct USolarTextBlock* Txt_League_Name; // 0x4d0(0x08)
	struct USolarTextBlock* Txt_Map; // 0x4d8(0x08)
	struct USolarTextBlock* Txt_Map_2; // 0x4e0(0x08)
	struct USolarTextBlock* Txt_Map_3; // 0x4e8(0x08)
	struct USolarTextBlock* Txt_Mode; // 0x4f0(0x08)
	struct USolarTextBlock* Txt_Number; // 0x4f8(0x08)
	struct UTextBlock* Txt_OBCurr; // 0x500(0x08)
	struct UTextBlock* Txt_OBCurr_2; // 0x508(0x08)
	struct UTextBlock* Txt_OBCurr_4; // 0x510(0x08)
	struct USolarTextBlock* Txt_OBTotal; // 0x518(0x08)
	struct USolarTextBlock* Txt_PlayerIn; // 0x520(0x08)
	struct UTextBlock* Txt_PlayerName; // 0x528(0x08)
	struct USolarTextBlock* Txt_Progress_Des; // 0x530(0x08)
	struct USolarTextBlock* Txt_Progress_Time; // 0x538(0x08)
	struct USolarTextBlock* Txt_RoomName; // 0x540(0x08)
	struct USolarTextBlock* Txt_Watch; // 0x548(0x08)
	struct UUI_Component_Close_C* UI_Component_Close; // 0x550(0x08)
	struct UUI_Component_Platform_C* UI_Component_Platform; // 0x558(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead; // 0x560(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead_2; // 0x568(0x08)
	struct UVerticalBox* VerticalBox_League; // 0x570(0x08)
	enum class E_Type_CreateRoom_Gender Gender; // 0x578(0x01)
	enum class T_Type_System_Push Pop_Type; // 0x579(0x01)
	enum class T_Type_Button Btn_Type; // 0x57a(0x01)

	struct FString GetModuleName(); // Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
	void Update_Btn(enum class T_Type_Button NewParam); // Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.Update_Btn // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void SetType(enum class T_Type_System_Push NewParam); // Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.SetType // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void ExecuteUbergraph_UI_Lobby_RoomInvite_Popup(int32_t EntryPoint); // Function UI_Lobby_RoomInvite_Popup.UI_Lobby_RoomInvite_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_Popup // (Final|UbergraphFunction) // @ game+0x2649560
};

