// WidgetBlueprintGeneratedClass UI_Lobby.UI_Lobby_C
// Size: 0x880 (Inherited: 0x398)
struct UUI_Lobby_C : USolarPanelWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x398(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x3a0(0x08)
	struct UWidgetAnimation* Anim_Enter; // 0x3a8(0x08)
	struct UCanvasPanel* Adapter; // 0x3b0(0x08)
	struct USolarButton* Btn_Activity; // 0x3b8(0x08)
	struct UButton* Btn_Character; // 0x3c0(0x08)
	struct UButton* Btn_Clan; // 0x3c8(0x08)
	struct UButton* Btn_Collection; // 0x3d0(0x08)
	struct UButton* Btn_Leaderboard; // 0x3d8(0x08)
	struct UButton* Btn_MailBox; // 0x3e0(0x08)
	struct USolarButton* Btn_MatchRoom; // 0x3e8(0x08)
	struct UButton* Btn_More; // 0x3f0(0x08)
	struct UButton* Btn_PopupLayer; // 0x3f8(0x08)
	struct UButton* Btn_Raffle; // 0x400(0x08)
	struct USolarButton* Btn_Rank; // 0x408(0x08)
	struct UButton* Btn_Settings; // 0x410(0x08)
	struct USolarButton* Btn_Shop; // 0x418(0x08)
	struct UButton* Btn_Social; // 0x420(0x08)
	struct UButton* Btn_Task; // 0x428(0x08)
	struct UButton* Btn_Topup; // 0x430(0x08)
	struct UButton* Btn_Tournament; // 0x438(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Activity; // 0x440(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Clan; // 0x448(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Collection; // 0x450(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Heros; // 0x458(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Leaderboard; // 0x460(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Raffle; // 0x468(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Rank; // 0x470(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Shop; // 0x478(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_SupplyBox; // 0x480(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Task; // 0x488(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Tournament; // 0x490(0x08)
	struct UButton* Button_CloseEmoji; // 0x498(0x08)
	struct USolarButton* Button_Emoji; // 0x4a0(0x08)
	struct USolarButton* Button_Emoji_Close; // 0x4a8(0x08)
	struct UCanvasPanel* CanvasPanel_Container; // 0x4b0(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag; // 0x4b8(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_2; // 0x4c0(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_3; // 0x4c8(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_4; // 0x4d0(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_5; // 0x4d8(0x08)
	struct UUI_Component_Emoji_List_C* Emoji_List; // 0x4e0(0x08)
	struct USolarCheckBox* EmojiBtn; // 0x4e8(0x08)
	struct UScaleBox* EmoteScaleBox_2; // 0x4f0(0x08)
	struct UScaleBox* EmoteScaleBox_3; // 0x4f8(0x08)
	struct UScaleBox* EmoteScaleBox_4; // 0x500(0x08)
	struct UScaleBox* EmoteScaleBox_5; // 0x508(0x08)
	struct USolarRedHint_General_C* HintPoint_Clan; // 0x510(0x08)
	struct UHorizontalBox* HorizontalBox_Coin; // 0x518(0x08)
	struct UHorizontalBox* HorizontalBox_Diamond; // 0x520(0x08)
	struct UHorizontalBox* HorizontalBox_Dollar; // 0x528(0x08)
	struct UImage* Image_64; // 0x530(0x08)
	struct UImage* Img_Activity; // 0x538(0x08)
	struct UImage* Img_Clan; // 0x540(0x08)
	struct UImage* Img_Matchroom_Tips_Arrow; // 0x548(0x08)
	struct UImage* Img_Ping; // 0x550(0x08)
	struct UImage* Img_UnlockAnim; // 0x558(0x08)
	struct UOverlay* Overlay_BattlePass; // 0x560(0x08)
	struct UOverlay* Overlay_Live; // 0x568(0x08)
	struct UOverlay* Overlay_Matchroom_Tips; // 0x570(0x08)
	struct UCanvasPanel* Panel; // 0x578(0x08)
	struct UCanvasPanel* Panel_Activity; // 0x580(0x08)
	struct UCanvasPanel* Panel_ActivityContent; // 0x588(0x08)
	struct UCanvasPanel* Panel_Clan; // 0x590(0x08)
	struct UCanvasPanel* Panel_Clan_Content; // 0x598(0x08)
	struct UCanvasPanel* Panel_Collection; // 0x5a0(0x08)
	struct UCanvasPanel* Panel_Collection_Content; // 0x5a8(0x08)
	struct UCanvasPanel* Panel_Commerce; // 0x5b0(0x08)
	struct UCanvasPanel* Panel_Emoji; // 0x5b8(0x08)
	struct UCanvasPanel* Panel_Heros; // 0x5c0(0x08)
	struct UCanvasPanel* Panel_Heros_Content; // 0x5c8(0x08)
	struct UCanvasPanel* Panel_Invite; // 0x5d0(0x08)
	struct UCanvasPanel* Panel_Leaderboard; // 0x5d8(0x08)
	struct UCanvasPanel* Panel_Leaderboard_Content; // 0x5e0(0x08)
	struct UCanvasPanel* Panel_MailBox; // 0x5e8(0x08)
	struct UCanvasPanel* Panel_MatchRoom; // 0x5f0(0x08)
	struct UCanvasPanel* Panel_More; // 0x5f8(0x08)
	struct UCanvasPanel* Panel_Profession; // 0x600(0x08)
	struct UCanvasPanel* Panel_Raffle; // 0x608(0x08)
	struct UCanvasPanel* Panel_RaffleContent; // 0x610(0x08)
	struct UCanvasPanel* Panel_Rank; // 0x618(0x08)
	struct UCanvasPanel* Panel_Rank_Content; // 0x620(0x08)
	struct UCanvasPanel* Panel_RedPacket; // 0x628(0x08)
	struct UCanvasPanel* Panel_Settings; // 0x630(0x08)
	struct UCanvasPanel* Panel_Shop; // 0x638(0x08)
	struct UCanvasPanel* Panel_Shop_Content; // 0x640(0x08)
	struct UCanvasPanel* Panel_Social; // 0x648(0x08)
	struct UCanvasPanel* Panel_SupplyBox; // 0x650(0x08)
	struct UCanvasPanel* Panel_SupplyBox_Content; // 0x658(0x08)
	struct UHorizontalBox* Panel_System; // 0x660(0x08)
	struct UCanvasPanel* Panel_Task; // 0x668(0x08)
	struct UCanvasPanel* Panel_Task_Content; // 0x670(0x08)
	struct UCanvasPanel* Panel_Topup; // 0x678(0x08)
	struct UCanvasPanel* Panel_Tournament; // 0x680(0x08)
	struct UCanvasPanel* Panel_Tournament_Content; // 0x688(0x08)
	struct UCanvasPanel* PopupLayer; // 0x690(0x08)
	struct UUI_Lobby_Profession_C* Profession_2; // 0x698(0x08)
	struct UUI_Lobby_Profession_C* Profession_3; // 0x6a0(0x08)
	struct UUI_Lobby_Profession_C* Profession_4; // 0x6a8(0x08)
	struct UUI_Lobby_Profession_C* Profession_5; // 0x6b0(0x08)
	struct USolarRedHint_General_C* Red_Rank; // 0x6b8(0x08)
	struct USolarRedHint_General_C* Red_Shop; // 0x6c0(0x08)
	struct USolarRedHint_General_C* RedHint_Capsulers; // 0x6c8(0x08)
	struct USolarRedHint_General_C* RedHint_Collection; // 0x6d0(0x08)
	struct USolarRedHint_General_C* RedHint_E-Mail; // 0x6d8(0x08)
	struct USolarRedHint_General_C* RedHint_Leaderboard; // 0x6e0(0x08)
	struct USolarRedHint_General_C* RedHint_More; // 0x6e8(0x08)
	struct USolarRedHint_General_C* RedHint_Social; // 0x6f0(0x08)
	struct USolarRedHint_General_C* RedHint_Task; // 0x6f8(0x08)
	struct USolarRedHint_General_C* RedHint_Tournament; // 0x700(0x08)
	struct USolarImageURL* SolarImageURL_Icon; // 0x708(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General; // 0x710(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General_2; // 0x718(0x08)
	struct USolarRichTextBlock* SolarRichTextBlock_Stage; // 0x720(0x08)
	struct URichTextBlock* STB_RewardCoinNum; // 0x728(0x08)
	struct URichTextBlock* STB_RewardDiamondNum; // 0x730(0x08)
	struct URichTextBlock* STB_RewardDollarNum; // 0x738(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_2; // 0x740(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_3; // 0x748(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_4; // 0x750(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_5; // 0x758(0x08)
	struct UTextBlock* Text_MatchInfo; // 0x760(0x08)
	struct UTextBlock* Text_RoomInfo; // 0x768(0x08)
	struct USolarTextBlock* Txt_Clan; // 0x770(0x08)
	struct USolarTextBlock* Txt_Season; // 0x778(0x08)
	struct UUI_ChatPanel_C* UI_ChatPanel; // 0x780(0x08)
	struct UUI_Lobby_Banner_C* UI_Lobby_Banner; // 0x788(0x08)
	struct UUI_Lobby_Battery_C* UI_Lobby_Battery; // 0x790(0x08)
	struct UUI_Lobby_BattlePass_C* UI_Lobby_BattlePass; // 0x798(0x08)
	struct UUI_Lobby_BattlePass3_C* UI_Lobby_BattlePass3; // 0x7a0(0x08)
	struct UUI_Lobby_BattlePass_Next_C* UI_Lobby_BattlePass_Next; // 0x7a8(0x08)
	struct UUI_Currency_Bar_C* UI_Lobby_Currency; // 0x7b0(0x08)
	struct UUI_Lobby_DownLoad_C* UI_Lobby_DownLoad; // 0x7b8(0x08)
	struct UUI_Lobby_GameRecommend_C* UI_Lobby_GameRecommend; // 0x7c0(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_3; // 0x7c8(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_4; // 0x7d0(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_5; // 0x7d8(0x08)
	struct UUI_Lobby_Mainmenu_C* UI_Lobby_Mainmenu; // 0x7e0(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_2; // 0x7e8(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_3; // 0x7f0(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_4; // 0x7f8(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_5; // 0x800(0x08)
	struct UUI_Lobby_Mission_Reward_C* UI_Lobby_Mission_Reward; // 0x808(0x08)
	struct UUI_Lobby_PlayerInfo_C* UI_Lobby_PlayerInfo; // 0x810(0x08)
	struct UUI_Lobby_RandomPack_C* UI_Lobby_RandomPack; // 0x818(0x08)
	struct UUI_Lobby_Recruit_C* UI_Lobby_Recruit; // 0x820(0x08)
	struct UUI_Lobby_RedPacket_C* UI_Lobby_RedPacket; // 0x828(0x08)
	struct UUI_Lobby_Sanctuary_C* UI_Lobby_Sanctuary; // 0x830(0x08)
	struct UUI_Lobby_Social_Entrance_C* UI_Lobby_Social_Entrance; // 0x838(0x08)
	struct UUI_Lobby_StartBtn_C* UI_Lobby_StartBtn; // 0x840(0x08)
	struct UUI_Lobby_SupplyBox_C* UI_Lobby_SupplyBox; // 0x848(0x08)
	struct UUI_Lobby_Topup_C* UI_Lobby_Topup; // 0x850(0x08)
	struct UUI_MicroPhoneSetting_C* UI_MicroPhoneSetting; // 0x858(0x08)
	struct UUI_Rank_Icon_Small_C* UI_Rank_Icon_Small; // 0x860(0x08)
	struct UTextBlock* UserId; // 0x868(0x08)
	struct UCanvasPanel* Video; // 0x870(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Tournament; // 0x878(0x08)

	struct FString GetModuleName(); // Function UI_Lobby.UI_Lobby_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2649560
	void SetLevel(int32_t Level); // Function UI_Lobby.UI_Lobby_C.SetLevel // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void SetClanLock(int32_t ClanLock); // Function UI_Lobby.UI_Lobby_C.SetClanLock // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void AddVideoPanel(); // Function UI_Lobby.UI_Lobby_C.AddVideoPanel // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void ShowFlyAnimation(); // Function UI_Lobby.UI_Lobby_C.ShowFlyAnimation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2649560
	void GetAnimTargetLocation(struct UWidget* TargetObject, struct UWidget* UserObject, struct FVector2D& TargetLocation); // Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2649560
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby.UI_Lobby_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2649560
	void Construct(); // Function UI_Lobby.UI_Lobby_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb43660
	void ReceiveShow(); // Function UI_Lobby.UI_Lobby_C.ReceiveShow // (Event|Protected|BlueprintEvent) // @ game+0x2649560
	void ExecuteUbergraph_UI_Lobby(int32_t EntryPoint); // Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby // (Final|UbergraphFunction) // @ game+0x2649560
};

