#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// ScriptStruct UnLua.PropertyCollector
struct FPropertyCollector
{
public:
	enum class ETutorialTriggerType              None;                                              // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                None;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        None;                                              // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                   None;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTutorialTableRow                     None;                                              // 0x0(0x98)(HasGetValueTypeHash)
	struct FGateAddress_Dep                      None;                                              // 0x0(0x20)(HasGetValueTypeHash)
	struct FServerInfo_Dep                       None;                                              // 0x0(0x50)(HasGetValueTypeHash)
	struct FInputKeyMappingEntry                 None;                                              // 0x0(0x40)(HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct UnLua.InSightEvent
struct FInSightEvent
{
public:
	uint8                                        Pad_3C8[0x1];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

}


