// ScriptStruct UnLua.PropertyCollector
// Size: 0x01 (Inherited: 0x00)
struct FPropertyCollector {
	struct AActor* None; // 0x00(0x08)
	int32_t None; // 0x00(0x04)
	struct UObject* None; // 0x00(0x08)
	struct FTutorialTableRow None; // 0x00(0x98)
	struct FGateAddress_Dep None; // 0x00(0x20)
	struct FServerInfo_Dep None; // 0x00(0x50)
	struct FInputKeyMappingEntry None; // 0x00(0x40)
};

// ScriptStruct UnLua.InSightEvent
// Size: 0x01 (Inherited: 0x00)
struct FInSightEvent {
	char pad_0[0x1]; // 0x00(0x01)
};

