// DynamicClass R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C
// Size: 0x9e0 (Inherited: 0x2d0)
struct UR_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C : UWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x708(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xb0)
	struct FAnimMsgData K2Node_MakeStruct_AnimMsgData; // 0x9c0(0x08)
	struct TArray<struct FAnimMsgData> K2Node_MakeArray_Array; // 0x9c8(0x10)
	char pad_9D8[0x8]; // 0x9d8(0x08)

	void TestAPI(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.TestAPI // (Native|Public|BlueprintCallable) // @ game+0x1b39970
	void InterruptAnim(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.InterruptAnim // (Native|Public|BlueprintCallable) // @ game+0x1b47550
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_FD3912374DA1042122EF4BA346AED47D(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_FD3912374DA1042122EF4BA346AED47D // (Native|Public) // @ game+0x1b399d0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F3E1CE4F4F52BDDF2C7C4392679371E6(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F3E1CE4F4F52BDDF2C7C4392679371E6 // (Native|Public) // @ game+0x1b39b80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D5845B9E400B3D008BEF698B783B92A9(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D5845B9E400B3D008BEF698B783B92A9 // (Native|Public) // @ game+0x1b39f00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D26EF958487058FA7FC43FAD41F4DEF7(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D26EF958487058FA7FC43FAD41F4DEF7 // (Native|Public) // @ game+0x1b39fa0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052 // (Native|Public) // @ game+0x1b399f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_9F7EE7DF4EADB7412001EA80EB6DF9EE(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_9F7EE7DF4EADB7412001EA80EB6DF9EE // (Native|Public) // @ game+0x7e53b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_90C49DEF49A94759B5DF8D8AB0247252(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_90C49DEF49A94759B5DF8D8AB0247252 // (Native|Public) // @ game+0x1b39ea0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7BF9F6B543647F4000354585CCDD9D8C(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7BF9F6B543647F4000354585CCDD9D8C // (Native|Public) // @ game+0x1b39a70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_69DC14EC4A779FA924FD3BAD514C71CA(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_69DC14EC4A779FA924FD3BAD514C71CA // (Native|Public) // @ game+0x1b39a10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_520B94684B85FF9018373286CEF79B9D(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_520B94684B85FF9018373286CEF79B9D // (Native|Public) // @ game+0x1b3a080
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_512995A9441B7ABA6A1354A124B4947D(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_512995A9441B7ABA6A1354A124B4947D // (Native|Public) // @ game+0x1b39f40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_48E7AFC2428503DF315D6DA5F2F053F5(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_48E7AFC2428503DF315D6DA5F2F053F5 // (Native|Public) // @ game+0x1b39d20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3FDD26624535716666823A85B4A0EA6B(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3FDD26624535716666823A85B4A0EA6B // (Native|Public) // @ game+0x1b3a120
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_37CC4BD349701B7B6B2903932ADDE28C(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_37CC4BD349701B7B6B2903932ADDE28C // (Native|Public) // @ game+0x1b39ba0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2DD7E36F4A2BD62B1A8519B45B2FBE75(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2DD7E36F4A2BD62B1A8519B45B2FBE75 // (Native|Public) // @ game+0xc6d000
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2AFD33E54E0DB5EA1233039AC1CBEAAE(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2AFD33E54E0DB5EA1233039AC1CBEAAE // (Native|Public) // @ game+0x1b39bc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_272B77AE42671779C55883858592D62C(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_272B77AE42671779C55883858592D62C // (Native|Public) // @ game+0x1b39c60
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_075E1FBF4BB9C39350964A81FBF296DE(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_075E1FBF4BB9C39350964A81FBF296DE // (Native|Public) // @ game+0x1b39b40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0584AE8244C44B37DF07C28ADC078A60(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0584AE8244C44B37DF07C28ADC078A60 // (Native|Public) // @ game+0xc6cfc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_31A4CD864812F3929F156E9AEE73754C(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_31A4CD864812F3929F156E9AEE73754C // (Native|Public) // @ game+0x1b39990
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_306EF0F349340C3816672B840E67EAF3(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_306EF0F349340C3816672B840E67EAF3 // (Native|Public) // @ game+0x1b39a50
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_296D1E13442BD0646F8BEE8C73C07614(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_296D1E13442BD0646F8BEE8C73C07614 // (Native|Public) // @ game+0x1b399b0
	void AnimNotify_QuitIdle(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitIdle // (Native|Public|BlueprintCallable) // @ game+0x1b39b60
	void AnimNotify_QuitFire(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitFire // (Native|Public|BlueprintCallable) // @ game+0x1b39b20
	void AnimNotify_EnterIdle(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterIdle // (Native|Public|BlueprintCallable) // @ game+0x1b47430
	void AnimNotify_EnterFire(); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterFire // (Native|Public|BlueprintCallable) // @ game+0x1b39a30
	void AnimGraph(struct FPoseLink& bpp__AnimGraph__pf); // Function R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL03_Set00_LODP_Skeleton_AnimBlueprint_C.AnimGraph // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1b77560
};

