// DynamicClass R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C
// Size: 0x9e0 (Inherited: 0x2d0)
struct UR_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C : UWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x708(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xb0)
	struct FAnimMsgData K2Node_MakeStruct_AnimMsgData; // 0x9c0(0x08)
	struct TArray<struct FAnimMsgData> K2Node_MakeArray_Array; // 0x9c8(0x10)
	char pad_9D8[0x8]; // 0x9d8(0x08)

	void TestAPI(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.TestAPI // (Native|Public|BlueprintCallable) // @ game+0x1b39970
	void InterruptAnim(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.InterruptAnim // (Native|Public|BlueprintCallable) // @ game+0x1b47550
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F1D9DDBB413911FB9DAB608900412973(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F1D9DDBB413911FB9DAB608900412973 // (Native|Public) // @ game+0xc6d000
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_ED21629F443C13EB618022956A31D19A(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_ED21629F443C13EB618022956A31D19A // (Native|Public) // @ game+0x1b39c60
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_DF0EDC2A4C9FD52DDBFB5AB16F296F1F(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_DF0EDC2A4C9FD52DDBFB5AB16F296F1F // (Native|Public) // @ game+0x1b39f00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052 // (Native|Public) // @ game+0x1b399f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C03C50F94DB6AE0D2D3E5C9ED0973F8F(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C03C50F94DB6AE0D2D3E5C9ED0973F8F // (Native|Public) // @ game+0x1b39b80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AAD002E1429649E2A71240AC589B09B4(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AAD002E1429649E2A71240AC589B09B4 // (Native|Public) // @ game+0x1b39f40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AA031CB74743982BEE3C5797368DAA52(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AA031CB74743982BEE3C5797368DAA52 // (Native|Public) // @ game+0x1b39d20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A5160CCA42B37A4C3B4188B28169B213(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A5160CCA42B37A4C3B4188B28169B213 // (Native|Public) // @ game+0x1b39bc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A2FAECDE4FDF2B0F0058E592F914226B(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A2FAECDE4FDF2B0F0058E592F914226B // (Native|Public) // @ game+0x1b39fa0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_94B2047B4C3C85D5F4207DBB55087639(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_94B2047B4C3C85D5F4207DBB55087639 // (Native|Public) // @ game+0x1b3a120
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_75627B5046C82AA9436B29B4F5249E44(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_75627B5046C82AA9436B29B4F5249E44 // (Native|Public) // @ game+0x7e53b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_57810D744E7C3FBDD015CAA7F41F4FC9(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_57810D744E7C3FBDD015CAA7F41F4FC9 // (Native|Public) // @ game+0x1b3a080
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3B7C19954B39C84A940DAAA2F33497FF(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3B7C19954B39C84A940DAAA2F33497FF // (Native|Public) // @ game+0x1b39a10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3894EEFF4AF65DB06E1EF6B3E50D61C8(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3894EEFF4AF65DB06E1EF6B3E50D61C8 // (Native|Public) // @ game+0xc6cfc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_22B64B724989FED60A22A891E13B0124(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_22B64B724989FED60A22A891E13B0124 // (Native|Public) // @ game+0x1b39a70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_157669F74CFD34995FC79C884849B3AC(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_157669F74CFD34995FC79C884849B3AC // (Native|Public) // @ game+0x1b399d0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_12DD48B84B001C059F7A2AB37F97FCFB(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_12DD48B84B001C059F7A2AB37F97FCFB // (Native|Public) // @ game+0x1b39ba0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0C1E6158487EAC02C7B875B4515A137E(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0C1E6158487EAC02C7B875B4515A137E // (Native|Public) // @ game+0x1b39ea0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_096C1B414C4EC717A873538B7A500073(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_096C1B414C4EC717A873538B7A500073 // (Native|Public) // @ game+0x1b39b40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B88F52044BA7D36ADD40709403A148A7(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B88F52044BA7D36ADD40709403A148A7 // (Native|Public) // @ game+0x1b399b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_9521C87845A62B5E05A2FC98EEAE4394(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_9521C87845A62B5E05A2FC98EEAE4394 // (Native|Public) // @ game+0x1b39a50
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_6E0892AF47D14DE4DBFCD6A9DD05BF1F(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_6E0892AF47D14DE4DBFCD6A9DD05BF1F // (Native|Public) // @ game+0x1b39990
	void AnimNotify_QuitIdle(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitIdle // (Native|Public|BlueprintCallable) // @ game+0x1b39b60
	void AnimNotify_QuitFire(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitFire // (Native|Public|BlueprintCallable) // @ game+0x1b39b20
	void AnimNotify_EnterIdle(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterIdle // (Native|Public|BlueprintCallable) // @ game+0x1b47430
	void AnimNotify_EnterFire(); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterFire // (Native|Public|BlueprintCallable) // @ game+0x1b39a30
	void AnimGraph(struct FPoseLink& bpp__AnimGraph__pf); // Function R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A06_Set00_LODP_Skeleton_AnimBlueprint_C.AnimGraph // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1b77560
};

