// DynamicClass R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C
// Size: 0x9e0 (Inherited: 0x2d0)
struct UR_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C : UWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x708(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xb0)
	struct FAnimMsgData K2Node_MakeStruct_AnimMsgData; // 0x9c0(0x08)
	struct TArray<struct FAnimMsgData> K2Node_MakeArray_Array; // 0x9c8(0x10)
	char pad_9D8[0x8]; // 0x9d8(0x08)

	void TestAPI(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.TestAPI // (Native|Public|BlueprintCallable) // @ game+0x1b39970
	void InterruptAnim(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.InterruptAnim // (Native|Public|BlueprintCallable) // @ game+0x1b47550
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F9B9D1D1429B89723237BCB24B54862E(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F9B9D1D1429B89723237BCB24B54862E // (Native|Public) // @ game+0xc6d000
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E81BBECC4F2539FBCC25DFBE34448455(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E81BBECC4F2539FBCC25DFBE34448455 // (Native|Public) // @ game+0x1b39a10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E790E6FA43FF01001DC00EBAE7DEA73A(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E790E6FA43FF01001DC00EBAE7DEA73A // (Native|Public) // @ game+0x1b39b80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_DC9EA4E74865E73956415D9AF6AF0FFB(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_DC9EA4E74865E73956415D9AF6AF0FFB // (Native|Public) // @ game+0x1b39a70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052 // (Native|Public) // @ game+0x1b399f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A975C81F48BDBB724FEA16A32DFE52AD(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A975C81F48BDBB724FEA16A32DFE52AD // (Native|Public) // @ game+0x1b39bc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A83B21F44232771E157063B19FE49DAE(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A83B21F44232771E157063B19FE49DAE // (Native|Public) // @ game+0x1b39ea0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A5A85ECA4384FEB312E5EC9FAEEBC8EF(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A5A85ECA4384FEB312E5EC9FAEEBC8EF // (Native|Public) // @ game+0x1b39ba0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A22C0EEB41705474E28772B94C0CC5EB(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A22C0EEB41705474E28772B94C0CC5EB // (Native|Public) // @ game+0x1b39f40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_907282E34D2CAA9D3A150695E8520162(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_907282E34D2CAA9D3A150695E8520162 // (Native|Public) // @ game+0x1b3a120
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4E1475084D2538539DC6B7B5FE4829E3(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4E1475084D2538539DC6B7B5FE4829E3 // (Native|Public) // @ game+0x7e53b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_306B18E0410A5BCBF024F5BE0FAB5E62(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_306B18E0410A5BCBF024F5BE0FAB5E62 // (Native|Public) // @ game+0x1b39b40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_25994E49470CDA5E127ECA9658B84C2C(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_25994E49470CDA5E127ECA9658B84C2C // (Native|Public) // @ game+0x1b39d20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_241F2F034EA4B16FD25A7FA8376C1262(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_241F2F034EA4B16FD25A7FA8376C1262 // (Native|Public) // @ game+0x1b399d0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_13E18D2B4DDE406CA9E094A97AAB8CB2(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_13E18D2B4DDE406CA9E094A97AAB8CB2 // (Native|Public) // @ game+0x1b3a080
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_125A882A42DD03542B5F35AA4CA5C649(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_125A882A42DD03542B5F35AA4CA5C649 // (Native|Public) // @ game+0x1b39f00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0D0306C84CEAEC5B427587847A0781A8(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0D0306C84CEAEC5B427587847A0781A8 // (Native|Public) // @ game+0x1b39fa0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0AA3044A40FAC11D469367A4DF67F175(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0AA3044A40FAC11D469367A4DF67F175 // (Native|Public) // @ game+0x1b39c60
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_00A6E5CC469B38D9B7CBF9B11D9E2044(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_00A6E5CC469B38D9B7CBF9B11D9E2044 // (Native|Public) // @ game+0xc6cfc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_F51C3A6B44503A03F1755DBDE8B8461F(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_F51C3A6B44503A03F1755DBDE8B8461F // (Native|Public) // @ game+0x1b399b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_D259476E46AC7C2E329C7A9BFA6A26D1(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_D259476E46AC7C2E329C7A9BFA6A26D1 // (Native|Public) // @ game+0x1b39a50
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_5AE0E49E4A554133EEF277A411847096(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_5AE0E49E4A554133EEF277A411847096 // (Native|Public) // @ game+0x1b39990
	void AnimNotify_QuitIdle(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitIdle // (Native|Public|BlueprintCallable) // @ game+0x1b39b60
	void AnimNotify_QuitFire(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitFire // (Native|Public|BlueprintCallable) // @ game+0x1b39b20
	void AnimNotify_EnterIdle(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterIdle // (Native|Public|BlueprintCallable) // @ game+0x1b47430
	void AnimNotify_EnterFire(); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterFire // (Native|Public|BlueprintCallable) // @ game+0x1b39a30
	void AnimGraph(struct FPoseLink& bpp__AnimGraph__pf); // Function R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_9A02_Set00_LODP_Skeleton_AnimBlueprint_C.AnimGraph // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1b77560
};

