// DynamicClass R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C
// Size: 0x9e0 (Inherited: 0x2d0)
struct UR_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C : UWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x708(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xb0)
	struct FAnimMsgData K2Node_MakeStruct_AnimMsgData; // 0x9c0(0x08)
	struct TArray<struct FAnimMsgData> K2Node_MakeArray_Array; // 0x9c8(0x10)
	char pad_9D8[0x8]; // 0x9d8(0x08)

	void TestAPI(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.TestAPI // (Native|Public|BlueprintCallable) // @ game+0x1b39970
	void InterruptAnim(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.InterruptAnim // (Native|Public|BlueprintCallable) // @ game+0x1b47550
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F864A8404805F7EACEFC909E832043EE(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F864A8404805F7EACEFC909E832043EE // (Native|Public) // @ game+0xc6cfc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EF1003244660F4F16818ACB549FE30A2(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EF1003244660F4F16818ACB549FE30A2 // (Native|Public) // @ game+0x1b39a70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C9FED2714733C7A7136C3B853D25E8AF(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C9FED2714733C7A7136C3B853D25E8AF // (Native|Public) // @ game+0x1b3a080
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C75E784B46BBB88DCA0310ACB0D26B5C(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C75E784B46BBB88DCA0310ACB0D26B5C // (Native|Public) // @ game+0x1b39b40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052 // (Native|Public) // @ game+0x1b399f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B0F67D2C42C3309858AB33AC10288A84(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B0F67D2C42C3309858AB33AC10288A84 // (Native|Public) // @ game+0x1b39b80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A9D4CFA64B088023BC866EB7258D24DB(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A9D4CFA64B088023BC866EB7258D24DB // (Native|Public) // @ game+0x1b39ea0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A09B0CDA42727AF610670C94DE73F3FB(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A09B0CDA42727AF610670C94DE73F3FB // (Native|Public) // @ game+0x7e53b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6DD2D4034F92A9BD828C65B8BFBA2293(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6DD2D4034F92A9BD828C65B8BFBA2293 // (Native|Public) // @ game+0x1b399d0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_648093B0430A4941FAABC299AD2FE963(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_648093B0430A4941FAABC299AD2FE963 // (Native|Public) // @ game+0x1b39f00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_52925DBD4E136234F3ECC881874BD63D(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_52925DBD4E136234F3ECC881874BD63D // (Native|Public) // @ game+0x1b39a10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5253111046BC8B08009AD3A86A2A6A92(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5253111046BC8B08009AD3A86A2A6A92 // (Native|Public) // @ game+0x1b3a120
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4891E8A74C85C9FAA5F481BF49F3C328(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_4891E8A74C85C9FAA5F481BF49F3C328 // (Native|Public) // @ game+0x1b39ba0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3F59DA0B453648FCA8849BB4F06C4CAD(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3F59DA0B453648FCA8849BB4F06C4CAD // (Native|Public) // @ game+0x1b39d20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3648865447AFE466BAF6F1AA55855DBA(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_3648865447AFE466BAF6F1AA55855DBA // (Native|Public) // @ game+0x1b39bc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2B2B494947D256B2462E0C8D47029D4D(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2B2B494947D256B2462E0C8D47029D4D // (Native|Public) // @ game+0xc6d000
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1A41016A4CC12032E6B0F3B5B6DDF69A(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1A41016A4CC12032E6B0F3B5B6DDF69A // (Native|Public) // @ game+0x1b39f40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1210DDEB4E4988C12C9E2E8BBF476289(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1210DDEB4E4988C12C9E2E8BBF476289 // (Native|Public) // @ game+0x1b39fa0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_06660E20471885C3FDEA209298977A13(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_06660E20471885C3FDEA209298977A13 // (Native|Public) // @ game+0x1b39c60
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B900DE27498B8EBDD9C81293F7BB1ED6(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_B900DE27498B8EBDD9C81293F7BB1ED6 // (Native|Public) // @ game+0x1b399b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_AEDD1FCA452DB89BD307AAA8B18B310C(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_AEDD1FCA452DB89BD307AAA8B18B310C // (Native|Public) // @ game+0x1b39a50
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_611D453D494879EE90A0FE84805C41A1(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_611D453D494879EE90A0FE84805C41A1 // (Native|Public) // @ game+0x1b39990
	void AnimNotify_QuitIdle(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitIdle // (Native|Public|BlueprintCallable) // @ game+0x1b39b60
	void AnimNotify_QuitFire(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitFire // (Native|Public|BlueprintCallable) // @ game+0x1b39b20
	void AnimNotify_EnterIdle(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterIdle // (Native|Public|BlueprintCallable) // @ game+0x1b47430
	void AnimNotify_EnterFire(); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterFire // (Native|Public|BlueprintCallable) // @ game+0x1b39a30
	void AnimGraph(struct FPoseLink& bpp__AnimGraph__pf); // Function R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_WL05_Set00_LODP_Skeleton_AnimBlueprint_C.AnimGraph // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1b77560
};

