// DynamicClass R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C
// Size: 0x9e0 (Inherited: 0x2d0)
struct UR_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C : UWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x5d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x600(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x6d8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x708(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x910(0xb0)
	struct FAnimMsgData K2Node_MakeStruct_AnimMsgData; // 0x9c0(0x08)
	struct TArray<struct FAnimMsgData> K2Node_MakeArray_Array; // 0x9c8(0x10)
	char pad_9D8[0x8]; // 0x9d8(0x08)

	void TestAPI(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.TestAPI // (Native|Public|BlueprintCallable) // @ game+0x1b39970
	void InterruptAnim(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.InterruptAnim // (Native|Public|BlueprintCallable) // @ game+0x1b47550
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F24ACCD04F9816FE9D766B945C515A17(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F24ACCD04F9816FE9D766B945C515A17 // (Native|Public) // @ game+0xc6d000
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EE537D0E40457B0C18FCAEBC0C3ED399(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EE537D0E40457B0C18FCAEBC0C3ED399 // (Native|Public) // @ game+0x1b39f40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E0229C914BA4E5771C33CCBDC40559C5(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_E0229C914BA4E5771C33CCBDC40559C5 // (Native|Public) // @ game+0x7e53b0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D066E4F445D8B9D17E881E99F7DDFDFC(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_D066E4F445D8B9D17E881E99F7DDFDFC // (Native|Public) // @ game+0x1b39ea0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C56C131748626A9573F10282DB5E5052 // (Native|Public) // @ game+0x1b399f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_BC0CF4F64A6C98918E7513B5D9394953(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_BC0CF4F64A6C98918E7513B5D9394953 // (Native|Public) // @ game+0x1b39bc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B4B62B9D47B0C1161E6CE19216D27AEA(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_B4B62B9D47B0C1161E6CE19216D27AEA // (Native|Public) // @ game+0x1b3a120
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AABE1C004ECF87A2034CCA88B05CDD38(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_AABE1C004ECF87A2034CCA88B05CDD38 // (Native|Public) // @ game+0x1b39ba0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A863A2F74187E8118A2F6D8E60300523(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A863A2F74187E8118A2F6D8E60300523 // (Native|Public) // @ game+0x1b39f00
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84EB688D49FE8D60181894BF737AC498(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_84EB688D49FE8D60181894BF737AC498 // (Native|Public) // @ game+0x1b39d20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7B529D21433A869664E2179B4C613BA5(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7B529D21433A869664E2179B4C613BA5 // (Native|Public) // @ game+0x1b3a080
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_77EDB4C1425DF2DF774DAEB1479B3048(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_77EDB4C1425DF2DF774DAEB1479B3048 // (Native|Public) // @ game+0x1b39b40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6CEE3A2D414CEB6E9949B3AE8B35E54E(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6CEE3A2D414CEB6E9949B3AE8B35E54E // (Native|Public) // @ game+0x1b39c60
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_68B6675247DA823995BD8A8473A86377(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_68B6675247DA823995BD8A8473A86377 // (Native|Public) // @ game+0x1b39a10
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_50AE56FC480E668DE2BAE78A71FF5789(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_50AE56FC480E668DE2BAE78A71FF5789 // (Native|Public) // @ game+0xc6cfc0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_47B480004460910C1D11029F8F7F5163(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_47B480004460910C1D11029F8F7F5163 // (Native|Public) // @ game+0x1b39b80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_37A891C448B1ADADFF382886CBBA43FF(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_37A891C448B1ADADFF382886CBBA43FF // (Native|Public) // @ game+0x1b399d0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_13B1B2364014E8EE709B10992D43ECBF(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_13B1B2364014E8EE709B10992D43ECBF // (Native|Public) // @ game+0x1b39a70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0011171C434B57CADB4A22B6D1C6DEF5(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0011171C434B57CADB4A22B6D1C6DEF5 // (Native|Public) // @ game+0x1b39fa0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_FD9E62FB4BF9F8E65B55ABB0CCD5B28C(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_FD9E62FB4BF9F8E65B55ABB0CCD5B28C // (Native|Public) // @ game+0x1b39990
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_E4E641294B19BA48572E4BAAE5E32FA9(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_E4E641294B19BA48572E4BAAE5E32FA9 // (Native|Public) // @ game+0x1b39a50
	void EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_7208B17C4942AAB3573456B9468769AA(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_AnimGraphNode_SequencePlayer_7208B17C4942AAB3573456B9468769AA // (Native|Public) // @ game+0x1b399b0
	void AnimNotify_QuitIdle(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitIdle // (Native|Public|BlueprintCallable) // @ game+0x1b39b60
	void AnimNotify_QuitFire(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_QuitFire // (Native|Public|BlueprintCallable) // @ game+0x1b39b20
	void AnimNotify_EnterIdle(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterIdle // (Native|Public|BlueprintCallable) // @ game+0x1b47430
	void AnimNotify_EnterFire(); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.AnimNotify_EnterFire // (Native|Public|BlueprintCallable) // @ game+0x1b39a30
	void AnimGraph(struct FPoseLink& bpp__AnimGraph__pf); // Function R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint.R_Weapon_B9A04_Set00_LODP_Skeleton_AnimBlueprint_C.AnimGraph // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1b77560
};

