// WidgetBlueprintGeneratedClass UI_Lobby.UI_Lobby_C
// Size: 0x8e0 (Inherited: 0x458)
struct UUI_Lobby_C : UUI_LobbyBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x458(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x460(0x08)
	struct UWidgetAnimation* Anim_Enter; // 0x468(0x08)
	struct UCanvasPanel* Adapter; // 0x470(0x08)
	struct USolarButton* Btn_Activity; // 0x478(0x08)
	struct UButton* Btn_Character; // 0x480(0x08)
	struct UButton* Btn_Clan; // 0x488(0x08)
	struct UButton* Btn_Collection; // 0x490(0x08)
	struct UButton* Btn_Leaderboard; // 0x498(0x08)
	struct UButton* Btn_MailBox; // 0x4a0(0x08)
	struct UButton* Btn_More; // 0x4a8(0x08)
	struct UButton* Btn_PopupLayer; // 0x4b0(0x08)
	struct UButton* Btn_Raffle; // 0x4b8(0x08)
	struct USolarButton* Btn_Rank; // 0x4c0(0x08)
	struct UButton* Btn_Settings; // 0x4c8(0x08)
	struct USolarButton* Btn_Shop; // 0x4d0(0x08)
	struct UButton* Btn_Social; // 0x4d8(0x08)
	struct UButton* Btn_Task; // 0x4e0(0x08)
	struct UButton* Btn_Topup; // 0x4e8(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Activity; // 0x4f0(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Clan; // 0x4f8(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Collection; // 0x500(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Heros; // 0x508(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Leaderboard; // 0x510(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Raffle; // 0x518(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Rank; // 0x520(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Shop; // 0x528(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_SupplyBox; // 0x530(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Task; // 0x538(0x08)
	struct UBtn_Unlock_Anim_1_C* Btn_Unlock_Anim_Tournament; // 0x540(0x08)
	struct UButton* Button_CloseEmoji; // 0x548(0x08)
	struct USolarButton* Button_Emoji; // 0x550(0x08)
	struct USolarButton* Button_Emoji_Close; // 0x558(0x08)
	struct UCanvasPanel* CanvasPanel_Container; // 0x560(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag; // 0x568(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_2; // 0x570(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_3; // 0x578(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_4; // 0x580(0x08)
	struct UUI_Warehouse_DragPanel_C* DragPanel_5; // 0x588(0x08)
	struct UUI_Component_Emoji_List_C* Emoji_List; // 0x590(0x08)
	struct USolarCheckBox* EmojiBtn; // 0x598(0x08)
	struct UScaleBox* EmoteScaleBox_2; // 0x5a0(0x08)
	struct UScaleBox* EmoteScaleBox_3; // 0x5a8(0x08)
	struct UScaleBox* EmoteScaleBox_4; // 0x5b0(0x08)
	struct UScaleBox* EmoteScaleBox_5; // 0x5b8(0x08)
	struct USolarRedHint_General_C* HintPoint_Clan; // 0x5c0(0x08)
	struct UImage* Img_Activity; // 0x5c8(0x08)
	struct UImage* Img_Clan; // 0x5d0(0x08)
	struct UImage* Img_Ping; // 0x5d8(0x08)
	struct UImage* Img_UnlockAnim; // 0x5e0(0x08)
	struct UImage* Line_3; // 0x5e8(0x08)
	struct UOverlay* Overlay_BattlePass; // 0x5f0(0x08)
	struct UCanvasPanel* Panel; // 0x5f8(0x08)
	struct UCanvasPanel* Panel_Activity; // 0x600(0x08)
	struct UCanvasPanel* Panel_ActivityContent; // 0x608(0x08)
	struct UCanvasPanel* Panel_Clan; // 0x610(0x08)
	struct UCanvasPanel* Panel_Clan_Content; // 0x618(0x08)
	struct UCanvasPanel* Panel_Collection; // 0x620(0x08)
	struct UCanvasPanel* Panel_Collection_Content; // 0x628(0x08)
	struct UCanvasPanel* Panel_Commerce; // 0x630(0x08)
	struct UCanvasPanel* Panel_Emoji; // 0x638(0x08)
	struct UCanvasPanel* Panel_Heros; // 0x640(0x08)
	struct UCanvasPanel* Panel_Heros_Content; // 0x648(0x08)
	struct UCanvasPanel* Panel_Invite; // 0x650(0x08)
	struct UCanvasPanel* Panel_Leaderboard; // 0x658(0x08)
	struct UCanvasPanel* Panel_Leaderboard_Content; // 0x660(0x08)
	struct UCanvasPanel* Panel_MailBox; // 0x668(0x08)
	struct UCanvasPanel* Panel_More; // 0x670(0x08)
	struct UCanvasPanel* Panel_Privileges; // 0x678(0x08)
	struct UCanvasPanel* Panel_Profession; // 0x680(0x08)
	struct UCanvasPanel* Panel_Raffle; // 0x688(0x08)
	struct UCanvasPanel* Panel_RaffleContent; // 0x690(0x08)
	struct UCanvasPanel* Panel_Rank; // 0x698(0x08)
	struct UCanvasPanel* Panel_Rank_Content; // 0x6a0(0x08)
	struct UCanvasPanel* Panel_RedPacket; // 0x6a8(0x08)
	struct UCanvasPanel* Panel_Settings; // 0x6b0(0x08)
	struct UCanvasPanel* Panel_Shop; // 0x6b8(0x08)
	struct UCanvasPanel* Panel_Shop_Content; // 0x6c0(0x08)
	struct UCanvasPanel* Panel_Social; // 0x6c8(0x08)
	struct UCanvasPanel* Panel_SupplyBox; // 0x6d0(0x08)
	struct UCanvasPanel* Panel_SupplyBox_Content; // 0x6d8(0x08)
	struct UHorizontalBox* Panel_System; // 0x6e0(0x08)
	struct UCanvasPanel* Panel_Task; // 0x6e8(0x08)
	struct UCanvasPanel* Panel_Task_Content; // 0x6f0(0x08)
	struct UCanvasPanel* Panel_Topup; // 0x6f8(0x08)
	struct UCanvasPanel* Panel_Tournament; // 0x700(0x08)
	struct UCanvasPanel* Panel_Tournament_Content; // 0x708(0x08)
	struct UCanvasPanel* PopupLayer; // 0x710(0x08)
	struct UUI_Lobby_Privileges_C* Privileges; // 0x718(0x08)
	struct UUI_Lobby_Profession_C* Profession_2; // 0x720(0x08)
	struct UUI_Lobby_Profession_C* Profession_3; // 0x728(0x08)
	struct UUI_Lobby_Profession_C* Profession_4; // 0x730(0x08)
	struct UUI_Lobby_Profession_C* Profession_5; // 0x738(0x08)
	struct USolarRedHint_General_C* Red_Rank; // 0x740(0x08)
	struct USolarRedHint_General_C* Red_Shop; // 0x748(0x08)
	struct USolarRedHint_General_C* RedHint_Capsulers; // 0x750(0x08)
	struct USolarRedHint_General_C* RedHint_Collection; // 0x758(0x08)
	struct USolarRedHint_General_C* RedHint_E-Mail; // 0x760(0x08)
	struct USolarRedHint_General_C* RedHint_Leaderboard; // 0x768(0x08)
	struct USolarRedHint_General_C* RedHint_More; // 0x770(0x08)
	struct USolarRedHint_General_C* RedHint_Social; // 0x778(0x08)
	struct USolarRedHint_General_C* RedHint_Task; // 0x780(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General; // 0x788(0x08)
	struct USolarRedHint_General_C* SolarRedHint_General_2; // 0x790(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_2; // 0x798(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_3; // 0x7a0(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_4; // 0x7a8(0x08)
	struct UUI_Lobby_TeamMember_Operation_C* TeamMember_CallingCard_5; // 0x7b0(0x08)
	struct UTextBlock* Text_MatchInfo; // 0x7b8(0x08)
	struct UTextBlock* Text_RoomInfo; // 0x7c0(0x08)
	struct USolarTextBlock* Txt_Clan; // 0x7c8(0x08)
	struct USolarTextBlock* Txt_Season; // 0x7d0(0x08)
	struct UUI_ChatPanel_C* UI_ChatPanel; // 0x7d8(0x08)
	struct UUI_Lobby_Banner_C* UI_Lobby_Banner; // 0x7e0(0x08)
	struct UUI_Lobby_Battery_C* UI_Lobby_Battery; // 0x7e8(0x08)
	struct UUI_Lobby_BattlePass_C* UI_Lobby_BattlePass; // 0x7f0(0x08)
	struct UUI_Lobby_BattlePass3_C* UI_Lobby_BattlePass3; // 0x7f8(0x08)
	struct UUI_Lobby_BattlePass_Next_C* UI_Lobby_BattlePass_Next; // 0x800(0x08)
	struct UUI_Currency_Bar_C* UI_Lobby_Currency; // 0x808(0x08)
	struct UUI_Lobby_DownLoad_C* UI_Lobby_DownLoad; // 0x810(0x08)
	struct UUI_Lobby_GameRecommend_C* UI_Lobby_GameRecommend; // 0x818(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_3; // 0x820(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_4; // 0x828(0x08)
	struct UUI_Lobby_Invite_Btn_C* UI_Lobby_Invite_Btn_5; // 0x830(0x08)
	struct UUI_Lobby_Mainmenu_C* UI_Lobby_Mainmenu; // 0x838(0x08)
	struct UUI_Lobby_MatchRoom_C* UI_Lobby_MatchRoom; // 0x840(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_2; // 0x848(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_3; // 0x850(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_4; // 0x858(0x08)
	struct UUI_Lobby_MedalShow_C* UI_Lobby_MedalShow_5; // 0x860(0x08)
	struct UUI_Lobby_Mission_Reward_C* UI_Lobby_Mission_Reward; // 0x868(0x08)
	struct UUI_Lobby_PlayerInfo_C* UI_Lobby_PlayerInfo; // 0x870(0x08)
	struct UUI_Lobby_RandomPack_C* UI_Lobby_RandomPack; // 0x878(0x08)
	struct UUI_Lobby_Recruit_C* UI_Lobby_Recruit; // 0x880(0x08)
	struct UUI_Lobby_RedPacket_C* UI_Lobby_RedPacket; // 0x888(0x08)
	struct UUI_Lobby_Sanctuary_C* UI_Lobby_Sanctuary; // 0x890(0x08)
	struct UUI_Lobby_Social_Entrance_C* UI_Lobby_Social_Entrance; // 0x898(0x08)
	struct UUI_Lobby_StartBtn_C* UI_Lobby_StartBtn; // 0x8a0(0x08)
	struct UUI_Lobby_SupplyBox_C* UI_Lobby_SupplyBox; // 0x8a8(0x08)
	struct UUI_Lobby_Topup_C* UI_Lobby_Topup; // 0x8b0(0x08)
	struct UUI_Lobby_Tournament_C* UI_Lobby_Tournament; // 0x8b8(0x08)
	struct UUI_MicroPhoneSetting_C* UI_MicroPhoneSetting; // 0x8c0(0x08)
	struct UUI_Rank_Icon_Small_C* UI_Rank_Icon_Small; // 0x8c8(0x08)
	struct UTextBlock* UserId; // 0x8d0(0x08)
	struct UCanvasPanel* Video; // 0x8d8(0x08)

	void OnRegisterEvent_58B5C0014F7154D5A808F5875A367D7D(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnRegisterEvent_58B5C0014F7154D5A808F5875A367D7D // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_AE0F02874FF5C2C5E7DE9BB27B81B200(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_AE0F02874FF5C2C5E7DE9BB27B81B200 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_8F95B2DA4C524D81F76C5EAE26B32C1F(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8F95B2DA4C524D81F76C5EAE26B32C1F // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_14E981AB4B5ED3233CDAB4ACC407435B(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_14E981AB4B5ED3233CDAB4ACC407435B // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_400160BE44D5572C890D9B81A1432938(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_400160BE44D5572C890D9B81A1432938 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_20846DEA467E731495433087D9815936(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_20846DEA467E731495433087D9815936 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_E85D3A48494CE1BFA7C87E807DC58D6A(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_E85D3A48494CE1BFA7C87E807DC58D6A // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_2E82A65B49C0A1831C0520BDA416CFF7(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_2E82A65B49C0A1831C0520BDA416CFF7 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_773D527B4B7C06849859A2808A98E72A(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_773D527B4B7C06849859A2808A98E72A // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_7D2FAAAB481C13EBFD4BCCA83602CE7F(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_7D2FAAAB481C13EBFD4BCCA83602CE7F // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_5ACD3097496A581E804F518B456B3D59(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5ACD3097496A581E804F518B456B3D59 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnBrowserClosed_F068BE35460C5B065470B09900444863(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnBrowserClosed_F068BE35460C5B065470B09900444863 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnBtnNetBarClicked_5A0D3CAE4F33BDCABB352BBB8BCECF29(); // Function UI_Lobby.UI_Lobby_C.OnBtnNetBarClicked_5A0D3CAE4F33BDCABB352BBB8BCECF29 // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0xb5f200
	void OnClicked_8EA2D98C49CE989EF80FCFB2772AC595(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8EA2D98C49CE989EF80FCFB2772AC595 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_AAE0E2AD498B402D4795F89CC8286E5D(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_AAE0E2AD498B402D4795F89CC8286E5D // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_728272F748EC769C4DC148BC1F7D810C(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_728272F748EC769C4DC148BC1F7D810C // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnCheckStateChanged_0BB49C4149ABD23F35769E84E8CE3A9D(bool bIsChecked); // DelegateFunction UI_Lobby.UI_Lobby_C.OnCheckStateChanged_0BB49C4149ABD23F35769E84E8CE3A9D // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_014794AB485A0828D86373BBF70E6133(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_014794AB485A0828D86373BBF70E6133 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_31DFEBC5405B680739845CA5B82D39B2(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_31DFEBC5405B680739845CA5B82D39B2 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_8E98F19C4990433DDBF3C3B421B3A650(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_8E98F19C4990433DDBF3C3B421B3A650 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_DB962B31483EBD6CF400739A401FA77B(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_DB962B31483EBD6CF400739A401FA77B // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_D6367278434D958E1AD0A8AC747D3227(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_D6367278434D958E1AD0A8AC747D3227 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_183C77EC4F5696C34B6871BD74C100DE(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_183C77EC4F5696C34B6871BD74C100DE // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_D5925F524F6EC194CBA0D2BD73698C6F(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_D5925F524F6EC194CBA0D2BD73698C6F // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_A3701587480051D6466C598A6BC8E48E(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A3701587480051D6466C598A6BC8E48E // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_463E6AB7492C04E563BBBB95639DDF23(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_463E6AB7492C04E563BBBB95639DDF23 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_4192275849243B7BE9A1CF8AE167A2D5(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_4192275849243B7BE9A1CF8AE167A2D5 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_960D94CF42EDD7C01D2859A271641B62(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_960D94CF42EDD7C01D2859A271641B62 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_5BA26C984EE41558C5AF3F8D46A5A8CF(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_5BA26C984EE41558C5AF3F8D46A5A8CF // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_4E96A4224E2B729DD983AC8E967DCC4C(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_4E96A4224E2B729DD983AC8E967DCC4C // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_AA9309FC4EB8439D1F761AA3F6FE92A0(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_AA9309FC4EB8439D1F761AA3F6FE92A0 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_818D8B7048707B710A1E14817423C803(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_818D8B7048707B710A1E14817423C803 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_A7B4C08A48F8816CFD9094952BBC03E4(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_A7B4C08A48F8816CFD9094952BBC03E4 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_13234DA24397BC8FA0799896956FA27F(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_13234DA24397BC8FA0799896956FA27F // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_099FD06E439A225002624AB29CC52F50(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_099FD06E439A225002624AB29CC52F50 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_D3107FC94C3BEF42EE07ACAF6210C20A(); // DelegateFunction UI_Lobby.UI_Lobby_C.OnClicked_D3107FC94C3BEF42EE07ACAF6210C20A // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void ConstructCopy(); // Function UI_Lobby.UI_Lobby_C.ConstructCopy // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d63a00
	void OnAnimationFinished(struct UWidgetAnimation* Animation); // Function UI_Lobby.UI_Lobby_C.OnAnimationFinished // (BlueprintCosmetic|Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	void OnBackKey(enum class EWidgetBackKeyType BackKeyType); // Function UI_Lobby.UI_Lobby_C.OnBackKey // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	void OnShow(); // Function UI_Lobby.UI_Lobby_C.OnShow // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	void OnSolarUIClosed(); // Function UI_Lobby.UI_Lobby_C.OnSolarUIClosed // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	void OnInitialized(); // Function UI_Lobby.UI_Lobby_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6d460
	void OnHide(); // Function UI_Lobby.UI_Lobby_C.OnHide // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	void Destruct(); // Function UI_Lobby.UI_Lobby_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6d460
	void OnSolarUIOpened(); // Function UI_Lobby.UI_Lobby_C.OnSolarUIOpened // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6d460
	struct FString GetModuleName(); // Function UI_Lobby.UI_Lobby_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2d63a00
	void SetLevel(int32_t Level); // Function UI_Lobby.UI_Lobby_C.SetLevel // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d63a00
	void GetAnimTargetLocation(struct UWidget* TargetObject, struct UWidget* UserObject, struct FVector2D& TargetLocation); // Function UI_Lobby.UI_Lobby_C.GetAnimTargetLocation // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2d63a00
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby.UI_Lobby_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d63a00
	void Construct(); // Function UI_Lobby.UI_Lobby_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6d460
	void ReceiveShow(); // Function UI_Lobby.UI_Lobby_C.ReceiveShow // (Event|Protected|BlueprintEvent) // @ game+0x2d63a00
	void ExecuteUbergraph_UI_Lobby(int32_t EntryPoint); // Function UI_Lobby.UI_Lobby_C.ExecuteUbergraph_UI_Lobby // (Final|UbergraphFunction) // @ game+0x2d63a00
};

