// WidgetBlueprintGeneratedClass UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C
// Size: 0x493 (Inherited: 0x260)
struct UUI_Lobby_RoomInvite_MIni_Popup_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* Anim_Loop; // 0x268(0x08)
	struct UWidgetAnimation* Anim_Enter; // 0x270(0x08)
	struct USolarButton* Btn_Join_Common; // 0x278(0x08)
	struct USolarButton* Btn_Join_League; // 0x280(0x08)
	struct USolarButton* Btn_Joining; // 0x288(0x08)
	struct UButton* Btn_Player; // 0x290(0x08)
	struct UButton* Btn_Player_2; // 0x298(0x08)
	struct UButton* Btn_Player_3; // 0x2a0(0x08)
	struct UButton* Btn_Player_4; // 0x2a8(0x08)
	struct UButton* Btn_Player_5; // 0x2b0(0x08)
	struct USolarButton* Btn_Watch; // 0x2b8(0x08)
	struct UHorizontalBox* HorizentalBox_Match; // 0x2c0(0x08)
	struct UHorizontalBox* HorizentalBox_Spectator; // 0x2c8(0x08)
	struct UHorizontalBox* HorizontalBox_Join_2; // 0x2d0(0x08)
	struct UHorizontalBox* HorizontalBox_Joining_2; // 0x2d8(0x08)
	struct UHorizontalBox* HorizontalBox_Player; // 0x2e0(0x08)
	struct UHorizontalBox* HorizontalBox_Progress_Time; // 0x2e8(0x08)
	struct UHorizontalBox* HorizontalBox_Title_Common; // 0x2f0(0x08)
	struct UHorizontalBox* HorizontalBox_Title_League; // 0x2f8(0x08)
	struct UHorizontalBox* HorizontalBox_Watch; // 0x300(0x08)
	struct UImage* Img_BG_Invitation; // 0x308(0x08)
	struct UImage* Img_BG_Light; // 0x310(0x08)
	struct UImage* Img_BG_Light_01; // 0x318(0x08)
	struct UImage* Img_Btn_Join; // 0x320(0x08)
	struct UImage* Img_Btn_Join_2; // 0x328(0x08)
	struct UImage* Img_Btn_Joining_Close; // 0x330(0x08)
	struct UImage* Img_Btn_Watch; // 0x338(0x08)
	struct UImage* Img_Division; // 0x340(0x08)
	struct UImage* Img_Join_Common_Light; // 0x348(0x08)
	struct UImage* Img_Join_Light; // 0x350(0x08)
	struct USolarImageURL* Img_League_Icon; // 0x358(0x08)
	struct UImage* Img_Time_Icon; // 0x360(0x08)
	struct UImage* Img_Title_BG; // 0x368(0x08)
	struct UImage* Img_Title_BG_2; // 0x370(0x08)
	struct UImage* Img_Title_BG_3; // 0x378(0x08)
	struct UImage* Img_Watch_Light; // 0x380(0x08)
	struct UOverlay* Overlay_Avatar; // 0x388(0x08)
	struct UOverlay* Overlay_Avatar_2; // 0x390(0x08)
	struct UOverlay* Overlay_Avatar_3; // 0x398(0x08)
	struct UOverlay* Overlay_Avatar_4; // 0x3a0(0x08)
	struct UOverlay* Overlay_Avatar_5; // 0x3a8(0x08)
	struct UOverlay* Overlay_Cup; // 0x3b0(0x08)
	struct UCanvasPanel* Panel_Info_CreateRoom; // 0x3b8(0x08)
	struct UCanvasPanel* Panel_Info_Invitation; // 0x3c0(0x08)
	struct UCanvasPanel* Panel_Pop_Common; // 0x3c8(0x08)
	struct UCanvasPanel* Panel_Pop_League; // 0x3d0(0x08)
	struct USolarTextBlock* Txt_Capacity; // 0x3d8(0x08)
	struct USolarTextBlock* Txt_GameMode; // 0x3e0(0x08)
	struct UTickerWidget_C* Txt_Invitation; // 0x3e8(0x08)
	struct USolarTextBlock* Txt_Invitation_2; // 0x3f0(0x08)
	struct USolarTextBlock* Txt_Join; // 0x3f8(0x08)
	struct USolarTextBlock* Txt_Join_Common; // 0x400(0x08)
	struct USolarTextBlock* Txt_Joining; // 0x408(0x08)
	struct USolarTextBlock* Txt_League_Name_2; // 0x410(0x08)
	struct USolarTextBlock* Txt_Map; // 0x418(0x08)
	struct UTextBlock* Txt_OBCurr; // 0x420(0x08)
	struct UTextBlock* Txt_OBCurr_2; // 0x428(0x08)
	struct UTextBlock* Txt_OBCurr_4; // 0x430(0x08)
	struct USolarTextBlock* Txt_OBTotal; // 0x438(0x08)
	struct USolarTextBlock* Txt_PlayerIn; // 0x440(0x08)
	struct USolarTextBlock* Txt_Progress_Time; // 0x448(0x08)
	struct USolarTextBlock* Txt_RoomName; // 0x450(0x08)
	struct USolarTextBlock* Txt_Watch; // 0x458(0x08)
	struct UUI_Component_Close_C* UI_Component_Close; // 0x460(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead; // 0x468(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead_2; // 0x470(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead_3; // 0x478(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead_4; // 0x480(0x08)
	struct UUI_Component_PlayerHead_C* UI_Component_PlayerHead_5; // 0x488(0x08)
	enum class T_Type_System_Push Pop_Type; // 0x490(0x01)
	enum class T_Type_Button Btn_Type; // 0x491(0x01)
	bool IsNeedShow; // 0x492(0x01)

	void OnClicked_0C00BC0D4EEEEC768EFC8EB78772BFB0(); // DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_0C00BC0D4EEEEC768EFC8EB78772BFB0 // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_0F0B8A7E4436FC77D19D349213A715BB(); // DelegateFunction UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_0F0B8A7E4436FC77D19D349213A715BB // (MulticastDelegate|Public|Delegate) // @ game+0xb5f200
	void OnClicked_23C0B7AD4942443E777CAAB4E124675B(); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.OnClicked_23C0B7AD4942443E777CAAB4E124675B // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0xb5f200
	void Construct(); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6d460
	void Destruct(); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6d460
	struct FString GetModuleName(); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2d63a00
	void Update_Btn(enum class T_Type_Button NewParam); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.Update_Btn // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d63a00
	void SetType(enum class T_Type_System_Push Type); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.SetType // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2d63a00
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d63a00
	void ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup(int32_t EntryPoint); // Function UI_Lobby_RoomInvite_MIni_Popup.UI_Lobby_RoomInvite_MIni_Popup_C.ExecuteUbergraph_UI_Lobby_RoomInvite_MIni_Popup // (Final|UbergraphFunction) // @ game+0x2d63a00
};

