// WidgetBlueprintGeneratedClass UI_Lobby_StartBtn.UI_Lobby_StartBtn_C
// Size: 0x726 (Inherited: 0x400)
struct UUI_Lobby_StartBtn_C : USolarUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x08)
	struct UWidgetAnimation* Anim_Tournament_Enter; // 0x408(0x08)
	struct UWidgetAnimation* Anim_Activity_Enter; // 0x410(0x08)
	struct UWidgetAnimation* Loop_Normal_Anim; // 0x418(0x08)
	struct UWidgetAnimation* Loading_Anim; // 0x420(0x08)
	struct UWidgetAnimation* Loop_Start_Anim; // 0x428(0x08)
	struct UButton* Btn_Activity_Point; // 0x430(0x08)
	struct UButton* Btn_Activity_Point_2; // 0x438(0x08)
	struct UButton* Btn_Activity_Point_3; // 0x440(0x08)
	struct UButton* Btn_Cancel; // 0x448(0x08)
	struct UButton* Btn_Clan_Join; // 0x450(0x08)
	struct UButton* Btn_Clan_Join_2; // 0x458(0x08)
	struct UButton* Btn_Clan_Join_3; // 0x460(0x08)
	struct UButton* Btn_Clan_Reward; // 0x468(0x08)
	struct UButton* Btn_Clan_Reward_2; // 0x470(0x08)
	struct UButton* Btn_Clan_Reward_3; // 0x478(0x08)
	struct UButton* Btn_GameMode; // 0x480(0x08)
	struct UButton* Btn_Start; // 0x488(0x08)
	struct UButton* Btn_Tournament_Reward; // 0x490(0x08)
	struct UButton* Btn_Tournament_Reward_2; // 0x498(0x08)
	struct UButton* Btn_Tournament_Reward_3; // 0x4a0(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag; // 0x4a8(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag_2; // 0x4b0(0x08)
	struct UUI_Component_NationalFlag_C* ClanFlag_3; // 0x4b8(0x08)
	struct UScaleBox* GameMode; // 0x4c0(0x08)
	struct UHorizontalBox* HorizontalBox_PC; // 0x4c8(0x08)
	struct UImage* Image_X; // 0x4d0(0x08)
	struct UImage* Img_Activity_BG; // 0x4d8(0x08)
	struct UImage* Img_Activity_BG_2; // 0x4e0(0x08)
	struct UImage* Img_Activity_BG_3; // 0x4e8(0x08)
	struct UImage* Img_Activity_BG_Light; // 0x4f0(0x08)
	struct UImage* Img_Activity_BG_Light_2; // 0x4f8(0x08)
	struct UImage* Img_Activity_BG_Light_3; // 0x500(0x08)
	struct UImage* Img_Activity_BG_Light_4; // 0x508(0x08)
	struct UImage* Img_Activity_BG_Light_5; // 0x510(0x08)
	struct UImage* Img_Activity_BG_Light_6; // 0x518(0x08)
	struct UImage* Img_Activity_BG_Light_7; // 0x520(0x08)
	struct UImage* Img_Activity_BG_Light_8; // 0x528(0x08)
	struct UImage* Img_Activity_BG_Light_9; // 0x530(0x08)
	struct UImage* Img_Activity_BG_Light_10; // 0x538(0x08)
	struct UImage* Img_Activity_BG_Light_11; // 0x540(0x08)
	struct UImage* Img_Activity_BG_Light_12; // 0x548(0x08)
	struct UImage* Img_Arrow; // 0x550(0x08)
	struct UImage* Img_Arrow_Light; // 0x558(0x08)
	struct UImage* Img_GameMode; // 0x560(0x08)
	struct UImage* Img_Loading; // 0x568(0x08)
	struct UImage* Img_Start_Bg; // 0x570(0x08)
	struct UImage* Img_Start_Hover; // 0x578(0x08)
	struct UImage* Img_Start_Normal_Light; // 0x580(0x08)
	struct UCanvasPanel* Panel_Activity_All; // 0x588(0x08)
	struct UCanvasPanel* Panel_Activity_All_2; // 0x590(0x08)
	struct UCanvasPanel* Panel_Activity_All_HD2; // 0x598(0x08)
	struct UCanvasPanel* Panel_Anim; // 0x5a0(0x08)
	struct UCanvasPanel* Panel_Battle; // 0x5a8(0x08)
	struct UCanvasPanel* Panel_Cancel; // 0x5b0(0x08)
	struct UCanvasPanel* Panel_Gamemode; // 0x5b8(0x08)
	struct UCanvasPanel* Panel_HD; // 0x5c0(0x08)
	struct UCanvasPanel* Panel_Matching; // 0x5c8(0x08)
	struct UCanvasPanel* Panel_Mobile; // 0x5d0(0x08)
	struct UCanvasPanel* panel_start; // 0x5d8(0x08)
	struct UCanvasPanel* Panel_Start_Anim; // 0x5e0(0x08)
	struct USolarRedHint_General_C* RedHint_More; // 0x5e8(0x08)
	struct USolarImage* SolarImage_ClanFlag; // 0x5f0(0x08)
	struct USolarRichTextBlock* SolarRichTextBlock_Team; // 0x5f8(0x08)
	struct USolarRichTextBlock* SolarRichTextBlock_Team_2; // 0x600(0x08)
	struct USolarRichTextBlock* SolarRichTextBlock_Team_3; // 0x608(0x08)
	struct UTextBlock* Text_MatchDuration; // 0x610(0x08)
	struct USolarTextBlock* Text_Matching; // 0x618(0x08)
	struct USolarTextBlock* Text_Start; // 0x620(0x08)
	struct UTickerWidget_C* TickerWidget_Join; // 0x628(0x08)
	struct UTickerWidget_C* TickerWidget_Join_2; // 0x630(0x08)
	struct UTickerWidget_C* TickerWidget_Join_3; // 0x638(0x08)
	struct UTickerWidget_C* TickerWidget_Reward; // 0x640(0x08)
	struct UTickerWidget_C* TickerWidget_Reward_2; // 0x648(0x08)
	struct UTickerWidget_C* TickerWidget_Reward_3; // 0x650(0x08)
	struct USolarRichTextBlock* Txt_Activity_Point; // 0x658(0x08)
	struct USolarRichTextBlock* Txt_Activity_Point_2; // 0x660(0x08)
	struct USolarRichTextBlock* Txt_Activity_Point_3; // 0x668(0x08)
	struct USolarTextBlock* TXT_GameMap; // 0x670(0x08)
	struct USolarTextBlock* Txt_Mode; // 0x678(0x08)
	struct UTextBlock* Txt_Team_Num; // 0x680(0x08)
	struct URichTextBlock* Txt_Tournament_Reward; // 0x688(0x08)
	struct URichTextBlock* Txt_Tournament_Reward_2; // 0x690(0x08)
	struct URichTextBlock* Txt_Tournament_Reward_3; // 0x698(0x08)
	struct UUI_Component_Platform_C* UI_Component_Platform; // 0x6a0(0x08)
	struct UUI_KeyPrompt_C* UI_KeyPrompt_Cancel; // 0x6a8(0x08)
	struct UUI_KeyPrompt_C* UI_KeyPrompt_Prepare; // 0x6b0(0x08)
	struct UUI_KeyPrompt_C* UI_KeyPrompt_Start; // 0x6b8(0x08)
	struct UUI_Lobby_Activity_All_Desktop_C* UI_Lobby_Activity_All_Desktop; // 0x6c0(0x08)
	struct UUI_Lobby_Gamemode_Desktop_C* UI_Lobby_Gamemode_Desktop; // 0x6c8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Activity; // 0x6d0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Activity_2; // 0x6d8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Activity_HD; // 0x6e0(0x08)
	bool Leader; // 0x6e8(0x01)
	bool Matching; // 0x6e9(0x01)
	bool Ready; // 0x6ea(0x01)
	bool Disable; // 0x6eb(0x01)
	bool PC; // 0x6ec(0x01)
	char pad_6ED[0x3]; // 0x6ed(0x03)
	struct FLinearColor StartBtnLinearColorWordSolid; // 0x6f0(0x10)
	struct FLinearColor StartBtnLinearColorTimeSolid; // 0x700(0x10)
	struct FLinearColor StartBtnLinearColorWordGreyout; // 0x710(0x10)
	float ActivityIntervalTime; // 0x720(0x04)
	bool IsDesktop; // 0x724(0x01)
	enum class E_Type_State_Desktop StateDesktopStart; // 0x725(0x01)

	void OnClicked_EB2F62DE4148EEEB7DD102BBD679E22D(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_EB2F62DE4148EEEB7DD102BBD679E22D // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void OnClicked_8511B4494CD874DFA5DD5D9A40A19EAA(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_8511B4494CD874DFA5DD5D9A40A19EAA // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void OnClicked_199B73E846318FE415136F82543C51E5(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_199B73E846318FE415136F82543C51E5 // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void OnClicked_9FDF58AF4CC2D11696FEE288AD076E98(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_9FDF58AF4CC2D11696FEE288AD076E98 // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void OnClicked_4CCA550A4D3B4AC82175228BA540FC42(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_4CCA550A4D3B4AC82175228BA540FC42 // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void OnClicked_8F702E1E4505D9F0BAACA883D1940C0E(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_8F702E1E4505D9F0BAACA883D1940C0E // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0xb5e720
	void OnClicked_31AD1CB74CAE05A6F364CF8C16857ACC(); // DelegateFunction UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnClicked_31AD1CB74CAE05A6F364CF8C16857ACC // (MulticastDelegate|Public|Delegate) // @ game+0xb5e720
	void Destruct(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6c980
	void OnSolarUIClosed(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIClosed // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6c980
	void OnSolarUIOpened(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.OnSolarUIOpened // (Native|Event|Protected|BlueprintEvent) // @ game+0xb6c980
	void ConstructCopy(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ConstructCopy // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d64c70
	struct FString GetModuleName(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.GetModuleName // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x2d64c70
	void SetStateDesktop(enum class E_Type_State_Desktop StateDesktopStart, bool IsDesktop); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.SetStateDesktop // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d64c70
	void UpdatePlatformBlendState(bool NewParam); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePlatformBlendState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d64c70
	void UpdatePanelState(bool Leader, bool Matching, bool Ready, bool Disable); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.UpdatePanelState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d64c70
	void Update All Widgets(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Update All Widgets // (BlueprintCallable|BlueprintEvent) // @ game+0x2d64c70
	void PreConstruct(bool IsDesignTime); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d64c70
	void Construct(); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xb6c980
	void ExecuteUbergraph_UI_Lobby_StartBtn(int32_t EntryPoint); // Function UI_Lobby_StartBtn.UI_Lobby_StartBtn_C.ExecuteUbergraph_UI_Lobby_StartBtn // (Final|UbergraphFunction|HasDefaults) // @ game+0x2d64c70
};

